{"word":"antiexpressionism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"反表現主義（はんひょうげんしゅぎ）：表現主義に反対する立場、またはその傾向を持つ芸術運動や思想","english_definition":"Opposition to or rejection of expressionism, especially in art and literature.","examples":[{"sentence":"The artist's work was a clear statement of antiexpressionism, favoring objective representation over emotional outpouring.","translation":"その芸術家の作品は、感情の吐露よりも客観的な描写を重視する、反表現主義の明確な声明であった。"},{"sentence":"Antiexpressionism in literature often manifests as a focus on realism and social commentary.","translation":"文学における反表現主義は、しばしばリアリズムと社会批評への注力として現れる。"}],"collocations":["antiexpressionist art","antiexpressionist movement","literary antiexpressionism"],"synonyms":["anti-expressionism","non-expressionism","realism","objectivism"],"antonyms":["expressionism"]}],"etymology":{"value":"\"anti-\"（反対）+ \"expressionism\"（表現主義）","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiɪkˈspreʃənɪzəm/","syllables":"an-ti-ex-pres-sion-is-m"},"inflection":{"noun_plural":"antiexpressionisms"},"usage_notes":{"explanation":"\"Antiexpressionism\" is a term used primarily in the context of art, literature, and philosophy to describe movements or ideas that explicitly reject the tenets of expressionism. Expressionism emphasizes subjective experience and emotional expression, so antiexpressionism typically favors objectivity, realism, or formalism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an antiexpressionist artist, so his paintings are very emotional.","correct":"✓ He is an antiexpressionist artist, so his paintings are very objective and realistic.","note":"Antiexpressionist artists reject emotional expression in favor of objectivity."}],"priority":"★★☆"},"related_words":{"derivatives":["antiexpressionist (adjective, noun)"],"related_concepts":["expressionism","realism","objectivism","formalism"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"antiexpressionism\" is a relatively advanced concept used in discussions of art, literature, and philosophy. It refers to movements or ideas that oppose the principles of expressionism, which emphasizes subjective experience and emotional expression. Understanding this term requires familiarity with expressionism itself and its key characteristics. Antiexpressionism often involves a focus on objectivity, realism, or formalism as alternatives to emotional subjectivity."},"example_sentences":[{"sentence":"The Neue Sachlichkeit movement in Germany was a form of antiexpressionism that emphasized realism and objectivity.","translation":"ドイツの新即物主義運動は、リアリズムと客観性を重視した反表現主義の一形態であった。","type":"general","meaning_category":"反表現主義の例"},{"sentence":"Some critics saw the minimalist art of the 1960s as a reaction against the emotional intensity of expressionism, marking a shift towards antiexpressionism.","translation":"一部の批評家は、1960年代のミニマルアートを表現主義の感情的な激しさに対する反発とみなし、反表現主義への転換を示すものと捉えた。","type":"historical","meaning_category":"反表現主義の歴史的背景"}]}