{"word":"outfighter","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(ボクシングなどで)アウトボクサー、アウトファイター","english_definition":"A boxer who relies on speed and reach to maintain distance from their opponent, rather than engaging in close-quarters fighting.","examples":[{"sentence":"He's a classic outfighter, always moving and using his jab.","translation":"彼は典型的なアウトファイターで、常に動き回り、ジャブを使います。"},{"sentence":"The outfighter tried to keep his distance from the powerful puncher.","translation":"アウトファイターは、強力なパンチを持つ相手から距離を保とうとしました。"}],"collocations":["classic outfighter","skilled outfighter","outfighter style","outfighter strategy"],"synonyms":["boxer","stylist","finesse fighter"],"antonyms":["infighter","swarmer","slugger"]},{"part_of_speech":"noun","definition":"(一般的に)相手より優れた戦術や戦略で勝利する人","english_definition":"Someone who defeats an opponent by using superior tactics or strategy.","examples":[{"sentence":"In the business world, she's known as an outfighter who always finds a way to win.","translation":"ビジネスの世界では、彼女は常に勝利する方法を見つけるアウトファイターとして知られています。"}],"collocations":["strategic outfighter","tactical outfighter"],"synonyms":["strategist","tactician"],"antonyms":[]}],"etymology":{"value":"The term is derived from 'out-' (meaning away from or at a distance) and 'fighter' (someone who fights). It describes a fighter who prefers to fight at a distance.","priority":"★★★"},"pronunciation":{"ipa":"/ˈaʊtˌfaɪtər/","syllables":"out-fight-er"},"inflection":{"noun_plural":"outfighters"},"usage_notes":{"explanation":"An 'outfighter' in boxing uses footwork, speed, and reach to stay away from their opponent, landing punches from a distance. They prioritize avoiding damage and tiring out their opponent. The term can also be used metaphorically to describe someone who wins through strategy rather than brute force.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an outfighter, so he likes to fight close.","correct":"✓ He is an outfighter, so he likes to fight at a distance.","note":"Outfighters prefer to maintain distance, not fight close. "},{"incorrect":"✗ Outfighter is a type of fighting style like karate.","correct":"✓ Outfighter is a boxing strategy.","note":"Outfighting is a specific strategy within boxing, not a separate martial art."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["boxing","jab","footwork","reach","strategy","tactics","infighter","puncher","counterpuncher"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'outfighter' is specific to boxing and related contexts. It describes a boxer who uses a particular strategy of fighting at a distance. Understanding this term requires some familiarity with boxing terminology and strategy. Outside of boxing, it can be used metaphorically to describe someone who wins through strategy in other areas of life, like business or politics."},"example_sentences":[{"sentence":"The **outfighter** danced around the ring, avoiding his opponent's powerful hooks.","translation":"アウトファイターはリングを踊るように動き回り、相手の強力なフックをかわした。","type":"noun","meaning_category":"ボクシング"},{"sentence":"As an **outfighter**, she relied on her speed and agility to win the match.","translation":"アウトファイターとして、彼女は試合に勝つためにスピードと敏捷性に頼った。","type":"noun","meaning_category":"ボクシング"},{"sentence":"He's a strategic **outfighter** in negotiations, always thinking several steps ahead.","translation":"彼は交渉において戦略的なアウトファイターであり、常に数手先を読んでいます。","type":"noun","meaning_category":"戦略家"}]}