{"word":"glyphography","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的な印刷技術) グリフォグラフィー：金属版に彫刻された図像や文字を印刷する技術。また、その技術によって印刷されたもの。","english_definition":"A process of producing an engraved plate from a drawing made with a transfer ink on a prepared surface of chalk or other suitable material. The drawing is then transferred to a metal plate, which is etched and used for printing. Also, a print made by this process.","examples":[{"sentence":"Glyphography was used to reproduce detailed illustrations in books and magazines during the 19th century.","translation":"グリフォグラフィーは、19世紀に書籍や雑誌で詳細なイラストを複製するために使用されました。"},{"sentence":"The artist experimented with glyphography to create unique textures in their prints.","translation":"そのアーティストは、グリフォグラフィーを実験して、版画に独特のテクスチャを作り出しました。"}],"collocations":["use glyphography","experiment with glyphography","create glyphography prints"],"synonyms":["engraving","etching","relief printing"],"antonyms":[]}],"etymology":{"value":"The word \"glyphography\" combines \"glyph\" (from Greek \"glyphe\", meaning carving) and \"-graphy\" (denoting a process of writing or drawing).","priority":"★★☆"},"pronunciation":{"ipa":"/ɡlɪˈfɒɡrəfi/","syllables":"gly-pho-gra-phy"},"inflection":{"noun_plural":"glyphographies"},"usage_notes":{"explanation":"Glyphography is a historical printing technique that involves creating a relief image on a metal plate for printing. It's distinct from other forms of engraving because it often uses a transfer process from a drawing on chalk or a similar material. The term is relatively rare in modern usage as the technique has been largely replaced by more efficient printing methods.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used glyphography for digital printing.","correct":"✓ He used digital printing techniques.","note":"Glyphography is a historical, non-digital printing technique. Digital printing is a modern method. Using glyphography for digital printing is incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":["glyph (名詞: 象形文字、グリフ)","graphic (形容詞: 図解的な、生々しい; 名詞: 図、グラフ)","-graphy (接尾辞: ～術、～法)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very specialized term)","frequency_google_ngram":"Low frequency (historical term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Glyphography is a specialized term referring to a specific historical printing technique. Understanding requires knowledge of printing history and terminology. The word itself is not commonly encountered in general usage, making it suitable for advanced learners or those with a specific interest in printing methods."},"example_sentences":[{"sentence":"The museum displayed examples of early glyphography prints.","translation":"博物館では、初期のグリフォグラフィー版画の例が展示されていました。","type":"noun","meaning_category":"印刷技術"},{"sentence":"Researchers are studying the use of glyphography in 19th-century book illustrations.","translation":"研究者たちは、19世紀の書籍のイラストにおけるグリフォグラフィーの使用を研究しています。","type":"noun","meaning_category":"印刷技術"}]}