{"word":"Toxicophobia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"毒物恐怖症：毒物や毒殺されることに対する病的な恐怖","english_definition":"An irrational and excessive fear of poisons or of being poisoned.","examples":[{"sentence":"His toxicophobia made him refuse to eat anything prepared by others.","translation":"彼の毒物恐怖症のために、彼は他人によって用意されたものを食べることを拒否した。"},{"sentence":"Toxicophobia can significantly impact a person's daily life and social interactions.","translation":"毒物恐怖症は、人の日常生活や社会的な交流に大きな影響を与える可能性がある。"}],"collocations":["develop toxicophobia","suffer from toxicophobia","overcome toxicophobia","toxicophobia symptoms","toxicophobia treatment"],"synonyms":["fear of poisoning","poison phobia"],"antonyms":["none (as it is a phobia)"]}],"etymology":{"value":"The word \"toxicophobia\" is derived from the Greek words \"toxico-\" (referring to poison) and \"-phobia\" (referring to fear).","priority":"★★★"},"pronunciation":{"ipa":"/ˌtɒksɪkəˈfoʊbiə/","syllables":"tox-i-co-pho-bi-a"},"inflection":{"noun_plural":"toxicophobias"},"usage_notes":{"explanation":"Toxicophobia is a specific phobia characterized by an intense and irrational fear of poisons or being poisoned. It can manifest in various ways, such as avoiding certain foods or drinks, refusing medication, or being excessively concerned about contamination. The severity of toxicophobia can vary from mild anxiety to debilitating fear that significantly interferes with daily life. Treatment options include therapy, such as cognitive behavioral therapy (CBT), and medication.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has toxicophobia of spiders.","correct":"✓ He has arachnophobia. / ✓ He has a fear of spiders.","note":"Toxicophobia is specifically a fear of poisons, not spiders. The fear of spiders is arachnophobia."},{"incorrect":"✗ Toxicophobia is a type of toxicity.","correct":"✓ Toxicophobia is a type of phobia.","note":"Toxicophobia is a phobia, which is a type of anxiety disorder, not a type of toxicity."}],"priority":"★★★"},"related_words":{"derivatives":["toxicophobic (adjective: relating to or suffering from toxicophobia)"],"phobias":["arachnophobia (fear of spiders)","claustrophobia (fear of enclosed spaces)","acrophobia (fear of heights)","mysophobia (fear of germs)"],"priority":"★★☆"},"level_frequency":{"level":"Rare","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Toxicophobia is a complex term referring to a specific phobia—an intense, irrational fear of poisons or being poisoned. This fear can lead to significant anxiety and avoidance behaviors. Understanding the term requires familiarity with psychological terminology and the concept of phobias. The word itself is derived from Greek roots, which can aid in comprehension for those familiar with classical languages."},"example_sentences":[{"sentence":"The therapist helped him manage his toxicophobia through cognitive behavioral therapy.","translation":"セラピストは、認知行動療法を通じて彼の毒物恐怖症の管理を支援した。","type":"general"},{"sentence":"Her toxicophobia led her to meticulously inspect every meal for potential contaminants.","translation":"彼女の毒物恐怖症は、潜在的な汚染物質がないか、すべての食事を綿密に検査するように彼女を導いた。","type":"symptom"}]}