{"word":"hydromorphous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"水成の、水成岩の、水の影響を受けた","english_definition":"(geology, soil science) Formed or altered by the action of water.","examples":[{"sentence":"Hydromorphous soils are often found in wetlands.","translation":"水成土壌は湿地帯でよく見られる。"},{"sentence":"The hydromorphous nature of the rock indicated prolonged exposure to water.","translation":"その岩石の水成的な性質は、長期間水にさらされていたことを示していた。"}],"collocations":["hydromorphous soil","hydromorphous rock","hydromorphous feature"],"synonyms":["water-formed","aqueous","water-related"],"antonyms":["xeromorphic (乾燥地形の)"]}],"etymology":{"value":"Derived from the Greek words 'hydro' (water) and 'morphe' (form).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪdrəˈmɔːrfəs/","syllables":"hy-dro-mor-phous"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"The term 'hydromorphous' is primarily used in geology and soil science to describe features, rocks, or soils that have been formed or significantly altered by the presence and action of water. It often implies a specific type of formation or alteration due to waterlogging, flooding, or other water-related processes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant is hydromorphous because it likes water.","correct":"✓ The plant is hydrophytic because it likes water.","note":"'Hydromorphous' describes geological or soil features formed by water, not plants that like water (which are 'hydrophytic')."},{"incorrect":"✗ The building is hydromorphous.","correct":"✓ The building shows signs of water damage.","note":"'Hydromorphous' is not generally used to describe buildings affected by water damage; instead, describe the damage directly."}],"priority":"★★☆"},"related_words":{"derivatives":["hydromorphism (名詞: 水成作用)"],"related_terms":["hydrophyte (水生植物)","hydrogeology (水文地質学)","hydrology (水文学)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hydromorphous' is a technical term used primarily in geology and soil science. It describes something that has been formed or changed by the action of water. The word is not commonly used in everyday language. It is important to understand the specific context of geology or soil science to correctly interpret its meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The **hydromorphous** features of the landscape suggested a history of flooding.","translation":"その地形の水成的な特徴は、洪水があった歴史を示唆していた。","type":"general","meaning_category":"geology"},{"sentence":"**Hydromorphous** soils often exhibit distinct color patterns due to iron reduction.","translation":"水成土壌は、鉄の還元によって独特の色彩パターンを示すことが多い。","type":"general","meaning_category":"soil science"}]}