{"word":"alligatoring","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(塗装、コーティングなどの)ひび割れ模様、ワニ革状のひび割れ","english_definition":"A defect in paint, varnish, or other coating, characterized by a pattern of cracks resembling the hide of an alligator.","examples":[{"sentence":"The old varnish on the table showed severe alligatoring.","translation":"テーブルの古いニスにはひどいアリゲーター模様のひび割れが見られた。"},{"sentence":"Alligatoring can be caused by applying a hard coating over a softer one.","translation":"アリゲーター模様のひび割れは、柔らかいコーティングの上に硬いコーティングを施すことで発生することがある。"}],"collocations":["paint alligatoring","coating alligatoring","severe alligatoring","surface alligatoring"],"synonyms":["cracking","crazing","checking","surface cracking"],"antonyms":[]},{"part_of_speech":"verb","definition":"(塗装、コーティングなどが)アリゲーター模様のひび割れを起こす","english_definition":"To develop a pattern of cracks resembling alligator skin on a painted or coated surface.","examples":[{"sentence":"The paint started alligatoring after being exposed to the sun for too long.","translation":"塗料は日光に長時間さらされた後、アリゲーター模様のひび割れを起こし始めた。"},{"sentence":"If the top coat alligators, it indicates a problem with the underlying layers.","translation":"上塗り塗料がアリゲーター模様のひび割れを起こす場合、下地層に問題があることを示している。"}],"collocations":["paint alligatoring","varnish alligatoring","coating alligatoring"],"synonyms":["crack","craze","check"],"antonyms":[]}],"etymology":{"value":"Derived from the resemblance of the cracking pattern to the skin of an alligator.","priority":"★★★"},"pronunciation":{"ipa":"/ˈælɪɡeɪtərɪŋ/","syllables":"al-li-ga-tor-ing"},"inflection":{"noun_plural":"alligatorings","verb_forms":{"present_simple":["alligator","alligators"],"past_simple":"alligatored","past_participle":"alligatored","present_participle":"alligatoring"}},"usage_notes":{"explanation":"'Alligatoring' specifically refers to a particular type of cracking pattern in coatings that resembles alligator skin. It is a technical term used in painting, coating, and conservation contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The wood is alligatoring.","correct":"✓ The paint is alligatoring.","note":"Alligatoring refers to the cracking of a coating (paint, varnish, etc.), not the underlying material (wood, metal, etc.)."},{"incorrect":"✗ The alligatoring was caused by water damage.","correct":"✓ The alligatoring was caused by incompatible coatings.","note":"While water damage can cause other types of paint failure, alligatoring is typically caused by the incompatibility of coating layers or improper application techniques."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["checking","crazing","cracking","paint failure","coating failure"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Alligatoring' is a technical term referring to a specific type of surface defect in paints, varnishes, and other coatings. It describes a pattern of cracks that resemble the scales or hide of an alligator. This term is primarily used in contexts related to painting, coating application, conservation, and material science. Understanding this term requires a certain level of technical knowledge in these fields."},"example_sentences":[{"sentence":"The conservator noted significant alligatoring on the surface of the antique painting.","translation":"修復家は、そのアンティーク絵画の表面に顕著なアリゲーター模様のひび割れがあることに気づいた。","type":"noun","meaning_category":"ひび割れ模様"},{"sentence":"Improper mixing of the epoxy caused it to alligator shortly after application.","translation":"エポキシの不適切な混合が、塗布直後にアリゲーター模様のひび割れを引き起こした。","type":"verb","meaning_category":"ひび割れを起こす"}]}