{"word":"falsificate","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(文書・記録などを)偽造する、改ざんする","english_definition":"to alter (information or evidence) so as to mislead; to forge or counterfeit.","examples":[{"sentence":"He was accused of falsificating the company's financial records.","translation":"彼は会社の財務記録を偽造したとして告発された。"},{"sentence":"The scientist was found to have falsificated data in his research.","translation":"その科学者は研究データを改ざんしたことが判明した。"}],"collocations":["falsificate data (データを改ざんする)","falsificate records (記録を偽造する)","falsificate documents (文書を偽造する)","falsificate evidence (証拠を捏造する)"],"synonyms":["forge","counterfeit","fake","tamper with","doctor","manipulate","alter","misrepresent"],"antonyms":["authenticate","verify","validate","certify","substantiate"]}],"etymology":{"value":"Late Latin *falsificare*, from Latin *falsus* (\"false\") + *facere* (\"to make\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɔːlsɪfɪkeɪt/","syllables":"fal-si-fi-cate"},"inflection":{"verb_forms":{"present_simple":["falsificate","falsificates"],"past_simple":"falsificated","past_participle":"falsificated","present_participle":"falsificating"}},"usage_notes":{"explanation":"'Falsificate' is a formal and somewhat uncommon verb that means to deliberately alter or misrepresent something, especially documents or data, in order to deceive. It implies a deliberate act of making something false. It is often used in legal, scientific, or academic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He falsificated his feelings.","correct":"✓ He misrepresented his feelings.","note":"'Falsificate' is usually used for tangible things like documents or data, not for intangible things like feelings. 'Misrepresent' is a better choice for describing feelings or opinions."},{"incorrect":"✗ The document was falsificated. (without specifying who did it)","correct":"✓ Someone falsificated the document. / ✓ The document was falsified.","note":"When using 'falsificate', it's often important to specify who did the falsification. If the agent is unknown or unimportant, 'falsify' is a better choice."}],"priority":"★★☆"},"related_words":{"derivatives":["falsification (noun): the act of falsifying; something that is falsified","falsifier (noun): a person who falsifies something","false (adjective): not true or genuine"],"related_terms":["falsify (verb): to prove something to be false; to make false by adding to or changing","falsehood (noun): a lie; a false statement","fallacy (noun): a mistaken belief, especially one based on unsound argument"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Falsificate' is a relatively uncommon and formal word that means to deliberately change or misrepresent something, particularly information or documents, in order to deceive. It implies a conscious effort to make something false. This word is most often encountered in legal, academic, or scientific contexts when discussing fraud, data manipulation, or the creation of counterfeit items. It's important to distinguish it from 'falsify,' which can also mean to prove something to be false."},"example_sentences":[{"sentence":"The accountant was arrested for allegedly falsificating the company's tax returns.","translation":"その会計士は、会社の税務申告書を偽造した疑いで逮捕された。","type":"verb","meaning_category":"偽造する"},{"sentence":"The historian accused the biographer of falsificating historical facts to create a more dramatic narrative.","translation":"その歴史家は、伝記作家がより劇的な物語を作り出すために歴史的事実を改ざんしたと非難した。","type":"verb","meaning_category":"改ざんする"},{"sentence":"It is a serious crime to falsificate a passport.","translation":"パスポートを偽造することは重大な犯罪である。","type":"verb","meaning_category":"偽造する"}]}