{"word":"peritonsillitis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"扁桃周囲膿瘍（へんとうしゅういのうよう）","english_definition":"An infection of the tonsils that spreads to the surrounding tissue, often resulting in an abscess.","examples":[{"sentence":"He was diagnosed with peritonsillitis and needed antibiotics.","translation":"彼は扁桃周囲膿瘍と診断され、抗生物質が必要だった。"},{"sentence":"Peritonsillitis can cause severe throat pain and difficulty swallowing.","translation":"扁桃周囲膿瘍は、激しい喉の痛みと嚥下困難を引き起こす可能性がある。"}],"collocations":["develop peritonsillitis","treat peritonsillitis","severe peritonsillitis","recurrent peritonsillitis"],"synonyms":["quinsy (archaic)"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'peri' (around), 'tonsilla' (tonsil), and '-itis' (inflammation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɛrɪˌtɒnsɪˈlaɪtɪs/","syllables":"per-i-ton-sil-li-tis"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Peritonsillitis is a complication of tonsillitis where the infection spreads beyond the tonsil itself. It often presents with severe sore throat, fever, difficulty swallowing, and a muffled voice. In severe cases, it can lead to airway obstruction. Treatment typically involves antibiotics and drainage of any abscess that has formed.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ peritonsilitis","correct":"✓ peritonsillitis","note":"The correct spelling includes the double 'l' in 'tonsillitis'."},{"incorrect":"✗ I have peritonsillitis on my knee.","correct":"✓ I have peritonsillitis.","note":"Peritonsillitis specifically refers to an infection around the tonsils."}],"priority":"★★☆"},"related_words":{"derivatives":["tonsil","tonsillitis","abscess"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Peritonsillitis' is a medical term referring to a specific type of infection. It's not a common word used in everyday conversation, but it's important in medical contexts. Understanding the term requires some knowledge of medical terminology, particularly related to the throat and infections. The word itself is quite long and complex, so it might be challenging for non-native speakers or those without a medical background."},"example_sentences":[{"sentence":"The doctor suspected peritonsillitis due to the patient's swollen tonsils and difficulty opening their mouth.","translation":"医師は、患者の腫れた扁桃と口を開けにくいことから、扁桃周囲膿瘍を疑った。","type":"medical","meaning_category":"infection"},{"sentence":"Surgical drainage is sometimes necessary to treat peritonsillitis effectively.","translation":"扁桃周囲膿瘍を効果的に治療するためには、外科的排膿が必要となる場合がある。","type":"medical","meaning_category":"treatment"}]}