{"word":"roarers","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(複数形) (古語) 騒がしい人たち、乱暴者たち; (獣などが) うなる人たち","english_definition":"(plural) (archaic) noisy or boisterous people; those who roar (like animals).","examples":[{"sentence":"The streets were filled with roarers on that night.","translation":"その夜、通りは騒がしい人々でいっぱいだった。"},{"sentence":"The roarers in the crowd made it difficult to hear the speaker.","translation":"群衆の中の騒ぎ立てる人々のせいで、講演者の声を聞き取るのが難しかった。"}],"collocations":[],"synonyms":["rowdies","troublemakers","brawlers","yellers","shouters"],"antonyms":["peaceful people","quiet people"]},{"part_of_speech":"noun","definition":"(複数形) (獣医学) 喘鳴症の馬","english_definition":"(veterinary medicine) horses affected by laryngeal hemiplegia, a condition causing a roaring sound during exercise.","examples":[{"sentence":"The vet examined the horses for signs of roarers.","translation":"獣医は馬に喘鳴症の兆候がないか検査した。"},{"sentence":"Roarers are often unable to perform well in races.","translation":"喘鳴症の馬は、レースで良い成績を収めることができないことが多い。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Roarer' is derived from the verb 'roar,' meaning to make a loud, deep cry or sound. The suffix '-er' indicates someone or something that performs the action. In the context of horses, it refers to the characteristic roaring sound they make due to a specific medical condition.","priority":"N/A"},"pronunciation":{"ipa":"/ˈrɔːrərz/","syllables":"roar-ers"},"inflection":{"noun_plural":"roarers"},"usage_notes":{"explanation":"The word 'roarers' has two primary meanings: one archaic and general, referring to noisy or boisterous people, and the other specific to veterinary medicine, referring to horses with laryngeal hemiplegia. The context usually makes it clear which meaning is intended. The veterinary term is more technical and less common in everyday conversation.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["roar (verb, noun)","roaring (adjective)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, especially the archaic meaning. The veterinary term is specialized.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Roarers' is a relatively uncommon word. Its meaning depends heavily on context. In general use, it refers to noisy people, but this usage is archaic. In veterinary contexts, it refers to horses with a specific medical condition that causes a roaring sound during breathing. Understanding the context is crucial for interpreting the word correctly."},"example_sentences":[{"sentence":"The tavern was filled with **roarers**, singing and shouting at the top of their lungs.","translation":"居酒屋は、大声で歌ったり叫んだりする騒がしい人々でいっぱいだった。","type":"noun (archaic)","meaning_category":"騒がしい人々"},{"sentence":"The veterinarian diagnosed the horse as a **roarer** after hearing the unusual sound during exercise.","translation":"獣医は、運動中に聞こえる異常な音を聞いて、その馬を喘鳴症と診断した。","type":"noun (veterinary)","meaning_category":"喘鳴症の馬"}]}