{"word":"redisciplined","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再び訓練された、再び規律を正された","english_definition":"Having been subjected to discipline or training again.","examples":[{"sentence":"After the relapse, the athlete was redisciplined by the coach to regain peak performance.","translation":"再発後、アスリートは最高のパフォーマンスを取り戻すためにコーチによって再び訓練された。"},{"sentence":"The team was redisciplined after a series of losses due to lack of focus.","translation":"チームは集中力不足による一連の敗北の後、再び規律を正された。"}],"collocations":["redisciplined athlete","redisciplined team","redisciplined approach"],"synonyms":["retrained","reformed","corrected","re-educated"],"antonyms":["undisciplined","unruly","uncontrolled"]}],"etymology":{"value":"'Re-' (again) + 'disciplined' (subjected to discipline). Indicates a process of being disciplined again after a lapse or failure.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈdɪsɪplɪnd/","syllables":"re-dis-ci-plined"},"inflection":{"verb_forms":{"present_simple":["rediscipline","redisciplines"],"past_simple":"redisciplined","past_participle":"redisciplined","present_participle":"redisciplining"}},"usage_notes":{"explanation":"'Redisciplined' implies a corrective action taken to restore or reinforce discipline that had been previously established but subsequently weakened or lost. It suggests a need for renewed focus and adherence to rules or standards.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The redisciplined child was happy to be punished again.","correct":"✓ The redisciplined child showed improved behavior after being corrected.","note":"'Redisciplined' implies correction and training, not necessarily punishment. The focus is on improved behavior and adherence to rules."}],"priority":"★☆☆"},"related_words":{"derivatives":["rediscipline (verb, noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Redisciplined' is a relatively uncommon word that means to discipline or train again. It is used in contexts where someone or something has previously been disciplined but needs to be disciplined again, often after a lapse in behavior or performance. The word implies a corrective action to reinforce or restore discipline."},"example_sentences":[{"sentence":"The project team was redisciplined to adhere to the new guidelines.","translation":"プロジェクトチームは、新しいガイドラインを遵守するために再び規律を正された。","type":"verb","meaning_category":"規律を正された"},{"sentence":"The athlete, redisciplined after a setback, showed remarkable improvement.","translation":"挫折後に再び訓練されたアスリートは、目覚ましい改善を示した。","type":"adjective","meaning_category":"再び訓練された"}]}