{"word":"umbriferously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"大げさに、仰々しく、尊大に","english_definition":"In an umbriferous manner; pompously, grandiosely, or pretentiously.","examples":[{"sentence":"He spoke umbriferously about his accomplishments, exaggerating his role in the project.","translation":"彼は自分の業績について大げさに語り、プロジェクトにおける自分の役割を誇張した。"},{"sentence":"The politician umbriferously declared his commitment to the people, despite his questionable actions.","translation":"その政治家は、疑わしい行動にもかかわらず、国民への献身を尊大に宣言した。"}],"collocations":["speak umbriferously","declare umbriferously","act umbriferously"],"synonyms":["pompously","grandiosely","pretentiously","bombastically","ostentatiously"],"antonyms":["modestly","humbly","unassumingly"]}],"etymology":{"value":"Derived from 'umbriferous', which means 'shady' or 'casting a shadow'. The 'umbr-' part comes from Latin 'umbra' meaning 'shadow'. The suffix '-ously' turns it into an adverb. The connection to the meaning of pompousness is metaphorical, suggesting an overshadowing or overbearing manner.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌm.brɪˈfɛr.əs.li/","syllables":"um-bri-fer-ous-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Umbriferously' describes a manner of speaking or behaving that is excessively grand, pompous, or pretentious. It suggests that the person is trying to appear more important or impressive than they actually are. The word is relatively rare and often used in formal or literary contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He umbriferously walked into the room.","correct":"✓ He walked umbriferously into the room.","note":"The adverb 'umbriferously' should modify a verb of speaking or declaring, not a verb of motion like 'walked', unless the manner of walking itself is intended to be pompous."}],"priority":"★☆☆"},"related_words":{"derivatives":["umbriferous (adjective)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Umbriferously' is a rare and sophisticated word used to describe someone behaving or speaking in a pompous, grandiose, or pretentious manner. It implies an attempt to overshadow others with one's importance or accomplishments. Due to its rarity, it is more likely to be encountered in formal writing or literature. Understanding the root 'umbra' (shadow) can help grasp the metaphorical sense of overshadowing. "},"example_sentences":[{"sentence":"The CEO umbriferously announced the company's record profits, taking all the credit for himself.","translation":"CEOは会社の記録的な利益を尊大に発表し、すべての功績を自分自身の手柄にした。","type":"adverb","meaning_category":"pompously"},{"sentence":"She umbriferously dismissed her colleague's suggestions, asserting her own expertise.","translation":"彼女は同僚の提案を尊大に退け、自身の専門知識を主張した。","type":"adverb","meaning_category":"pretentiously"}]}