{"word":"Congressman-at-large","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(米国)全州区選出下院議員","english_definition":"A member of the United States House of Representatives who represents an entire state rather than a specific congressional district, typically elected in states with a small number of representatives.","examples":[{"sentence":"Since the state only had one representative, he served as a congressman-at-large.","translation":"その州は代表が一人しかいなかったので、彼は全州区選出下院議員として務めた。"}],"collocations":["elected as congressman-at-large","former congressman-at-large"],"synonyms":["representative-at-large"],"antonyms":[]}],"etymology":{"value":"The term arises from the concept of representing the entire state ('at large') rather than a specific district.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈkɒŋɡrəsmən æt ˈlɑːrdʒ/","syllables":"Con-gress-man-at-large"},"inflection":{"noun_plural":"congressmen-at-large"},"usage_notes":{"explanation":"This term is specific to the United States political system. It applies when a state has a small number of representatives (sometimes only one) in the House of Representatives, and that representative is elected by the entire state's population rather than being limited to a specific district.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a congressman for the entire state.","correct":"✓ He is a congressman-at-large.","note":"While the first sentence is understandable, 'congressman-at-large' is the specific term for this role."}],"priority":"☆☆☆"},"related_words":{"derivatives":["congresswoman-at-large"],"phrases":["at large (generally, as a whole)"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'congressman-at-large' refers to a specific type of representative in the U.S. House of Representatives. This is applicable when a state has a small number of representatives, and those representatives are elected by the entire state rather than specific districts. Understanding this term requires knowledge of the U.S. political system."},"example_sentences":[{"sentence":"The congressman-at-large focused on issues affecting the entire state.","translation":"その全州区選出下院議員は、州全体に影響を与える問題に焦点を当てた。"},{"sentence":"As a congressman-at-large, she had to consider the needs of all citizens, not just a particular district.","translation":"全州区選出下院議員として、彼女は特定の地区だけでなく、すべての市民のニーズを考慮しなければならなかった。"},{"sentence":"The state's single representative served as a congressman-at-large.","translation":"その州の唯一の代表は、全州区選出下院議員として務めた。"}]}