{"word":"lightener","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(髪の毛などの)脱色剤、漂白剤","english_definition":"a substance used to make something lighter in color, especially hair.","examples":[{"sentence":"She used a hair lightener to get a blonde look.","translation":"彼女はブロンドの髪にするためにヘアライトナーを使った。"},{"sentence":"The salon offers a variety of lighteners for different hair types.","translation":"その美容院では、さまざまな髪質に合わせたライトナーを提供している。"}],"collocations":["hair lightener","bleach lightener"],"synonyms":["bleach","hair bleach","hair dye"],"antonyms":["hair dye","darkener"]},{"part_of_speech":"noun","definition":"(絵画などの)明度を上げるもの、明るくするもの","english_definition":"something that makes a color or shade lighter.","examples":[{"sentence":"Adding white is a common lightener for paint.","translation":"白を加えることは、絵の具の明度を上げる一般的な方法です。"},{"sentence":"The artist used a lightener to create highlights in the painting.","translation":"その画家は、絵にハイライトを作るためにライトナーを使った。"}],"collocations":["paint lightener"],"synonyms":["tint","shade"],"antonyms":["darkener"]}],"etymology":{"value":"The word \"lightener\" is derived from the verb \"lighten,\" which means to make lighter or brighter. The suffix \"-er\" is added to indicate something that performs the action of lightening.","priority":"★★☆"},"pronunciation":{"ipa":"ˈlaɪtnər","syllables":"ligh-ten-er"},"inflection":{"noun_plural":"lighteners"},"usage_notes":{"explanation":"The term \"lightener\" is most commonly used in the context of hair care and refers to products designed to lighten the color of hair. It can also be used more broadly to describe anything that makes something lighter in color or shade, such as in painting or photography.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a lightener to dark my hair.","correct":"✓ I used a darkener to dark my hair.","note":"Lighteners are used to make hair lighter, not darker. Use a \"darkener\" or hair dye to darken hair."}],"priority":"★★☆"},"related_words":{"derivatives":["lighten (verb)","light (adjective)","lighter (noun - a device for lighting)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"lightener\" refers to something that makes another thing lighter. It's commonly used to talk about products that make hair lighter, like hair lighteners. It can also be used in art to describe something that makes paint colors lighter. You will likely encounter this word in beauty product descriptions or art tutorials."},"example_sentences":[{"sentence":"She bought a new hair lightener to try a different shade of blonde.","translation":"彼女は違うブロンドの色合いを試すために新しいヘアライトナーを買った。","type":"noun","meaning_category":"脱色剤"},{"sentence":"The artist mixed a lightener with the blue paint to create a lighter sky.","translation":"画家は青い絵の具にライトナーを混ぜて、より明るい空を描いた。","type":"noun","meaning_category":"明度を上げるもの"}]}