{"word":"Hyperlipaemia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"高脂血症","english_definition":"The presence of abnormally high levels of lipids in the blood.","examples":[{"sentence":"Hyperlipaemia can increase the risk of cardiovascular disease.","translation":"高脂血症は心血管疾患のリスクを高める可能性があります。"}],"collocations":["treat hyperlipaemia (高脂血症を治療する)","manage hyperlipaemia (高脂血症を管理する)","diet for hyperlipaemia (高脂血症のための食事療法)"],"synonyms":["hyperlipidemia","dyslipidemia"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'hyper' (above, excessive), 'lipos' (fat), and 'haima' (blood).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpərˌlɪˈpiːmiə/","syllables":"hy-per-li-pae-mi-a"},"inflection":{"noun_plural":"hyperlipaemias"},"usage_notes":{"explanation":"Hyperlipaemia, also spelled hyperlipidemia, refers to elevated levels of any or all lipids (fats) and lipoproteins in the blood. It is a common condition that can be caused by genetic factors, lifestyle choices (such as a diet high in saturated fat), or other underlying medical conditions. It is often asymptomatic but can increase the risk of atherosclerosis and cardiovascular disease.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a hyperlipemia.","correct":"✓ I have hyperlipaemia.","note":"'Hyperlipaemia' is a condition, so it's generally used without an article or with 'the' if referring to a specific case."},{"incorrect":"✗ Hyperlipemia is treated with statins and diet.","correct":"✓ Hyperlipaemia is treated with statins and diet.","note":"Both spellings 'hyperlipaemia' and 'hyperlipidemia' are acceptable, but consistency is important. Choose one and stick with it."}],"priority":"★★☆"},"related_words":{"derivatives":["hyperlipaemic (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hyperlipaemia' is a technical term used in medicine to describe a condition characterized by abnormally high levels of lipids in the blood. It's important to understand that this condition can increase the risk of cardiovascular diseases. The term is primarily used in medical contexts and may not be commonly encountered in everyday conversations.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor diagnosed her with hyperlipaemia after the blood test results came back.","translation":"血液検査の結果が出て、医師は彼女を高脂血症と診断した。","type":"general","meaning_category":"diagnosis"},{"sentence":"A low-fat diet is often recommended for patients with hyperlipaemia.","translation":"低脂肪食は、高脂血症の患者によく推奨される。","type":"treatment","meaning_category":"diet"},{"sentence":"Regular exercise can help manage hyperlipaemia and improve overall cardiovascular health.","translation":"定期的な運動は、高脂血症の管理に役立ち、全体的な心血管の健康を改善することができる。","type":"lifestyle","meaning_category":"exercise"}]}