{"word":"ethnie","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(社会学)民族的カテゴリー、民族集団","english_definition":"(Sociology) A named human population with myths of common ancestry, shared historical memories, one or more elements of common culture, a link with a homeland and a sense of solidarity among at least some of its members.","examples":[{"sentence":"The concept of 'ethnie' helps to understand the formation of national identity.","translation":"「エスニー」の概念は、国民アイデンティティの形成を理解するのに役立つ。"},{"sentence":"Smith defines an ethnie as a named human population with shared ancestry myths and historical memories.","translation":"スミスはエスニーを、共通の祖先神話と歴史的記憶を持つ、名前の付いた人間の集団として定義している。"}],"collocations":["ethnic group","national identity","cultural heritage","collective memory"],"synonyms":["ethnic group","people","nation","community"],"antonyms":[],"notes":"The term 'ethnie' is often used in sociology and political science to describe a group of people who share a common cultural heritage, ancestry, and often language or religion. It is a more specific term than 'ethnic group' and emphasizes the historical and cultural aspects of group identity."}],"etymology":{"value":"From French ethnie, from Ancient Greek ἔθνος (éthnos, “nation, people”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛθni/","syllables":"eth-nie"},"inflection":{"noun_plural":"ethnies"},"usage_notes":{"explanation":"The term 'ethnie' is used to describe a group of people who share a common cultural heritage, ancestry, and often language or religion. It is often used in the context of studying nationalism and ethnic conflict. It is a more specific term than 'ethnic group' and emphasizes the historical and cultural aspects of group identity. The term is often associated with the work of sociologist Anthony D. Smith.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ethnie of the United States is American.","correct":"✓ The ethnie of many Americans is diverse, reflecting their ancestral origins.","note":"The United States is a multi-ethnic society, so it does not have a single ethnie. Instead, individuals within the US may identify with various ethnies based on their heritage."}],"priority":"★☆☆"},"related_words":{"derivatives":["ethnic","ethnicity","ethnocentrism","ethnolinguistic"],"related_terms":["nation","state","culture","identity"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'ethnie' is a specialized term used in sociology and political science to describe a group of people who share a common cultural heritage, ancestry, and often language or religion. It's more specific than 'ethnic group' and emphasizes historical and cultural aspects of group identity. Understanding this term requires familiarity with sociological concepts related to ethnicity, nationalism, and identity formation. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The study examined how different ethnies in the region maintained their cultural traditions.","translation":"その研究は、その地域の異なるエスニーがどのように文化的伝統を維持しているかを調査した。","type":"noun","meaning_category":"民族的カテゴリー"},{"sentence":"The concept of ethnie is crucial for understanding the roots of nationalism.","translation":"エスニーの概念は、ナショナリズムのルーツを理解するために重要である。","type":"noun","meaning_category":"民族集団"}]}