{"word":"isochronism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"等時性：振動や周期的な現象が、振幅やエネルギーに関わらず一定の時間をかけて繰り返される性質。","english_definition":"The property of having equal time intervals; the characteristic of occurring at equal time intervals. Specifically, the property of a pendulum or oscillator to have a period that is independent of its amplitude.","examples":[{"sentence":"The isochronism of the pendulum clock allowed for accurate timekeeping.","translation":"振り子時計の等時性により、正確な計時が可能になった。"},{"sentence":"The heart's isochronism is essential for maintaining a stable rhythm.","translation":"心臓の等時性は、安定したリズムを維持するために不可欠である。"}],"collocations":["pendulum isochronism","oscillator isochronism","heart isochronism"],"synonyms":["periodicity","regularity","rhythmicity"],"antonyms":["arrhythmia","irregularity"]}],"etymology":{"value":"Derived from the Greek words 'isos' (equal) and 'chronos' (time).","priority":"★★☆"},"pronunciation":{"ipa":"/aɪˈsɒkrənɪzəm/","syllables":"i-soch-ro-nism"},"inflection":{"noun_plural":"isochronisms"},"usage_notes":{"explanation":"Isochronism is a technical term primarily used in physics, mechanics, and physiology. It describes the consistent timing of events, particularly oscillations. It is most commonly associated with pendulums, oscillators, and biological rhythms like the heartbeat.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The isochronism of the sound wave was disrupted by the echo.","correct":"The periodicity of the sound wave was disrupted by the echo.","note":"Isochronism is typically used for oscillating systems or rhythmic processes, not for general wave phenomena."}],"priority":"★☆☆"},"related_words":{"derivatives":["isochronous (adjective)","isochronously (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Isochronism' is a scientific term, mainly used in physics and biology, referring to the consistent timing of a process. Think of a pendulum swinging back and forth in the same amount of time, no matter how wide it swings. This consistent timing is isochronism. It's not an everyday word, so you'll mostly encounter it in technical contexts."},"example_sentences":[{"sentence":"The discovery of the pendulum's isochronism revolutionized timekeeping.","translation":"振り子の等時性の発見は、計時法に革命をもたらした。","type":"noun","meaning_category":"physics"},{"sentence":"Cardiac isochronism ensures that the heart beats with a regular rhythm.","translation":"心臓の等時性は、心臓が規則的なリズムで鼓動することを保証する。","type":"noun","meaning_category":"physiology"}]}