{"word":"pleomorphous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"多形性の、多形の","english_definition":"occurring in more than one distinct form","examples":[{"sentence":"The bacteria are pleomorphous, exhibiting various shapes and sizes.","translation":"そのバクテリアは多形性であり、様々な形とサイズを示す。"},{"sentence":"Some fungi are pleomorphous, having different forms in their life cycle.","translation":"いくつかの菌類は多形性であり、ライフサイクルの中で異なる形態を持つ。"}],"collocations":["pleomorphous bacteria","pleomorphous fungi","pleomorphous cells"],"synonyms":["pleomorphic","multiform","polymorphic"],"antonyms":["monomorphic","uniform"]}],"etymology":{"value":"From Greek 'pleo-' (more) + 'morphē' (form) + '-ous' (having the quality of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpliːəˈmɔːrfəs/","syllables":"ple-o-mor-phous"},"inflection":{"notes":"Comparative and superlative forms (more pleomorphous, most pleomorphous) are possible, but not common."},"usage_notes":{"explanation":"'Pleomorphous' describes something that can take on different forms. It is often used in biology to describe organisms that can change their shape or appearance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The virus is pleomorphic, so it's easy to identify.","correct":"✓ The virus is pleomorphic, making it difficult to identify.","note":"Pleomorphism makes identification harder, not easier, due to the variety of forms."}],"priority":"★☆☆"},"related_words":{"derivatives":["pleomorphism (noun): the ability to assume different forms"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pleomorphous' is a technical term primarily used in scientific contexts, especially in biology and medicine, to describe organisms or cells that can exist in multiple forms. Its use is relatively rare in general conversation."},"example_sentences":[{"sentence":"The tumor cells were highly pleomorphous, indicating aggressive growth.","translation":"その腫瘍細胞は高度に多形性であり、積極的な成長を示していた。","type":"adjective","meaning_category":"多形性の"},{"sentence":"Understanding the pleomorphous nature of certain bacteria is crucial for effective treatment.","translation":"特定の細菌の多形性を理解することは、効果的な治療のために重要である。","type":"adjective","meaning_category":"多形性の"}]}