{"word":"heartleaf","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"フタリシズカ (双子静)","english_definition":"A plant of the genus Asarum, especially Asarum caulescens, native to Japan.","examples":[{"sentence":"Heartleaf is a popular groundcover in Japanese gardens.","translation":"フタリシズカは日本の庭で人気のグラウンドカバーです。"},{"sentence":"The heartleaf's leaves are known for their unique shape.","translation":"フタリシズカの葉はその独特な形で知られています。"}],"collocations":["heartleaf plant","asarum heartleaf","asarum caulescens"],"synonyms":["asarum","wild ginger"],"antonyms":[]},{"part_of_speech":"noun","definition":"ドクダミ (蕺草)","english_definition":"Houttuynia cordata, a flowering plant native to Southeast Asia.","examples":[{"sentence":"Heartleaf is used in traditional medicine.","translation":"ドクダミは伝統医学で使われています。"},{"sentence":"Some people use heartleaf in teas and salads.","translation":"ドクダミをお茶やサラダに使う人もいます。"}],"collocations":["heartleaf tea","houttuynia cordata","heartleaf extract"],"synonyms":["houttuynia cordata","fish mint","chameleon plant"],"antonyms":[]}],"etymology":{"value":"The name 'heartleaf' comes from the heart-shaped leaves of some plants in this category.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɑːrtliːf/","syllables":"heart-leaf"},"inflection":{"noun_plural":"heartleaves"},"usage_notes":{"explanation":"The term 'heartleaf' can refer to several different plants, most notably Asarum caulescens (フタリシズカ) and Houttuynia cordata (ドクダミ). Context is crucial to determine which plant is being referenced.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I planted heartleaf for its beautiful flowers.","correct":"✓ I planted heartleaf for its interesting foliage.","note":"While Houttuynia cordata (ドクダミ) does flower, it is often grown for its colorful leaves. Asarum caulescens (フタリシズカ) is primarily grown for its foliage."}],"priority":"★★☆"},"related_words":{"derivatives":["heartleaved (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Heartleaf' is a term used to describe plants with heart-shaped leaves. It is important to know that this term can refer to different plants, such as Asarum caulescens (フタリシズカ) and Houttuynia cordata (ドクダミ). Understanding the context is essential to identify the specific plant being discussed. The term is not commonly used in everyday conversation but may appear in gardening or botanical contexts."},"example_sentences":[{"sentence":"The heartleaf plant spread quickly in the moist soil.","translation":"そのフタリシズカ（またはドクダミ）は湿った土壌で急速に広がった。","type":"noun","meaning_category":"general"},{"sentence":"Houttuynia cordata, also known as heartleaf, is used in Asian cuisine.","translation":"ドクダミとしても知られるheartleafは、アジア料理に使われています。","type":"noun","meaning_category":"ドクダミ"},{"sentence":"The heartleaf's delicate flowers added a touch of elegance to the garden.","translation":"フタリシズカの繊細な花は庭に優雅さを添えました。","type":"noun","meaning_category":"フタリシズカ"}]}