{"word":"Diacetonuria","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ジアセトン尿（症）: 尿中にジアセトン（アセトン体の一種）が異常に多く排出される状態。","english_definition":"The presence of diacetone (a type of ketone body) in the urine in abnormally high concentrations.","examples":[{"sentence":"Diacetonuria can be a sign of uncontrolled diabetes.","translation":"ジアセトン尿は、コントロール不良の糖尿病の兆候である可能性があります。"},{"sentence":"The patient's urine sample showed diacetonuria.","translation":"患者の尿サンプルはジアセトン尿を示した。"}],"collocations":["cause of diacetonuria (ジアセトン尿の原因)","diagnosis of diacetonuria (ジアセトン尿の診断)","treatment of diacetonuria (ジアセトン尿の治療)"],"synonyms":["ketonuria","acetonuria"],"antonyms":[]}],"etymology":{"value":"'Diacetone' (ジアセトン) + '-uria' (尿症、尿中に特定物質が存在することを示す接尾辞)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdaɪˌæsɪtoʊˈnjʊəriə/","syllables":"di-a-ce-to-nu-ri-a"},"inflection":{"noun_plural":"Diacetonurias"},"usage_notes":{"explanation":"Diacetonuria is a medical condition characterized by elevated levels of diacetone in the urine. It is often associated with ketonuria, where ketone bodies in general are present in the urine. This condition can be indicative of metabolic imbalances, such as those seen in uncontrolled diabetes, starvation, or certain metabolic disorders. Diagnosis is typically made through urine testing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient had diacetonuria in his blood.","correct":"✓ The patient had diacetonuria in his urine.","note":"Diacetonuria specifically refers to the presence of diacetone in the urine, not the blood. The presence of ketones in the blood is called ketonemia."}],"priority":"★★☆"},"related_words":{"derivatives":["diacetone (ジアセトン)","ketone (ケトン)","ketonuria (ケトン尿症)","acetonuria (アセトン尿症)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Diacetonuria' is a complex medical term referring to the presence of diacetone, a type of ketone body, in the urine. It is typically encountered in the context of diagnosing and understanding metabolic disorders, particularly those related to diabetes and nutritional imbalances. Understanding this term requires a background in biochemistry and medical terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"Severe diacetonuria can lead to metabolic acidosis.","translation":"重度のジアセトン尿は代謝性アシドーシスを引き起こす可能性がある。","type":"medical","meaning_category":"医学"},{"sentence":"The doctor ordered a urine test to check for diacetonuria.","translation":"医師はジアセトン尿を確認するために尿検査を指示した。","type":"medical","meaning_category":"医学"}]}