{"word":"pyas","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(India) A type of sweet rice pudding.","english_definition":"A sweet rice pudding, popular in India, made with rice, milk, sugar, and often flavored with cardamom, nuts, or saffron.","examples":[{"sentence":"She prepared a delicious pyas for the festival.","translation":"彼女はお祭りのために美味しいピヤスを作った。"},{"sentence":"Pyas is a traditional dessert served during celebrations.","translation":"ピヤスはお祝いの際に提供される伝統的なデザートです。"}],"collocations":["make pyas","serve pyas","eat pyas","traditional pyas","delicious pyas"],"synonyms":["kheer","rice pudding"],"antonyms":[]}],"etymology":{"value":"The word 'pyas' is derived from the Sanskrit word 'payasa', which refers to milk or a milk-based dish.","priority":"★★☆"},"pronunciation":{"ipa":"/pjɑːs/","syllables":"pyas"},"inflection":{"noun_plural":"pyases"},"usage_notes":{"explanation":"Pyas is a popular dessert in India, often made during festivals and special occasions. It is similar to rice pudding but has a distinct flavor due to the use of cardamom, nuts, and sometimes saffron. It is also known as kheer in some regions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I want to order a pyas at the restaurant, but they don't have any.","correct":"✓ I wanted to order pyas at the restaurant, but they didn't have any.","note":"The word 'pyas' is already a noun, so it doesn't need an article 'a' before it."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_dishes":["rasmalai","gulab jamun","jalebi","barfi"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Pyas' refers to a specific type of Indian dessert, a sweet rice pudding. It's not a commonly used word outside of Indian cuisine contexts. Understanding the term requires familiarity with Indian food culture. When encountering this word, it's helpful to remember that it's a type of dessert, similar to rice pudding, but with distinct Indian flavors like cardamom and nuts."},"example_sentences":[{"sentence":"My grandmother's pyas recipe is a family treasure.","translation":"祖母のピヤスのレシピは家族の宝物です。","type":"noun","meaning_category":"sweet rice pudding"},{"sentence":"The aroma of cardamom filled the kitchen as the pyas simmered.","translation":"ピヤスが煮込まれるにつれて、カルダモンの香りが台所に広がった。","type":"noun","meaning_category":"sweet rice pudding"}]}