{"word":"paraphimosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"嵌頓包茎（かんとんほうけい）","english_definition":"A condition in which the foreskin of the penis becomes trapped behind the glans, and cannot be pulled forward to cover the glans.","examples":[{"sentence":"Paraphimosis requires prompt medical attention to prevent complications.","translation":"嵌頓包茎は合併症を防ぐために迅速な医療処置が必要です。"}],"collocations":["treat paraphimosis (嵌頓包茎を治療する)","develop paraphimosis (嵌頓包茎を発症する)","severe paraphimosis (重度の嵌頓包茎)"],"synonyms":["strangulated foreskin"],"antonyms":[]}],"etymology":{"value":"From para- (around) + phimosis (a condition in which the foreskin cannot be retracted).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpærəfaɪˈmoʊsɪs/","syllables":"par-a-phi-mo-sis"},"inflection":{"noun_plural":"paraphimoses"},"usage_notes":{"explanation":"Paraphimosis is a medical emergency that requires immediate treatment to prevent serious complications such as tissue damage and infection. It is distinct from phimosis, which is the inability to retract the foreskin.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has phimosis, which is the same as paraphimosis.","correct":"✓ He has paraphimosis, which is a different condition than phimosis.","note":"Phimosis and paraphimosis are distinct conditions. Phimosis is the inability to retract the foreskin, while paraphimosis is the inability to return the retracted foreskin to its original position."}],"priority":"★★☆"},"related_words":{"derivatives":["phimosis"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Paraphimosis' is a medical term referring to a specific condition where the foreskin is trapped behind the glans of the penis and cannot be returned to its normal position. It's important to understand that this is a medical emergency requiring immediate attention. The term is typically used in medical contexts and not in everyday conversation."},"example_sentences":[{"sentence":"The doctor diagnosed him with paraphimosis and recommended immediate treatment.","translation":"医師は彼を嵌頓包茎と診断し、直ちに治療を勧めた。","type":"noun","meaning_category":"medical condition"}]}