{"word":"Sub-mycenaean","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"亜ミケーネの、ミケーネ文化の衰退期後の","english_definition":"Relating to the period in Greek history following the collapse of the Mycenaean civilization, roughly from 1200 to 1000 BC.","examples":[{"sentence":"Sub-mycenaean pottery is characterized by its simplified designs.","translation":"亜ミケーネの陶器は、その簡素化されたデザインが特徴である。"}],"collocations":["Sub-mycenaean pottery","Sub-mycenaean period","Sub-mycenaean culture"],"synonyms":["Post-Mycenaean"],"antonyms":["Mycenaean"]},{"part_of_speech":"noun","definition":"亜ミケーネ文化","english_definition":"The archaeological culture of Greece in the period following the collapse of the Mycenaean civilization.","examples":[{"sentence":"The Sub-mycenaean represents a period of transition and decline in material culture.","translation":"亜ミケーネ文化は、物質文化における移行と衰退の時代を代表する。"}],"collocations":["early Sub-mycenaean","late Sub-mycenaean"],"synonyms":["Post-Mycenaean culture"],"antonyms":["Mycenaean culture"]}],"etymology":{"value":"\"Sub-\" (below, after) + \"Mycenaean\" (relating to Mycenae). Refers to the period after the collapse of Mycenaean civilization.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsʌb.maɪ.sɪˈniː.ən/","syllables":"Sub-my-ce-nae-an"},"inflection":{"notes":"Adjective and noun forms exist. Noun is typically uncountable when referring to the culture in general."},"usage_notes":{"explanation":"The term \"Sub-mycenaean\" refers to a specific period in Greek history and archaeology. It is used to describe artifacts, culture, and historical events that occurred after the fall of the Mycenaean civilization but before the rise of the Geometric period. It denotes a decline in artistic and cultural sophistication compared to the preceding Mycenaean era.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Submycenaean was a great civilization.","correct":"✓ The Sub-mycenaean period was a time of decline after the Mycenaean civilization.","note":"Sub-mycenaean represents a decline, not a peak, in civilization."}],"priority":"★☆☆"},"related_words":{"derivatives":["Mycenaean","Geometric period","Dark Ages"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Sub-mycenaean\" is specialized and used primarily in historical and archaeological contexts. It refers to the period following the Mycenaean civilization in Greece, characterized by a decline in material culture and artistic sophistication. Understanding requires familiarity with ancient Greek history and archaeological terminology."},"example_sentences":[{"sentence":"The transition from Mycenaean to Sub-mycenaean society was marked by significant social and economic changes.","translation":"ミケーネ社会から亜ミケーネ社会への移行は、社会と経済の大きな変化によって特徴づけられた。","type":"adjective","meaning_category":"Historical Period"},{"sentence":"Sub-mycenaean burial practices differed from those of the preceding Mycenaean era.","translation":"亜ミケーネの埋葬習慣は、先行するミケーネ時代のものとは異なっていた。","type":"adjective","meaning_category":"Cultural Practice"},{"sentence":"Archaeologists have uncovered several Sub-mycenaean sites in the Peloponnese.","translation":"考古学者はペロポネソス半島でいくつかの亜ミケーネ遺跡を発掘した。","type":"adjective","meaning_category":"Archaeological Context"}]}