{"word":"Popularly-initiated","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Initiated or started by the general public or a large group of people, rather than by authorities or leaders.","english_definition":"Brought about or started by the general public or a large number of people, as opposed to being initiated by authorities or leaders.","examples":[{"sentence":"The project was popularly-initiated, with residents gathering signatures to petition the local government.","translation":"そのプロジェクトは住民が署名を集めて地方自治体に請願するという、住民発議によるものだった。"},{"sentence":"The movement was popularly-initiated in response to the government's proposed policy changes.","translation":"その運動は、政府が提案した政策変更に対応して、民衆の発意によって始まった。"}],"collocations":["popularly-initiated petition","popularly-initiated movement","popularly-initiated campaign","popularly-initiated referendum"],"synonyms":["grassroots","bottom-up","community-driven","citizen-led"],"antonyms":["top-down","government-led","authority-driven","officially-initiated"]}],"etymology":{"value":"Derived from the combination of 'popularly' (in a manner involving the general public) and 'initiated' (started or set in motion).","priority":"N/A"},"pronunciation":{"ipa":"/ˌpɒpjʊləli ɪˈnɪʃieɪtɪd/","syllables":"Pop-u-lar-ly i-ni-ti-a-ted"},"inflection":{"notes":"Adjective; does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Popularly-initiated' describes something that has its origins in the general population rather than stemming from official sources. It emphasizes the role of the public in starting or driving an action, project, or movement.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The popularly initiated project.","correct":"✓ The popularly-initiated project.","note":"Hyphenation is important to correctly convey the meaning of a compound adjective."}],"priority":"N/A"},"related_words":{"derivatives":["popularly (adverb)","initiate (verb)","initiation (noun)"],"phrases":["popular initiative","grassroots movement"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'popularly-initiated' is relatively formal and is used to describe actions or projects that originate from the general public rather than from authorities or official bodies. It is often used in political or social contexts to emphasize the role of ordinary people in driving change or starting initiatives. The term implies a bottom-up approach, where the impetus for action comes from the community rather than from the top levels of government or organizations."},"example_sentences":[{"sentence":"The new environmental regulations were the result of a popularly-initiated campaign.","translation":"新しい環境規制は、住民発議のキャンペーンの結果だった。","type":"adjective","meaning_category":"Initiated by the public"},{"sentence":"The referendum on the proposed development was popularly-initiated after a large number of residents signed a petition.","translation":"提案された開発に関する住民投票は、多数の住民が請願書に署名した後、住民発議によって開始された。","type":"adjective","meaning_category":"Initiated by the public"}]}