{"word":"deathlikeness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"死んだような様子、死相、死んでいるように見えること","english_definition":"The state or appearance of being dead or resembling death.","examples":[{"sentence":"The wax figure had an uncanny deathlikeness.","translation":"その蝋人形は不気味なほど死んだようだった。"},{"sentence":"His face wore a deathlikeness after the long illness.","translation":"長い病の後、彼の顔は死相を帯びていた。"},{"sentence":"The stillness in the room created a sense of deathlikeness.","translation":"部屋の静けさが死んだような雰囲気を醸し出していた。"}],"collocations":["uncanny deathlikeness (不気味な死相)","a deathlikeness of sleep (死んだような眠り)","a deathlikeness appearance (死んだような外見)"],"synonyms":["cadaverousness","mortality","pallor","likeness of death","semblance of death"],"antonyms":["liveliness","vitality","animation","vivacity"]}],"etymology":{"value":"death + likeness","priority":"★★★"},"pronunciation":{"ipa":"/ˈdɛθlaɪknəs/","syllables":"death-like-ness"},"inflection":{"noun_plural":"deathlikenesses"},"usage_notes":{"explanation":"\"Deathlikeness\" refers to the quality or state of resembling death, often in appearance or stillness. It suggests a strong similarity to the condition of being dead, whether in a physical or metaphorical sense. The word is not commonly used in everyday conversation but may appear in literature or descriptive writing to evoke a sense of morbidity or stillness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The deathlikeness was scared.","correct":"✓ The deathlikeness was scary.","note":"Deathlikeness is a state or appearance, so it cannot be scared. The correct adjective to describe the effect is 'scary' or 'frightening'."},{"incorrect":"✗ He had a deathlikeness in his life.","correct":"✓ He had a deathlikeness in his face.","note":"Deathlikeness is typically associated with appearance, especially the face, rather than a general state of being in life."}],"priority":"★★☆"},"related_words":{"derivatives":["deathlike (adjective: 死んだような、死を思わせる)","likeness (noun: 類似、肖像)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Very rare, not in CEFR vocabulary lists)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"deathlikeness\" is a relatively uncommon and sophisticated term. It describes the quality or state of resembling death, often in appearance or stillness. Understanding this word requires a good grasp of abstract concepts and a familiarity with more advanced vocabulary. It is more likely to be encountered in literature or formal writing than in everyday conversation."},"example_sentences":[{"sentence":"The mask had a disturbing deathlikeness that made her uncomfortable.","translation":"そのマスクは不穏なほど死んだようだったので、彼女は不快になった。","type":"noun","meaning_category":"死んだような様子"},{"sentence":"The patient's pallor gave him a deathlikeness.","translation":"患者の顔色は彼に死相を与えた。","type":"noun","meaning_category":"死相"},{"sentence":"The photograph captured the deathlikeness of the abandoned village.","translation":"その写真は、放棄された村の死んだような様子を捉えていた。","type":"noun","meaning_category":"死んでいるように見えること"}]}