{"word":"morphologists","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"形態論者（形態論を専門とする研究者）","english_definition":"plural of morphologist: a person who studies morphology, especially in biology or linguistics.","examples":[{"sentence":"Morphologists study the structure of words and their component parts.","translation":"形態論者たちは、単語の構造とその構成要素を研究します。"},{"sentence":"Linguistic morphologists analyze how morphemes combine to form words.","translation":"言語学の形態論者たちは、形態素がどのように結合して単語を形成するかを分析します。"},{"sentence":"Biological morphologists examine the form and structure of organisms.","translation":"生物学の形態論者たちは、生物の形態と構造を調べます。"}],"collocations":["linguistic morphologists (言語形態論者)","biological morphologists (生物形態論者)","study of morphology (形態論の研究)","analyze morphemes (形態素を分析する)","word structure (単語構造)"],"synonyms":["linguist","biologist","anatomist","etymologist"],"antonyms":[]}],"etymology":{"value":"The word \"morphologist\" is derived from \"morphology,\" which comes from the Greek words \"morphē\" (form) and \"logia\" (study of).","priority":"★★☆"},"pronunciation":{"ipa":"/mɔːrˈfɒlədʒɪsts/","syllables":"mor-phol-o-gists"},"inflection":{"noun_plural":"morphologists"},"usage_notes":{"explanation":"\"Morphologists\" refers to multiple individuals who are experts in the field of morphology. Morphology is the study of the forms of things, particularly in biology and linguistics. In linguistics, it focuses on the structure of words and their component parts (morphemes). In biology, it involves the study of the form and structure of organisms and their specific structural features.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The morphologist are studying the words.","correct":"✓ The morphologists are studying the words.","note":"Since \"morphologists\" is plural, the verb should also be plural (\"are\")."},{"incorrect":"✗ He is a morphologists.","correct":"✓ He is a morphologist.","note":"When referring to one morphologist, use the singular form \"morphologist\"."}],"priority":"★★☆"},"related_words":{"derivatives":["morphology (形態論)","morpheme (形態素)","morphic (形態の)","amorphous (無定形の)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Morphologists\" is a term used to describe people who study morphology. Morphology is a complex field that looks at the structure and form of things, especially in language (how words are formed) and biology (the shapes and structures of living things). This word is more commonly found in academic or scientific contexts."},"example_sentences":[{"sentence":"The conference brought together leading morphologists from around the world.","translation":"その会議には、世界中から一流の形態論者が集まりました。","type":"noun","meaning_category":"形態論者"},{"sentence":"Morphologists use various techniques to analyze the structure of words.","translation":"形態論者は、単語の構造を分析するために様々な技術を使用します。","type":"noun","meaning_category":"形態論者"},{"sentence":"These morphologists specialize in the study of ancient languages.","translation":"これらの形態論者は、古代言語の研究を専門としています。","type":"noun","meaning_category":"形態論者"}]}