{"word":"Manchesterist","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"マンチェスター学派の信奉者、マンチェスター学派の支持者","english_definition":"A supporter or follower of the Manchester School of economics and politics.","examples":[{"sentence":"He was a staunch Manchesterist, advocating for free trade and minimal government intervention.","translation":"彼は筋金入りのマンチェスター学派の信奉者で、自由貿易と最小限の政府介入を主張していた。"}],"collocations":["staunch Manchesterist","ardent Manchesterist"],"synonyms":["free trader","laissez-faire advocate"],"antonyms":["protectionist","interventionist"]},{"part_of_speech":"形容詞","definition":"マンチェスター学派の、マンチェスター学派に関連する","english_definition":"Relating to or characteristic of the Manchester School.","examples":[{"sentence":"The Manchesterist policies of the time led to significant economic changes.","translation":"当時のマンチェスター学派の政策は、大きな経済変化をもたらした。"}],"collocations":["Manchesterist policies","Manchesterist principles"],"synonyms":["free-trade","laissez-faire"],"antonyms":["protectionist","interventionist"]}],"etymology":{"value":"The term derives from the Manchester School, a 19th-century economic and political movement based in Manchester, England, that advocated for free trade and laissez-faire economics.","priority":"中"},"pronunciation":{"ipa":"/ˈmæntʃɪstərɪst/","syllables":"Man-ches-ter-ist"},"inflection":{"noun_plural":"Manchesterists"},"usage_notes":{"explanation":"The term 'Manchesterist' is primarily historical, referring to a specific group of 19th-century British liberals who advocated for free trade and minimal government intervention in the economy. It is not commonly used in contemporary political discourse.","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"He is a Manchesterist in the modern sense.","correct":"He advocates for free-market principles.","note":"The term 'Manchesterist' is rarely used in modern contexts. It's more appropriate to describe someone as a 'free-market advocate' or similar."}],"priority":"低"},"related_words":{"derivatives":["Manchester School","free trade","laissez-faire"],"related_concepts":["classical liberalism","economic liberalism"],"priority":"中"},"level_frequency":{"frequency_google_ngram":"低頻度","priority":"低"},"readability_explanation":{"level":"C1","text":"The term 'Manchesterist' refers to someone who supports the principles of the Manchester School, a 19th-century British movement that advocated for free trade and minimal government intervention in the economy. This term is primarily used in historical or academic contexts when discussing economic and political history. It is not a common term in everyday language."},"example_sentences":[{"sentence":"As a committed Manchesterist, he opposed any form of protectionism.","translation":"熱心なマンチェスター学派の信奉者として、彼はあらゆる形態の保護主義に反対した。","type":"noun","meaning_category":"信奉者"},{"sentence":"The government's Manchesterist approach to trade led to increased competition.","translation":"政府のマンチェスター学派的な貿易への取り組みは、競争激化につながった。","type":"adjective","meaning_category":"関連する"}]}