{"word":"Subtranslucency","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The property of a material that allows light to pass through it diffusely, so that objects behind it cannot be clearly distinguished.","english_definition":"The property of a material that allows light to pass through it diffusely, so that objects behind it cannot be clearly distinguished.","examples":[{"sentence":"Skin exhibits subtranslucency, allowing light to scatter beneath the surface.","translation":"皮膚は半透明性を示し、光が表面下で散乱するのを可能にする。"},{"sentence":"The subtranslucency of the marble gave the sculpture a soft glow.","translation":"大理石の半透明性により、彫刻は柔らかい輝きを放った。"}],"collocations":["skin subtranslucency","material subtranslucency","simulate subtranslucency","achieve subtranslucency"],"synonyms":["translucency","diffusion","light scattering"],"antonyms":["opacity","transparency"]}],"etymology":{"value":"Derived from the prefix 'sub-' meaning 'under' or 'less than' and 'translucency' referring to the property of being translucent.","priority":"★★☆"},"pronunciation":{"ipa":"/sʌbtrænzˈluːsənsi/","syllables":"sub-trans-lu-cen-cy"},"inflection":{"noun_plural":"subtranslucencies"},"usage_notes":{"explanation":"Subtranslucency refers to the characteristic of a material that allows light to pass through it, but scatters the light in such a way that the objects on the other side are not clearly visible. It is often used in computer graphics to simulate realistic materials like skin, wax, and marble.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The subtransparency of the object was high.","correct":"✓ The subtranslucency of the object was high.","note":"'Subtransparency' is not a standard term. Use 'subtranslucency' to describe the diffuse transmission of light."}],"priority":"★★☆"},"related_words":{"derivatives":["subtranslucent (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Subtranslucency' describes how light passes through a material in a diffused manner, making it difficult to see clearly through it. It's a term often used in technical fields like computer graphics and material science to explain how light interacts with certain substances, such as skin or wax, creating a soft or glowing appearance. Understanding this term can help in grasping how realistic rendering is achieved in digital art and design."},"example_sentences":[{"sentence":"The artist used specific shaders to simulate the subtranslucency of the character's skin.","translation":"アーティストは、キャラクターの肌の半透明性をシミュレートするために、特定のシェーダーを使用した。","type":"noun","meaning_category":"material property"},{"sentence":"Wax candles owe their soft glow to the subtranslucency of the wax.","translation":"ワックスキャンドルの柔らかな光は、ワックスの半透明性によるものである。","type":"noun","meaning_category":"material property"},{"sentence":"The effect of subtranslucency is crucial for realistic rendering in computer graphics.","translation":"半透明性の効果は、コンピュータグラフィックスでのリアルなレンダリングに不可欠である。","type":"noun","meaning_category":"computer graphics"}]}