{"word":"Bourgeoisify","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"ブルジョワ化する、中産階級化する","english_definition":"To make something bourgeois; to cause something to adopt or reflect middle-class values or characteristics.","examples":[{"sentence":"The neighborhood has been bourgeoisified over the past decade.","translation":"この地域は過去10年間でブルジョワ化が進んだ。"},{"sentence":"The artist's work became more bourgeoisified as he gained mainstream success.","translation":"そのアーティストの作品は、主流の成功を収めるにつれて、よりブルジョワ化した。"}],"collocations":["bourgeoisify a neighborhood","bourgeoisify culture","bourgeoisify art"],"synonyms":["gentrify","middle-classify","mainstream","normalize"],"antonyms":["proletarianize","radicalize","declass"],"notes":"Often used critically to suggest a loss of authenticity or radicalism."}],"etymology":{"value":"From 'bourgeois' (French for middle class) + '-ify' (to make).","priority":"★★★"},"pronunciation":{"ipa":"/ˌbʊərʒˈwɑːzɪfaɪ/","syllables":"bour-geois-i-fy"},"inflection":{"verb_forms":{"present_simple":["bourgeoisify","bourgeoisifies"],"past_simple":"bourgeoisified","past_participle":"bourgeoisified","present_participle":"bourgeoisifying"}},"usage_notes":{"explanation":"'Bourgeoisify' is typically used to describe the process by which something becomes more aligned with the values, tastes, and lifestyles of the middle class. This can apply to neighborhoods, cultural products, or even individual behavior. The term often carries a negative connotation, suggesting a loss of authenticity or a dilution of radical or alternative values. It is related to, but distinct from, 'gentrify,' which refers specifically to the physical and economic transformation of a neighborhood.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city bourgeoisified by new buildings.","correct":"✓ The city was bourgeoisified by new buildings.","note":"'Bourgeoisify' is a verb and requires proper conjugation and auxiliary verbs (e.g., 'was bourgeoisified') when used in a sentence."},{"incorrect":"✗ Don't bourgeoisify your mind!","correct":"✓ Don't let your mind become bourgeoisified!","note":"When used reflexively, it's better to use a passive construction to emphasize the process happening to the subject."}],"priority":"★☆☆"},"related_words":{"derivatives":["bourgeoisification (noun)"],"related_concepts":["gentrification","middle class","cultural appropriation","social class"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bourgeoisify' means to make something more middle-class in character or values. It's often used when talking about how a place or thing has become more mainstream or less radical. It's a more specific term than 'gentrify' and is often used in discussions about culture and society."},"example_sentences":[{"sentence":"Critics argued that the museum's new exhibit had been bourgeoisified to appeal to a wider audience.","translation":"批評家たちは、美術館の新しい展示がより多くの観客にアピールするためにブルジョワ化されたと主張した。","type":"verb","meaning_category":"ブルジョワ化する"},{"sentence":"The once-gritty neighborhood has been bourgeoisified with trendy cafes and boutiques.","translation":"かつては荒れていた地域は、トレンディなカフェやブティックでブルジョワ化された。","type":"verb","meaning_category":"ブルジョワ化する"},{"sentence":"Some fear that the internet is being bourgeoisified, losing its original spirit of free and open access.","translation":"インターネットがブルジョワ化され、自由でオープンなアクセスの本来の精神を失いつつあると懸念する人もいる。","type":"verb","meaning_category":"ブルジョワ化する"}]}