{"word":"nuptiality","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"婚姻率、結婚に関する統計","english_definition":"the state or quality of being nuptial; the statistical frequency of marriage in a population.","examples":[{"sentence":"Nuptiality rates have been declining in many developed countries.","translation":"多くの先進国で婚姻率が低下している。"},{"sentence":"Factors influencing nuptiality include economic conditions and cultural norms.","translation":"婚姻率に影響を与える要因には、経済状況や文化的規範が含まれる。"}],"collocations":["nuptiality rate (婚姻率)","high nuptiality (高い婚姻率)","low nuptiality (低い婚姻率)","decline in nuptiality (婚姻率の低下)","factors affecting nuptiality (婚姻率に影響を与える要因)"],"synonyms":["marriage rate","matrimony","wedlock"],"antonyms":["celibacy","divorce rate","singlehood"]}],"etymology":{"value":"Derived from the Latin word 'nuptialis,' meaning 'relating to marriage,' which in turn comes from 'nuptiae,' meaning 'marriage' or 'wedding ceremony.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnʌpʃuˈæləti/","syllables":"nup-tu-al-i-ty"},"inflection":{"noun_plural":"nuptialities (rarely used)"},"usage_notes":{"explanation":"'Nuptiality' refers specifically to the statistical study of marriage patterns within a population. It is often used in demographic research and sociological studies to analyze trends in marriage rates and the factors that influence them. It's a more formal and technical term than simply referring to marriage in general.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nuptiality of the couple was celebrated.","correct":"✓ The marriage of the couple was celebrated.","note":"'Nuptiality' refers to the rate or statistical aspect of marriage, not the event of a specific marriage. Use 'marriage' for the event itself."},{"incorrect":"✗ High nuptiality is always good for a society.","correct":"✓ High marriage rates are not always good for a society.","note":"'Nuptiality' is a statistical term, so it's more accurate to talk about 'high marriage rates' rather than 'high nuptiality' in general discussions about societal well-being."}],"priority":"★☆☆"},"related_words":{"derivatives":["nuptial (adjective: relating to marriage or weddings; noun: a wedding)"],"phrases":["age at first nuptiality (初婚年齢)","total nuptiality rate (合計婚姻率)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. More common in academic and demographic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nuptiality' is a formal term used in sociology and demography to describe the frequency and characteristics of marriages within a population. It's not a word used in everyday conversation. Understanding it requires familiarity with statistical and demographic concepts. You're more likely to encounter it in academic papers, research reports, or discussions about population trends. It is related to the adjective 'nuptial', which means relating to marriage or a wedding."},"example_sentences":[{"sentence":"Changes in social attitudes have significantly impacted nuptiality patterns.","translation":"社会的な態度の変化は、婚姻パターンに大きな影響を与えている。","type":"general","meaning_category":"general"},{"sentence":"Researchers analyze nuptiality data to understand marriage trends over time.","translation":"研究者は、婚姻の傾向を経時的に理解するために婚姻率のデータを分析する。","type":"academic","meaning_category":"academic"},{"sentence":"Economic downturns often lead to a decrease in nuptiality as people postpone marriage.","translation":"景気後退は、人々が結婚を延期するため、しばしば婚姻率の低下につながる。","type":"sociological","meaning_category":"sociological"}]}