{"word":"tragicaster","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(俗語, 軽蔑的) 悲劇を演じる人、大げさに悲しむ人、メロドラマのような人","english_definition":"(slang, derogatory) A person who habitually exaggerates their misfortunes or plays the victim; someone prone to melodramatic behavior.","examples":[{"sentence":"Don't be such a tragicaster; it's just a minor inconvenience.","translation":"そんな悲劇ぶらないで。ただのちょっとした不便でしょう。"},{"sentence":"She's such a tragicaster; she always makes everything about her.","translation":"彼女は本当に悲劇のヒロイン気取りだ。いつも自分のことばかりにするんだから。"},{"sentence":"He's a real tragicaster, always complaining about how hard his life is, even though he's quite privileged.","translation":"彼は本当に悲劇を演じるのが好きだ。かなり恵まれているのに、いつも自分の人生がいかに大変かを不満に思っている。"}],"collocations":["stop being a tragicaster (悲劇を演じるのをやめる)","a born tragicaster (生まれながらの悲劇を演じる人)","classic tragicaster (典型的な悲劇を演じる人)"],"synonyms":["drama queen","melodrama queen","victim complex","attention seeker","histrionic","overreactor","whiner"],"antonyms":["stoic","realist","optimist","level-headed","uncomplaining"]},{"part_of_speech":"noun","definition":"(文学的)下手な悲劇役者","english_definition":"(literary) A poor or unskilled tragic actor.","examples":[{"sentence":"The play was ruined by the tragicaster in the lead role.","translation":"その劇は主役の下手な悲劇役者のせいで台無しになった。"},{"sentence":"His performance was more tragicaster than tragic.","translation":"彼の演技は悲劇的というより、下手な悲劇役者だった。"}],"collocations":["a terrible tragicaster (ひどい悲劇役者)","an amateur tragicaster (素人の悲劇役者)"],"synonyms":["ham actor","bad actor","thespian","histrion"],"antonyms":["talented actor","skilled performer"]}],"etymology":{"value":"a blend of 'tragedy' and '-caster' (as in broadcaster or newscaster), suggesting someone who 'casts' or presents themselves as a figure of tragedy.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtrædʒɪˌkæstər/","syllables":"tra-gi-cas-ter"},"inflection":{"noun_plural":"tragicasters"},"usage_notes":{"explanation":"The term \"tragicaster\" is typically used in a derogatory or humorous way to describe someone who exaggerates their problems or seeks attention by portraying themselves as a victim. It can also refer to a poor or unskilled actor in a tragic role, though this usage is less common.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She's a tragicaster because she's really sad.","correct":"✓ She's a tragicaster because she exaggerates her sadness for attention.","note":"The key element of 'tragicaster' is the exaggeration or performance of sadness, not just the feeling of sadness itself."},{"incorrect":"✗ He's a tragicaster on the stage.","correct":"✓ He's a terrible actor on the stage. / ✓ He's a tragicaster in real life.","note":"When referring to a bad actor, it's clearer to say 'terrible actor.' 'Tragicaster' is more commonly used to describe someone who acts dramatically in their personal life."}],"priority":"★★☆"},"related_words":{"derivatives":["tragic (adjective: 悲劇的な)","cast (verb: 配役する)","caster (noun: 配役者)"],"idioms_phrases":["playing the victim (被害者を演じる)","drama queen (ドラマクイーン)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Uncommon word)","frequency_google_ngram":"Low frequency - Not a common word, primarily used in informal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Tragicaster\" is an uncommon, often derogatory, term used to describe someone who tends to exaggerate their misfortunes or plays the victim. It implies that the person is overly dramatic and seeks attention through their perceived suffering. The word is a blend of \"tragedy\" and \"-caster,\" suggesting someone who \"broadcasts\" or presents themselves as a figure of tragedy. While it can also refer to a poor tragic actor, this usage is less frequent. Understanding the term requires a grasp of its sarcastic and critical undertones."},"example_sentences":[{"sentence":"My roommate is such a tragicaster; she cries over every minor inconvenience.","translation":"私のルームメイトは本当に悲劇のヒロイン気取りだ。ちょっとした不便なことでもすぐ泣くんだから。","type":"noun","meaning_category":"悲劇を演じる人"},{"sentence":"The critic called him a tragicaster, saying his performance lacked genuine emotion.","translation":"評論家は彼を下手な悲劇役者だと呼び、彼の演技には本物の感情が欠けていると言った。","type":"noun","meaning_category":"下手な悲劇役者"}]}