{"word":"squamopetrosal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"鱗状部と錐体部から成る、またはそれらに関連する","english_definition":"Relating to or formed by the squama and the petrous portion of the temporal bone.","examples":[{"sentence":"The squamopetrosal suture is located between the squamous and petrous parts of the temporal bone.","translation":"鱗錐縫合は、側頭骨の鱗状部と錐体部の間に位置する。"}],"collocations":["squamopetrosal suture","squamopetrosal fissure"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'squama' (Latin for scale) referring to the squamous part of the temporal bone, 'petrous' (from Greek 'petra' meaning rock) referring to the petrous part of the temporal bone, and '-al' (suffix indicating relationship).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌskweɪmoʊpɪˈtroʊsəl/","syllables":"squa-mo-pi-tro-sal"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Squamopetrosal' is a technical term used primarily in anatomy and paleontology to describe structures or features related to both the squamous and petrous parts of the temporal bone. It is not a commonly used word outside of these specialized fields.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The squamopetrosal bone.","correct":"✓ The squamopetrosal suture/fissure.","note":"'Squamopetrosal' describes a suture or fissure, not a bone itself. The temporal bone has squamous and petrous parts."}],"priority":"★★☆"},"related_words":{"derivatives":["squamous","petrous","temporal bone"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency - Primarily found in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'squamopetrosal' is a highly specialized anatomical term. It is used to describe structures that relate to both the squamous and petrous parts of the temporal bone. Understanding this term requires knowledge of anatomical terminology. It is predominantly found in medical or paleontological contexts. "},"example_sentences":[{"sentence":"The location of the squamopetrosal fissure can vary slightly between individuals.","translation":"鱗錐裂の位置は、個体間でわずかに異なることがある。","type":"adjective","meaning_category":"Anatomical Location"},{"sentence":"Researchers studied the squamopetrosal region of ancient skulls.","translation":"研究者たちは古代の頭蓋骨の鱗錐部を研究した。","type":"adjective","meaning_category":"Anatomical Study"}]}