{"word":"affordability-based","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"支払い能力に基づいた、手頃な価格を基準とした","english_definition":"Determined or influenced by the ability of people to pay for something; relating to or based on affordability.","examples":[{"sentence":"The government is promoting affordability-based housing policies.","translation":"政府は支払い能力に基づいた住宅政策を推進している。"},{"sentence":"The company offers affordability-based pricing for its products.","translation":"その会社は製品に対して手頃な価格を基準とした価格設定を提供している。"},{"sentence":"The scholarship program is designed to provide affordability-based access to education.","translation":"その奨学金プログラムは、支払い能力に基づいた教育へのアクセスを提供するために設計されている。"}],"collocations":["affordability-based housing","affordability-based pricing","affordability-based access","affordability-based approach","affordability-based model"],"synonyms":["income-based","means-tested","price-sensitive"],"antonyms":["market-based","profit-driven","luxury-oriented"]}],"etymology":{"value":"The term is formed by combining 'affordability' (the state of being affordable) with '-based' (meaning 'based on' or 'determined by').","priority":"☆☆☆"},"pronunciation":{"ipa":"/əˌfɔːrdəˈbɪləti beɪst/","syllables":"af-ford-a-bil-i-ty based"},"inflection":{"notes":"This is an adjective and does not have typical inflectional forms (like pluralization or verb conjugations)."},"usage_notes":{"explanation":"'Affordability-based' is used to describe systems, policies, or approaches that prioritize making goods or services accessible to people with limited financial resources. It emphasizes the importance of considering people's ability to pay when designing or implementing something.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The program is affordability based.","correct":"✓ The program is affordability-based.","note":"Hyphenation is important to clearly indicate that 'affordability' is modifying 'based' as a single concept."}],"priority":"☆☆☆"},"related_words":{"derivatives":["affordability (noun)","affordable (adjective)"],"phrases":["affordability crisis","affordable housing","cost of living"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in specific contexts like economics, housing, and healthcare.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Affordability-based' is a term used in discussions about economics, social policy, and access to essential services. It means that something is designed or priced in a way that takes into account people's ability to pay. This term is most often found in professional or academic contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The city implemented an affordability-based transportation plan to help low-income residents.","translation":"市は低所得者層を支援するために、支払い能力に基づいた交通計画を実施した。","type":"general","meaning_category":"General Use"},{"sentence":"The university offers affordability-based tuition options for students from disadvantaged backgrounds.","translation":"大学は、恵まれない家庭の学生のために、支払い能力に基づいた授業料のオプションを提供している。","type":"education","meaning_category":"Education"},{"sentence":"The healthcare system is moving towards an affordability-based model to ensure everyone has access to medical care.","translation":"医療制度は、誰もが医療を受けられるように、支払い能力に基づいたモデルに移行している。","type":"healthcare","meaning_category":"Healthcare"}]}