{"word":"heterogamy","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"異類婚姻、異型配偶","english_definition":"marriage between people from different social, economic, or cultural backgrounds; the condition of having different kinds of reproductive structures or processes in successive generations.","examples":[{"sentence":"Heterogamy is increasingly common in modern societies.","translation":"異類婚姻は現代社会でますます一般的になっている。"},{"sentence":"Studies show that heterogamous marriages can face unique challenges.","translation":"研究によると、異類婚姻は特有の課題に直面することがある。"},{"sentence":"Heterogamy in plants can involve different types of flowers on the same plant.","translation":"植物における異型配偶は、同じ植物上に異なる種類の花を持つことを含むことがある。"}],"collocations":["social heterogamy (社会的異類婚姻)","cultural heterogamy (文化的異類婚姻)","economic heterogamy (経済的異類婚姻)"],"synonyms":["intermarriage","mixed marriage"],"antonyms":["homogamy"],"related_terms":["hypergamy","hypogamy"]}],"etymology":{"value":"Derived from the Greek words 'heteros' (different) and 'gamos' (marriage).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhɛtəˈrɒɡəmi/","syllables":"het-er-og-a-my"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Heterogamy refers to marriage or mating between individuals from different backgrounds, such as different social classes, ethnicities, or religions. It can also refer to the alternation of modes of reproduction in successive generations, especially in plants. The social science definition is more common.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Homogamy is the opposite of heterogamy in terms of social background.","correct":"Homogamy is the opposite of heterogamy.","note":"Homogamy is the general opposite, specifying 'in terms of social background' is redundant unless the context requires it."}],"priority":"★★☆"},"related_words":{"derivatives":["heterogamous (adjective)"],"related_terms":["homogamy (noun: 同類婚姻)","exogamy (noun: 族外婚)","endogamy (noun: 族内婚)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Heterogamy' is a specialized term primarily used in sociology and biology. In sociology, it describes marriage between individuals from different social backgrounds (e.g., class, ethnicity, religion). In biology, it refers to the alternation of different reproductive modes across generations. Due to its specific usage and academic context, it's considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The increasing prevalence of heterogamy reflects changing social norms and greater acceptance of diversity.","translation":"異類婚姻の増加は、変化する社会規範と多様性のより大きな受容を反映している。","type":"noun","meaning_category":"social marriage"},{"sentence":"Heterogamy in plant life cycles can ensure genetic diversity and adaptation to varying environmental conditions.","translation":"植物のライフサイクルにおける異型配偶は、遺伝的多様性と多様な環境条件への適応を保証することができる。","type":"noun","meaning_category":"biology"}]}