{"word":"unideographical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"表語文字の、表意文字の","english_definition":"Relating to or using a writing system in which each symbol represents a word or morpheme.","examples":[{"sentence":"Chinese is a unideographical language.","translation":"中国語は表語文字の言語です。"},{"sentence":"The unideographical nature of kanji makes it difficult for some learners.","translation":"漢字の表語文字的な性質は、学習者にとって難しいものです。"}],"collocations":["unideographical script","unideographical writing system"],"synonyms":["logographic","ideographic"],"antonyms":["alphabetic","phonetic"]}],"etymology":{"value":"uni- (単一の) + ideograph (表語文字) + -ical (〜に関する)","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌjuːnaɪˌdɪəɡrəˈfɪkəl/","syllables":"u-ni-de-o-graph-i-cal"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"The term \"unideographical\" is often used interchangeably with \"logographic\" or \"ideographic.\" It describes writing systems where symbols (characters) represent words or morphemes, rather than sounds. Chinese characters (hanzi, kanji, hanja) are the most well-known example.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unideographical language is easy to learn because it has pictures.","correct":"✓ The unideographical language can be difficult to learn because each character must be memorized.","note":"While some unideographic characters originated as pictograms, the system is complex and requires memorization of many distinct characters."}],"priority":"☆☆☆"},"related_words":{"derivatives":["unideograph (名詞: 表語文字)"],"related_terms":["logography","ideography","kanji","hanzi","hanja"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term \"unideographical\" is a specialized term used in linguistics and writing systems. It is not commonly used in everyday language. Understanding requires familiarity with concepts of writing systems and linguistic terminology."},"example_sentences":[{"sentence":"The ancient Egyptian hieroglyphs were a form of unideographical writing.","translation":"古代エジプトのヒエログリフは、表語文字の一形態でした。","type":"general","meaning_category":"表語文字の"},{"sentence":"The challenges of creating a computer system that accurately processes unideographical languages are significant.","translation":"表語文字の言語を正確に処理するコンピュータシステムを構築する上での課題は大きい。","type":"technical","meaning_category":"表語文字の"}]}