{"word":"polychromatize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"多色化する、多彩色にする","english_definition":"To subject to or treat by polychromatism; to cause to exhibit a variety of colors.","examples":[{"sentence":"The artist decided to polychromatize the sculpture to make it more vibrant.","translation":"アーティストは、彫刻をより鮮やかにするために多色化することに決めた。"},{"sentence":"The process of polychromatizing the image enhanced its visual appeal.","translation":"画像を多色化するプロセスは、その視覚的な魅力を高めた。"}],"collocations":["polychromatize a sculpture","polychromatize an image","polychromatize a surface"],"synonyms":["colorize","tint","paint","variegate"],"antonyms":["monochromatize","desaturate","grayscale"]}],"etymology":{"value":"From 'poly-' (meaning 'many') + 'chromatic' (relating to color) + '-ize' (a suffix indicating to make or become).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒlɪˈkroʊmətaɪz/","syllables":"pol-y-chro-ma-tize"},"inflection":{"verb_forms":{"present_simple":["polychromatize","polychromatizes"],"past_simple":"polychromatized","past_participle":"polychromatized","present_participle":"polychromatizing"}},"usage_notes":{"explanation":"'Polychromatize' is a relatively rare verb that specifically refers to the act of adding multiple colors to something, often to enhance its appearance or make it more visually interesting. It is more technical than simply 'colorize' or 'paint'.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The photo was polychromatic.","correct":"✓ The photo was polychromatized.","note":"'Polychromatic' is an adjective meaning 'having many colors.' 'Polychromatized' is the past participle of the verb 'polychromatize,' meaning 'having been subjected to the process of adding many colors.'"},{"incorrect":"✗ He polychromatized the black and white photo with only one color.","correct":"✓ He tinted the black and white photo.","note":"'Polychromatize' implies the use of multiple colors. If only one color is used, 'tinted' or 'colored' is more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["polychrome (noun/adjective: an object or style characterized by many colors)","polychromatism (noun: the use of many colors; the condition of exhibiting many colors)","polychromatic (adjective: having many colors)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Polychromatize' is a specialized term referring to the process of adding multiple colors to something, often to enhance its visual appeal. It is not a commonly used word and is more likely to be encountered in technical or artistic contexts. Understanding the etymology (poly- meaning 'many,' chromatic relating to color, and -ize indicating a process) can help in grasping its meaning. It is distinct from simply 'coloring' something, as it implies a deliberate and often complex application of multiple colors."},"example_sentences":[{"sentence":"The museum curator decided to polychromatize the ancient statues to restore their original appearance.","translation":"博物館の学芸員は、古代彫刻の元の外観を復元するために多色化することを決定した。","type":"verb","meaning_category":"多色化する"},{"sentence":"The artist used advanced techniques to polychromatize the digital artwork.","translation":"アーティストは、デジタルアートワークを多色化するために高度な技術を使用した。","type":"verb","meaning_category":"多彩色にする"}]}