{"word":"metabiotically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"代謝的に; 代謝を通して","english_definition":"In a metabiotic manner; through metabiosis or metabolic processes.","examples":[{"sentence":"The compound is processed metabiotically within the cell.","translation":"その化合物は細胞内で代謝的に処理されます。"},{"sentence":"The drug acts metabiotically to alter the enzyme activity.","translation":"その薬は代謝的に作用して酵素活性を変化させます。"}],"collocations":["processed metabiotically","acts metabiotically"],"synonyms":["metabolically"],"antonyms":[]}],"etymology":{"value":"Formed from 'metabiotic' (relating to metabiosis or metabolism) and '-ally' (forming adverbs).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɛtəbaɪˈɒtɪkli/","syllables":"me-ta-bi-ot-i-cal-ly"},"inflection":{},"usage_notes":{"explanation":"'Metabiotically' is primarily used in scientific or technical contexts, particularly in biology, biochemistry, and pharmacology. It describes processes or actions that occur as a result of, or in relation to, metabolism or metabiosis.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["metabiotic (adjective)","metabiosis (noun)","metabolism (noun)"],"related_terms":["metabolic","biotransformation","pharmacokinetics"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'metabiotically' is a highly specialized term primarily encountered in advanced scientific literature, specifically in fields such as biochemistry, pharmacology, and advanced biology. Its usage implies a detailed understanding of metabolic processes and their influence on the behavior or processing of substances within biological systems. Due to its technical nature, it is unlikely to appear in general texts and is reserved for expert discourse.","priority":"★★☆"},"example_sentences":[{"sentence":"The xenobiotic compound was degraded metabiotically by the gut microbiota.","translation":"その異物化合物は腸内細菌叢によって代謝的に分解されました。","type":"scientific","meaning_category":"metabolic processing"},{"sentence":"The drug's effectiveness is determined by how it is processed metabiotically in the liver.","translation":"その薬の有効性は、肝臓でどのように代謝的に処理されるかによって決まります。","type":"pharmacological","meaning_category":"drug metabolism"}]}