{"word":"endopterygotous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"内翅類の、内生翅の","english_definition":"Relating to insects of the Endopterygota, characterized by holometabolous development (complete metamorphosis).","examples":[{"sentence":"Endopterygotous insects include beetles, flies, bees, wasps, ants, butterflies, and moths.","translation":"内翅類の昆虫には、カブトムシ、ハエ、ハチ、スズメバチ、アリ、チョウ、ガなどが含まれます。"},{"sentence":"The endopterygotous life cycle involves a larval stage, a pupal stage, and an adult stage.","translation":"内翅類のライフサイクルは、幼虫期、蛹期、成虫期を含みます。"}],"collocations":["endopterygotous insect","endopterygotous development","endopterygotous metamorphosis"],"synonyms":["holometabolous"],"antonyms":["exopterygous","hemimetabolous"]}],"etymology":{"value":"From the Greek words 'endon' (within, inner), 'pteryx' (wing), and 'gote' (having). Refers to insects whose wings develop internally during the pupal stage.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛndoʊptəˈrɪɡətəs/","syllables":"en-do-pte-ry-go-tous"},"inflection":{"notes":"This is an adjective, so it has no plural form or verb conjugations."},"usage_notes":{"explanation":"The term 'endopterygotous' is primarily used in entomology (the study of insects) to classify insects based on their developmental process. It is contrasted with 'exopterygous' insects, which undergo incomplete metamorphosis.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The endopterygotous insect has a nymph stage.","correct":"✓ The endopterygotous insect has a larval stage.","note":"Endopterygota do not have a nymph stage; they have a larval stage followed by a pupal stage."}],"priority":"★★☆"},"related_words":{"derivatives":["Endopterygota (noun: the taxonomic superorder of endopterygotous insects)"],"related_terms":["holometabolism (noun: complete metamorphosis)","larva (noun: the immature form of an endopterygotous insect)","pupa (noun: the transformation stage between larva and adult in endopterygotous insects)","metamorphosis (noun: the process of transformation from an immature form to an adult form in two or more distinct stages)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Endopterygotous' is a technical term used in entomology to describe insects that undergo complete metamorphosis. This means they have a distinct larval stage (e.g., a caterpillar), a pupal stage (e.g., a chrysalis), and an adult stage (e.g., a butterfly). This term is typically encountered in scientific literature or advanced studies of insects. Understanding this term requires familiarity with basic entomological concepts."},"example_sentences":[{"sentence":"The endopterygotous nature of butterflies allows for significant changes in morphology between the larval and adult stages.","translation":"蝶の内翅類の性質は、幼虫期と成虫期の間で形態に大きな変化をもたらします。","type":"adjective","meaning_category":"内翅類の"},{"sentence":"Studying endopterygotous insects provides insights into the evolution of metamorphosis.","translation":"内翅類の昆虫を研究することで、変態の進化に関する洞察が得られます。","type":"adjective","meaning_category":"内翅類の"}]}