{"word":"Diamins","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A group of chemical compounds containing two amino groups (-NH2). They are often used in various industrial and biological processes.","english_definition":"Chemical compounds containing two amino groups (-NH2).","examples":[{"sentence":"Diamins are important precursors in the synthesis of many polymers.","translation":"ジアミンは多くのポリマーの合成における重要な前駆体です。"},{"sentence":"Certain diamins play a role in biological processes within cells.","translation":"特定のジアミンは細胞内の生物学的プロセスにおいて役割を果たします。"}],"collocations":["aliphatic diamins","aromatic diamins","diamin oxidase"],"synonyms":["amino compounds","organic amines"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'di-' (meaning two) and 'amine' (referring to the amino group).","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˈæmiːnz/","syllables":"Di-a-mins"},"inflection":{"noun_plural":"Diamins"},"usage_notes":{"explanation":"'Diamins' refers to a class of chemical compounds. The term is primarily used in chemistry and biochemistry. It's important to note the spelling with an 'i' after 'di-' to distinguish it from other similar-sounding terms.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Diamine is used instead of Diamins when referring to multiple compounds.","correct":"✓ Diamins is the plural form; Diamine is singular.","note":"Use 'Diamins' when referring to multiple compounds and 'Diamine' for a single compound."}],"priority":"★★☆"},"related_words":{"derivatives":["Diamine (singular form)","Polyamine (compound containing multiple amine groups)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Diamins' is a technical term used in chemistry and biochemistry to refer to compounds containing two amino groups. Understanding this term requires a background in chemistry. The plural form 'Diamins' indicates multiple such compounds. It is typically encountered in scientific literature or specialized contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Various types of diamins are used in the production of epoxy resins.","translation":"様々な種類のジアミンがエポキシ樹脂の製造に使用されます。","type":"noun","meaning_category":"Chemical Compounds"},{"sentence":"The properties of diamins can be modified by changing the substituents on the amino groups.","translation":"ジアミンの特性は、アミノ基の置換基を変化させることによって変更できます。","type":"noun","meaning_category":"Chemical Properties"}]}