{"word":"resuspension","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"再懸濁、再浮遊","english_definition":"The act or process of suspending again something that has settled or precipitated, especially particles in a liquid or the redistribution of sediment in a body of water or air.","examples":[{"sentence":"The resuspension of sediment can release pollutants into the water column.","translation":"堆積物の再懸濁は、水柱に汚染物質を放出する可能性があります。"},{"sentence":"Resuspension of the powder is necessary before use.","translation":"使用前に粉末を再懸濁する必要があります。"}],"collocations":["sediment resuspension","powder resuspension","particle resuspension","resuspension rate","resuspension process"],"synonyms":["redispersion","re-suspending","remobilization"],"antonyms":["sedimentation","precipitation","settling"],"notes":"Often used in the context of environmental science, chemistry, and biology."}],"etymology":{"value":"The word is formed by adding the prefix 're-' (meaning again) to 'suspension'. Suspension refers to the state of a substance when its particles are dispersed throughout a fluid but are not dissolved.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːsəˈspɛnʃən/","syllables":"re-sus-pen-sion"},"inflection":{"noun_plural":"resuspensions"},"usage_notes":{"explanation":"'Resuspension' specifically describes the process of something that was previously settled or precipitated being brought back into a suspended state. It is commonly used in scientific and technical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The resuspension caused the solution to dissolve.","correct":"✓ The resuspension caused the particles to disperse.","note":"Resuspension involves dispersing particles, not dissolving them."}],"priority":"★★☆"},"related_words":{"derivatives":["resuspend (verb)"],"related_terms":["suspension","sedimentation","precipitation","dispersion"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Resuspension' is a technical term used in scientific and engineering fields. It refers to the process of particles that have settled out of a liquid or gas being brought back into suspension. Understanding this term requires familiarity with scientific concepts related to particle behavior in fluids."},"example_sentences":[{"sentence":"Wind-induced resuspension of dust particles contributed to the air pollution.","translation":"風によって引き起こされた粉塵粒子の再懸濁が大気汚染の一因となった。","type":"general","meaning_category":"environmental science"},{"sentence":"The laboratory protocol requires resuspension of the cell pellet in buffer.","translation":"実験プロトコルでは、細胞ペレットをバッファーに再懸濁する必要がある。","type":"general","meaning_category":"biology"},{"sentence":"Resuspension of the catalyst is crucial for maintaining the reaction rate.","translation":"触媒の再懸濁は、反応速度を維持するために重要である。","type":"general","meaning_category":"chemistry"}]}