{"word":"antiphilosophically","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"反哲学的に、哲学に反して、哲学とは相容れないやり方で","english_definition":"In a manner opposed to or inconsistent with philosophy; in a way that rejects or contradicts philosophical principles.","examples":[{"sentence":"He approached the problem antiphilosophically, relying on intuition rather than reason.","translation":"彼はその問題に反哲学的に取り組み、理性よりも直感に頼った。"},{"sentence":"The author argues antiphilosophically, prioritizing practical concerns over abstract theories.","translation":"その著者は反哲学的に議論し、抽象的な理論よりも実際的な懸念を優先する。"}],"collocations":["act antiphilosophically","argue antiphilosophically","approach something antiphilosophically","think antiphilosophically"],"synonyms":["irrationally","illogically","untheoretically","pragmatically","empirically"],"antonyms":["philosophically","rationally","logically","theoretically"]},{"part_of_speech":"adverb","definition":"哲学を嫌って、哲学に敵対して","english_definition":"In a manner expressing dislike or hostility towards philosophy.","examples":[{"sentence":"The politician spoke antiphilosophically, dismissing intellectual pursuits as impractical.","translation":"その政治家は反哲学的に話し、知的な探求を非現実的だと切り捨てた。"},{"sentence":"The movement developed antiphilosophically, rejecting abstract thought in favor of direct action.","translation":"その運動は反哲学的に発展し、直接行動を優先して抽象的な思考を拒否した。"}],"collocations":["speak antiphilosophically","behave antiphilosophically","react antiphilosophically","develop antiphilosophically"],"synonyms":["hostilely","antagonistically","dismissively","contemptuously"],"antonyms":["favorably","supportively","respectfully"]}],"etymology":{"value":"Formed by adding the prefix 'anti-' (meaning 'against' or 'opposed to') to 'philosophically'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiˌfɪləˈsɒfɪkli/","syllables":"an-ti-phi-lo-soph-i-cal-ly"},"inflection":{"notes":"This is an adverb and does not have different inflections."},"usage_notes":{"explanation":"'Antiphilosophically' describes actions, arguments, or attitudes that are contrary to the principles and methods of philosophy. It can imply a rejection of reasoned inquiry, abstract thought, or theoretical considerations, often in favor of practicality, intuition, or direct action. It can also express a general disdain or hostility towards philosophical pursuits. The term is relatively uncommon and is typically used in academic or intellectual contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He lived antiphilosophically, enjoying the simple pleasures of life.","correct":"✓ He lived simply, enjoying the pleasures of life, without much philosophical reflection.","note":"Living a simple life doesn't necessarily mean living 'antiphilosophically.' It's more accurate to say someone lives antiphilosophically if they actively reject or oppose philosophical thinking."},{"incorrect":"✗ The artist painted antiphilosophically, creating works that were purely emotional.","correct":"✓ The artist painted intuitively, creating works that were purely emotional.","note":"Creating emotional art is not inherently 'antiphilosophical.' 'Antiphilosophical' implies a conscious rejection of philosophical principles, not just a focus on emotion."}],"priority":"★☆☆"},"related_words":{"derivatives":["antiphilosophical (adjective)","antiphilosophy (noun)"],"related_concepts":["irrationalism","pragmatism","empiricism","anti-intellectualism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'antiphilosophically' is an advanced term that describes something done in a way that is against or contrary to philosophy. It suggests a rejection of philosophical principles, reasoning, or abstract thought. This word is not commonly used and is more likely to be found in academic or intellectual discussions. Understanding the prefix 'anti-' (against) and the term 'philosophically' is helpful in grasping its meaning.","priority":"★☆☆"},"example_sentences":[{"sentence":"The manager made decisions antiphilosophically, ignoring the ethical implications.","translation":"そのマネージャーは倫理的な意味合いを無視して、反哲学的に意思決定を行った。","type":"adverb","meaning_category":"Contrary to philosophical ethics"},{"sentence":"The group acted antiphilosophically, resorting to violence instead of reasoned debate.","translation":"そのグループは理性的な議論の代わりに暴力に訴え、反哲学的に行動した。","type":"adverb","meaning_category":"Rejection of reasoned debate"},{"sentence":"She dismissed the complex theory antiphilosophically, saying it was 'just common sense'.","translation":"彼女は複雑な理論を「ただの常識だ」と言って、反哲学的に一蹴した。","type":"adverb","meaning_category":"Dismissing philosophical theory"}]}