{"word":"intercrinal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(解剖学) 脳梁交連線間の、脳梁膨大後窩間の","english_definition":"(anatomy) Situated between the crines; specifically, between the crura cerebri; or, between the crura of the fornix.","examples":[{"sentence":"The intercrinal space is located between the crura cerebri.","translation":"脳脚間腔は、大脳脚の間に位置する。"},{"sentence":"The intercrinal region is important for certain neurological functions.","translation":"脳脚間領域は、特定の神経機能にとって重要である。"}],"collocations":["intercrinal space","intercrinal region"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the Latin 'inter' (between) and 'crinis' (hair, or figuratively, a lock or branch). In anatomical terms, referring to structures between the 'crura' (legs or branches).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪntərˈkraɪnəl/","syllables":"in-ter-cri-nal"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not commonly used for this word."},"usage_notes":{"explanation":"The term 'intercrinal' is primarily used in anatomical contexts to describe the location of structures relative to the crura cerebri or crura of the fornix. It is a relatively uncommon term and is mostly found in specialized medical or anatomical literature.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["crus (singular of crura)","crura cerebri","crura of fornix"],"related_terms":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'intercrinal' is a highly specialized anatomical term. Understanding it requires a strong background in anatomy and Latin roots. Its use is limited to professional medical and scientific contexts."},"example_sentences":[{"sentence":"The tumor was located in the intercrinal space, making surgical access challenging.","translation":"腫瘍は脳脚間腔に位置しており、外科的アクセスが困難であった。","type":"adjective","meaning_category":"anatomical location"},{"sentence":"Detailed MRI scans are essential for visualizing the intercrinal structures.","translation":"詳細なMRIスキャンは、脳脚間構造を可視化するために不可欠である。","type":"adjective","meaning_category":"anatomical location"}]}