{"word":"membrane-perturbing","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"膜擾乱性の、膜を撹乱する、膜を変化させる","english_definition":"Capable of disrupting or altering the structure or function of a biological membrane.","examples":[{"sentence":"Certain toxins are membrane-perturbing agents that disrupt cell integrity.","translation":"特定の毒素は、細胞の完全性を破壊する膜擾乱性物質です。"},{"sentence":"The membrane-perturbing activity of the peptide was assessed using liposome leakage assays.","translation":"そのペプチドの膜擾乱活性は、リポソーム漏出アッセイを用いて評価されました。"},{"sentence":"Membrane-perturbing peptides can be used to deliver drugs into cells.","translation":"膜擾乱性ペプチドは、細胞への薬物送達に使用できます。"}],"collocations":["membrane-perturbing agent (膜擾乱性物質)","membrane-perturbing peptide (膜擾乱性ペプチド)","membrane-perturbing activity (膜擾乱活性)","membrane-perturbing effect (膜擾乱効果)"],"synonyms":["membrane-disrupting","membrane-altering","membrane-lytic"],"antonyms":["membrane-stabilizing","membrane-protecting"]}],"etymology":{"value":"Derived from 'membrane' (a thin sheet of tissue or material forming a lining, covering, or partition) and 'perturbing' (causing disturbance or disruption).","priority":"★★★"},"pronunciation":{"ipa":"/ˈmɛmbreɪn pərˈtɜːrbɪŋ/","syllables":"mem-brane per-turb-ing"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The term 'membrane-perturbing' is commonly used in biochemistry, cell biology, and pharmacology to describe substances or processes that disrupt the normal structure or function of cell membranes. These substances can interact with the lipid bilayer or membrane proteins, leading to changes in membrane permeability, fluidity, or integrity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The drug has a perturbing effect on the cell.","correct":"✓ The drug has a membrane-perturbing effect on the cell.","note":"The adjective 'perturbing' alone is too general. The specific effect on the membrane needs to be specified."}],"priority":"★★☆"},"related_words":{"derivatives":["perturbation (名詞: 摂動、攪乱)","perturb (動詞: 攪乱する、動揺させる)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Membrane-perturbing' is a technical term used in scientific contexts, particularly in biology and chemistry. It describes something that can disrupt or change the structure or function of a cell membrane. Understanding this term requires knowledge of basic cell biology and chemistry concepts. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The study investigated the membrane-perturbing effects of the novel antimicrobial compound.","translation":"その研究では、新規抗菌化合物の膜擾乱効果が調査されました。","type":"scientific","meaning_category":"disrupting membrane structure"},{"sentence":"The peptide's membrane-perturbing properties allow it to cross the cell membrane.","translation":"そのペプチドの膜擾乱特性により、細胞膜を通過することができます。","type":"scientific","meaning_category":"altering membrane function"},{"sentence":"The researchers examined the mechanism by which the toxin exerts its membrane-perturbing action.","translation":"研究者らは、毒素が膜擾乱作用を発揮するメカニズムを調べました。","type":"scientific","meaning_category":"mechanism of membrane disruption"}]}