{"word":"dolichocephalous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"長頭の、長頭型の","english_definition":"having a relatively long head; having a cephalic index of under 75.","examples":[{"sentence":"The skeletal remains were identified as dolichocephalous.","translation":"その骨格遺物は長頭型であると特定された。"},{"sentence":"Anthropologists use the term dolichocephalous to describe certain skull shapes.","translation":"人類学者は特定の頭蓋骨の形状を記述するために「長頭」という用語を使用する。"}],"collocations":["dolichocephalous skull","dolichocephalic index"],"synonyms":["long-headed"],"antonyms":["brachycephalous","mesocephalous"]}],"etymology":{"value":"From Ancient Greek δολῐχοκέφᾰλος (dolikhoképhalos), from δολῐχός (dolikhós, “long”) +‎ κεφαλή (kephalḗ, “head”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɒlɪkəˈsɛfələs/","syllables":"dol-i-cho-ceph-a-lous"},"inflection":{"notes":"Does not inflect"},"usage_notes":{"explanation":"Dolichocephalous is a technical term primarily used in anthropology and physical anthropology to describe a head shape that is relatively long from front to back compared to its width. The cephalic index (head breadth/head length × 100) is used to classify head shapes, with a dolichocephalic head having an index below 75 in humans. This term is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The baby has a dolichocephalous head because he sleeps on his back.","correct":"✓ The baby has a plagiocephalic head because he sleeps on his back.","note":"Sleeping position can cause positional plagiocephaly, which is a flattening of one side of the head, not dolichocephaly, which is a naturally long head shape."}],"priority":"★☆☆"},"related_words":{"derivatives":["dolichocephaly (noun)"],"related_terms":["cephalic index","brachycephalous","mesocephalous"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'dolichocephalous' is a specialized anthropological term. It is used to describe a head shape that is long relative to its width, as determined by the cephalic index. This term is not commonly encountered outside of academic or scientific contexts.","requires_background":"Requires knowledge of anthropology or physical anthropology to fully understand the term and its context."},"example_sentences":[{"sentence":"The archaeologist noted the dolichocephalous skulls in the ancient burial site.","translation":"考古学者は古代の埋葬地で長頭型の頭蓋骨に注目した。","type":"general","meaning_category":"descriptive"},{"sentence":"Measurements confirmed that the skull was definitively dolichocephalous.","translation":"測定により、その頭蓋骨が明確に長頭型であることが確認された。","type":"technical","meaning_category":"anthropology"}]}