{"word":"tyrannizing","priority":"★☆☆","meanings":[{"part_of_speech":"verb (present participle)","definition":"圧制する、暴政を敷く、横暴に振る舞う","english_definition":"to govern or rule cruelly or unjustly; to exercise oppressive power or control.","examples":[{"sentence":"The dictator was accused of tyrannizing his people.","translation":"その独裁者は国民を圧制していると非難された。"},{"sentence":"He was accused of tyrannizing his subordinates with unreasonable demands.","translation":"彼は部下に対して無理な要求をすることで圧制していると非難された。"},{"sentence":"The older children were tyrannizing the younger ones on the playground.","translation":"年上の子供たちは遊び場で年下の子供たちをいじめていた。"}],"collocations":["tyrannize over (someone)","tyrannize with (something)"],"synonyms":["oppressing","dictating","bullying","intimidating","domineering"],"antonyms":["liberating","freeing","empowering"]}],"etymology":{"value":"The word 'tyrannize' comes from the word 'tyrant,' which originated from the Ancient Greek word 'tyrannos,' meaning 'absolute ruler.' The suffix '-ize' indicates the act of doing or becoming something, so 'tyrannize' means to act like a tyrant.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɪrənaɪzɪŋ/","syllables":"ti-ran-niz-ing"},"inflection":{"verb_forms":{"base_form":"tyrannize","present_simple":["tyrannize","tyrannizes"],"past_simple":"tyrannized","past_participle":"tyrannized","present_participle":"tyrannizing"}},"usage_notes":{"explanation":"'Tyrannizing' describes the act of using power in a cruel and unfair way. It often implies a sustained pattern of oppressive behavior. The word can be used both in political contexts (e.g., a government tyrannizing its citizens) and in personal contexts (e.g., a bully tyrannizing other children).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is tyrannizing with his kindness.","correct":"✓ He is tyrannizing with his power.","note":"Tyrannizing implies the use of negative force or control, not positive attributes like kindness."},{"incorrect":"✗ She is tyrannizing to be the best.","correct":"✓ She is striving to be the best.","note":"Tyrannizing involves oppressing others, not simply trying to achieve personal goals."}],"priority":"★★☆"},"related_words":{"derivatives":["tyrannize (verb)","tyranny (noun)","tyrant (noun)","tyrannical (adjective)","tyrannically (adverb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'tyrannizing' is a relatively advanced term that describes the act of ruling or controlling others in a cruel and oppressive manner. It is often used in contexts involving politics, power dynamics, and abuse of authority. Understanding this word requires a grasp of abstract concepts such as oppression, injustice, and authoritarianism. It is less commonly used in everyday conversation and more frequently found in formal writing or discussions of historical or social issues."},"example_sentences":[{"sentence":"The king was known for tyrannizing his subjects with heavy taxes and harsh laws.","translation":"その王は重税と厳しい法律で臣民を圧制することで知られていた。","type":"general","meaning_category":"圧制する"},{"sentence":"The manager was accused of tyrannizing her employees by constantly criticizing their work.","translation":"そのマネージャーは常に従業員の仕事を批判することで圧制していると非難された。","type":"general","meaning_category":"横暴に振る舞う"},{"sentence":"Stop tyrannizing me with your constant demands!","translation":"絶え間ない要求で私を圧制するのはやめてくれ！","type":"general","meaning_category":"横暴に振る舞う"}]}