{"word":"Australioid","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"オーストラロイドの、オーストラロイドに属する","english_definition":"Relating to the Australoid race or people.","examples":[{"sentence":"Australoid physical characteristics include dark skin and hair.","translation":"オーストラロイドの人種的特徴には、浅黒い肌と髪が含まれます。"}],"collocations":["Australoid race","Australoid features"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"オーストラロイド人種、オーストラロイド人","english_definition":"A member of the Australoid race.","examples":[{"sentence":"The indigenous people of Australia are considered Australoid.","translation":"オーストラリアの先住民はオーストラロイドとみなされています。"}],"collocations":["Australoid people","Australoid population"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'Australia' + '-oid' (resembling).","priority":"★★★"},"pronunciation":{"ipa":"/ɒˈstreɪlɔɪd/","syllables":"Aus-tral-oid"},"inflection":{},"usage_notes":{"explanation":"'Australoid' is a term formerly used in racial classification to refer to people indigenous to Australia, as well as parts of Melanesia and South Asia. It is now largely considered outdated and problematic due to its association with scientific racism. When discussing these populations, it is more appropriate to use specific ethnic or cultural group names.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an Australoid from Europe.","correct":"✓ He is of Australoid descent.","note":"Australoid refers to a specific racial group primarily associated with Australia and surrounding regions. It would be incorrect to use it for someone from Europe."}],"priority":"★★☆"},"related_words":{"derivatives":["Australasia"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'Australoid' is a technical term from anthropology, historically used to classify a group of people. It is not commonly used in everyday language and is now considered outdated by many due to its origins in scientific racism. When discussing people from these regions, it's better to use specific cultural or ethnic group names instead."},"example_sentences":[{"sentence":"Some anthropologists formerly classified Aboriginal Australians as belonging to the Australoid race.","translation":"一部の人類学者はかつて、オーストラリアのアボリジニをオーストラロイド人種に分類していました。","type":"noun","meaning_category":"人種"},{"sentence":"Australoid physical traits are sometimes described as including a robust build and prominent brow ridges.","translation":"オーストラロイドの身体的特徴は、頑丈な体格と顕著な眉の隆起を含むと説明されることがあります。","type":"adjective","meaning_category":"形容詞"}]}