{"word":"amygdalin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アミグダリン (バラ科植物の種子に含まれる配糖体)","english_definition":"A glycoside initially isolated from almonds and found in the seeds of many plants, such as apricots, peaches, and apples.","examples":[{"sentence":"Amygdalin is found in apricot kernels.","translation":"アミグダリンは杏の種子に含まれている。"},{"sentence":"Some people believe amygdalin has anti-cancer properties, but this is not scientifically proven.","translation":"アミグダリンには抗がん作用があると信じている人もいるが、科学的に証明されていない。"}],"collocations":["apricot amygdalin","bitter almond amygdalin","amygdalin content","amygdalin supplement"],"synonyms":["laetrile"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek ἀμυγδαλή (amugdalḗ, \"almond\") + -in.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈmɪɡdəlɪn/","syllables":"a-myg-da-lin"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Amygdalin is a naturally occurring chemical compound found in many plants, particularly in the seeds (kernels) of fruits like apricots, peaches, and almonds. It's known for containing cyanide, which is released when amygdalin is ingested and metabolized. Laetrile is a semi-synthetic derivative of amygdalin that has been promoted as an alternative cancer treatment, but it is not scientifically proven to be effective and can be dangerous due to cyanide poisoning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Amygdalin is a vitamin.","correct":"✓ Amygdalin is a glycoside.","note":"Amygdalin is a glycoside, not a vitamin."},{"incorrect":"✗ Amygdalin is safe to consume in large quantities.","correct":"✓ Amygdalin can be toxic if consumed in large quantities due to its cyanide content.","note":"Amygdalin contains cyanide and can be toxic if consumed in large amounts."}],"priority":"★★☆"},"related_words":{"derivatives":["laetrile"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Amygdalin is a complex chemical compound found in the seeds of certain fruits. It's important to understand that while some people believe it has health benefits, particularly in cancer treatment, scientific evidence does not support these claims. Furthermore, amygdalin contains cyanide, which can be toxic if ingested in large quantities. Therefore, it's crucial to be aware of the potential risks associated with consuming amygdalin-containing products."},"example_sentences":[{"sentence":"The presence of amygdalin in apricot seeds is well-documented.","translation":"杏の種子にアミグダリンが含まれていることはよく知られている。","type":"noun","meaning_category":"chemical compound"},{"sentence":"The potential toxicity of amygdalin is due to its ability to release cyanide.","translation":"アミグダリンの潜在的な毒性は、シアン化物を放出する能力によるものである。","type":"noun","meaning_category":"toxicity"}]}