{"word":"Medusoid","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"クラゲのような、メデューサに似た","english_definition":"Resembling a jellyfish or Medusa; having the form or appearance of a jellyfish or the mythological Medusa.","examples":[{"sentence":"The alien creature had a medusoid appearance, with long, flowing tendrils.","translation":"その異星生物は、長くたなびく触手を持つ、クラゲのような外観をしていた。"},{"sentence":"The artist created a medusoid sculpture using glass and light.","translation":"その芸術家は、ガラスと光を使ってメデューサのような彫刻を制作した。"}],"collocations":["medusoid shape","medusoid form","medusoid structure"],"synonyms":["jellyfish-like","medusan","cnidarian"],"antonyms":[],"notes":"Often used in scientific or artistic contexts to describe shapes or structures that resemble jellyfish or the hair of Medusa from Greek mythology."}],"etymology":{"value":"From Medusa, a Gorgon in Greek mythology whose hair was turned into snakes, + -oid (resembling).","priority":"★★★"},"pronunciation":{"ipa":"/məˈdjuːzɔɪd/","syllables":"me-du-soid"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more medusoid' and 'most medusoid', respectively."},"usage_notes":{"explanation":"'Medusoid' is primarily used in descriptive contexts where the resemblance to a jellyfish or the snake-haired Medusa is relevant. It is more common in technical or artistic writing than in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The medusoid was swimming in the ocean.","correct":"✓ A medusa was swimming in the ocean.","note":"'Medusoid' is an adjective, not a noun. Use 'medusa' (or 'jellyfish') as the noun."}],"priority":"★★☆"},"related_words":{"derivatives":["medusa (noun): a jellyfish; the mythological Medusa"],"related_terms":["cnidaria (noun): the phylum containing jellyfish and related organisms"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency; primarily found in specialized texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Medusoid' is a relatively uncommon word, typically found in scientific or artistic contexts. It describes something that resembles a jellyfish (medusa) in shape or form. Understanding the etymology (related to the mythological Medusa) can aid in comprehension. This word is not generally used in everyday conversation."},"example_sentences":[{"sentence":"The fossil showed a clear medusoid imprint in the rock.","translation":"その化石は、岩の中に明瞭なクラゲのような痕跡を示していた。","type":"descriptive","meaning_category":"resembling a jellyfish"},{"sentence":"The architect designed a building with a medusoid canopy to provide shade.","translation":"建築家は、日陰を作るためにクラゲのような天蓋を持つ建物を設計した。","type":"descriptive","meaning_category":"resembling a jellyfish"}]}