{"word":"diastaltic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(医学) 収縮を抑制する、拡張性の","english_definition":"Relating to or causing dilation or expansion; inhibiting contraction.","examples":[{"sentence":"The drug has a diastaltic effect on the blood vessels.","translation":"その薬は血管に対して拡張効果がある。"},{"sentence":"Diastaltic medications are used to treat certain types of muscle spasms.","translation":"拡張性の薬は、特定の種類の筋肉の痙攣を治療するために使用される。"}],"collocations":["diastaltic effect","diastaltic medication","diastaltic action"],"synonyms":["dilating","relaxing","antispasmodic"],"antonyms":["systaltic","constricting"]}],"etymology":{"value":"From Greek 'diastaltikos' (διασταλτικός), from 'diastellein' (διαστέλλειν) meaning 'to separate, expand', from 'dia-' (διά-) meaning 'apart' + 'stellein' (στέλλειν) meaning 'to place, set'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdaɪəˈstæltɪk/","syllables":"di-a-stal-tic"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Diastaltic' is primarily a medical term used to describe something that causes dilation or inhibits contraction, particularly in the context of blood vessels or muscles. It is the opposite of 'systaltic', which refers to contraction. The term is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The opposite of diastaltic is diastolic.","correct":"✓ The opposite of diastaltic is systaltic.","note":"'Diastaltic' (causing dilation) is often confused with 'diastolic' (relating to the phase of the heartbeat when the heart muscle relaxes and the heart chambers fill with blood). 'Systaltic' is the opposite of 'diastaltic', while 'systolic' is the opposite of 'diastolic'."}],"priority":"★★☆"},"related_words":{"derivatives":["diastalsis (noun: the process of dilation or expansion)"],"related_medical_terms":["diastole (noun: the phase of the heartbeat when the heart muscle relaxes and the heart chambers fill with blood)","systole (noun: the phase of the heartbeat when the heart muscle contracts and pumps blood)","systaltic (adjective: relating to or causing contraction)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - Primarily a medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Diastaltic' is a specialized medical term referring to the property of causing dilation or inhibiting contraction, particularly in biological contexts such as blood vessels or muscles. It is derived from Greek roots indicating separation or expansion. Understanding this term requires familiarity with medical terminology and physiology. It is not typically encountered in general English usage."},"example_sentences":[{"sentence":"The doctor prescribed a diastaltic drug to improve blood flow.","translation":"医者は血流を改善するために拡張性の薬を処方した。","type":"adjective","meaning_category":"causing dilation"},{"sentence":"Certain herbs are known to have diastaltic properties.","translation":"特定のハーブは拡張性があることで知られている。","type":"adjective","meaning_category":"causing dilation"}]}