{"word":"bolometer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ボロメーター（放射熱測定器）","english_definition":"An instrument for measuring radiant heat, especially infrared radiation, by measuring the change in electrical resistance of a thin strip of metal or semiconductor material when it is heated by the radiation.","examples":[{"sentence":"The bolometer is used to detect infrared radiation.","translation":"ボロメーターは赤外線放射を検出するために使用されます。"},{"sentence":"Modern bolometers are highly sensitive.","translation":"現代のボロメーターは非常に高感度です。"}],"collocations":["infrared bolometer","transition edge sensor bolometer","microwave bolometer"],"synonyms":["radiometer","thermistor"],"antonyms":[]}],"etymology":{"value":"The word \"bolometer\" comes from the Greek words \"bolos\" (meaning \"ray\") and \"metron\" (meaning \"measure\"). It was coined by Samuel Pierpont Langley in 1880.","priority":"★★☆"},"pronunciation":{"ipa":"/boʊˈlɒmɪtər/","syllables":"bo-lom-e-ter"},"inflection":{"noun_plural":"bolometers"},"usage_notes":{"explanation":"A bolometer is a type of thermal detector used to measure the power of incident electromagnetic radiation. It relies on the principle that the electrical resistance of a material changes with temperature. When radiation is absorbed by the bolometer's sensitive element (typically a thin film of metal or semiconductor), it heats up, causing a change in resistance that can be measured and correlated to the intensity of the radiation. Bolometers are particularly useful for detecting infrared and microwave radiation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bolometer measure temperature directly.","correct":"✓ The bolometer measures radiant heat by detecting changes in resistance due to temperature changes.","note":"Bolometers don't directly measure temperature; they measure radiant heat, which causes a temperature change that affects the bolometer's resistance."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["thermistor","thermocouple","radiant heat","infrared radiation","microwave radiation"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A bolometer is a scientific instrument used to measure radiant heat, especially infrared radiation. It works by detecting the change in electrical resistance of a material when it absorbs radiation and heats up. This instrument is commonly used in astronomy, climate science, and other fields where precise measurement of radiation is required. Understanding bolometers requires some background knowledge in physics and engineering.","priority":"★☆☆"},"example_sentences":[{"sentence":"The astronomer used a bolometer to measure the faint infrared radiation from distant galaxies.","translation":"天文学者は、遠い銀河からの微弱な赤外線放射を測定するためにボロメーターを使用しました。","type":"general","meaning_category":"measurement of radiant heat"},{"sentence":"The sensitivity of the bolometer allowed for precise measurements of temperature fluctuations.","translation":"ボロメーターの感度により、温度変動の正確な測定が可能になりました。","type":"technical","meaning_category":"sensitivity and precision"}]}