{"word":"SAPR-","priority":"N/A","meanings":[{"part_of_speech":"acronym","definition":"Sexual Assault Prevention and Response","english_definition":"An acronym for Sexual Assault Prevention and Response, referring to programs and policies designed to prevent and address sexual assault.","examples":[{"sentence":"The military has a SAPR- program to educate service members about sexual assault.","translation":"軍は、軍人に性的暴行について教育するためのSAPRプログラムを持っています。"},{"sentence":"She works as a SAPR- advocate, providing support to survivors of sexual assault.","translation":"彼女はSAPRアドボケイトとして働き、性的暴行の生存者にサポートを提供しています。"}],"collocations":["SAPR program","SAPR advocate","SAPR training","SAPR policy"],"synonyms":["SHARP (Sexual Harassment/Assault Response & Prevention)"],"antonyms":[]}],"etymology":{"value":"Acronym derived from the initial letters of Sexual Assault Prevention and Response.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsæpər/","syllables":"Sa-per"},"inflection":{},"usage_notes":{"explanation":"SAPR is primarily used in the context of the U.S. military and other governmental organizations. It refers to the coordinated efforts to prevent sexual assault and provide resources to those affected.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["SAPRO (Sexual Assault Prevention and Response Office)"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"N/A","text":"SAPR- is an acronym, so its readability depends on the audience's familiarity with the term. It's commonly used within specific organizations and contexts related to sexual assault prevention and response."},"example_sentences":[{"sentence":"The base held a SAPR- stand-down day to raise awareness.","translation":"基地は意識を高めるためにSAPRスタンドダウンデーを開催しました。","type":"acronym","meaning_category":"Sexual Assault Prevention and Response"},{"sentence":"All new recruits receive SAPR- training as part of their onboarding process.","translation":"すべての新兵は、入隊プロセスの一環としてSAPRトレーニングを受けます。","type":"acronym","meaning_category":"Sexual Assault Prevention and Response"}]}