{"word":"polyamorous","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ポリアモリーの、複数愛の","english_definition":"relating to or characterized by polyamory.","examples":[{"sentence":"They are in a polyamorous relationship.","translation":"彼らはポリアモリーの関係にあります。"},{"sentence":"She identifies as polyamorous.","translation":"彼女は自身をポリアモリーだと認識しています。"},{"sentence":"Polyamorous relationships require open communication and honesty.","translation":"ポリアモリーの関係には、オープンなコミュニケーションと誠実さが必要です。"}],"collocations":["polyamorous relationship","polyamorous person","be polyamorous","identify as polyamorous"],"synonyms":["non-monogamous","open relationship"],"antonyms":["monogamous"],"related_terms":["ethical non-monogamy","relationship anarchy"]},{"part_of_speech":"noun","definition":"ポリアモリーの人","english_definition":"a person who practices or is open to polyamory.","examples":[{"sentence":"As a polyamorous, he has multiple loving relationships.","translation":"ポリアモリーとして、彼は複数の愛情のある関係を持っています。"},{"sentence":"Polyamorous are often misunderstood.","translation":"ポリアモリーの人々はしばしば誤解されます。"}],"collocations":["a polyamorous","polyamorous people"],"synonyms":["non-monogamist"],"antonyms":["monogamist"],"related_terms":["ethical non-monogamy","relationship anarchy"]}],"etymology":{"value":"The word 'polyamorous' is a hybrid word formed from the Greek prefix 'poly-' (meaning 'many' or 'several') and the Latin word 'amor' (meaning 'love'). It was coined in the early 1990s.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒliˈæmərəs/","syllables":"pol-y-am-o-rous"},"inflection":{"noun_plural":"polyamorous (people)"},"usage_notes":{"explanation":"'Polyamorous' describes the state of having multiple consensual, ethical, and loving relationships at the same time. It is different from cheating because all partners are aware and agree to the arrangement. It emphasizes honesty, communication, and respect among all individuals involved. It can be used as an adjective to describe a relationship or a person, or as a noun to refer to someone who practices polyamory.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Polyamory is the same as cheating.","correct":"✓ Polyamory is a consensual relationship structure, unlike cheating.","note":"Polyamory involves the knowledge and consent of all partners, whereas cheating is a violation of trust and agreement in a monogamous relationship."},{"incorrect":"✗ Polyamorous relationships are always about sex.","correct":"✓ Polyamorous relationships can involve emotional intimacy, love, and commitment, not just sex.","note":"While sex can be a part of polyamorous relationships, it is not the only or defining aspect. Emotional connections and commitment are also important."},{"incorrect":"✗ Polyamorous people can't be committed.","correct":"✓ Polyamorous people can be deeply committed to all of their partners.","note":"Commitment in polyamorous relationships may look different from monogamous relationships, but it is still present and valued."}],"priority":"★★☆"},"related_words":{"derivatives":["polyamory (noun: the practice of having multiple intimate relationships with the full knowledge and consent of all partners involved)"],"related_terms":["monogamy (noun: the practice or state of being married to one person at a time)","non-monogamy (noun: the practice of having multiple sexual or romantic relationships with the knowledge and consent of all partners involved)","open relationship (noun: a type of non-monogamous relationship in which both partners agree that each may have sexual relations with other people)","ethical non-monogamy (noun: a relationship style where all partners consent to and are informed about each other's relationships)","relationship anarchy (noun: the practice of structuring relationships without the use of rules or expectations other than what the people involved mutually agree on)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Polyamorous' is a term used to describe individuals or relationships characterized by the practice of having multiple intimate relationships with the full knowledge and consent of all partners involved. It is important to understand that polyamory is distinct from cheating or infidelity, as it emphasizes honesty, communication, and ethical considerations. The word is relatively new and may not be widely understood, so it's essential to use it with sensitivity and provide context when necessary. It is often discussed in the context of relationship styles and alternative relationship structures.","priority":"★★☆"},"example_sentences":[{"sentence":"The book explores the complexities of navigating a **polyamorous** relationship.","translation":"その本は、ポリアモリーの関係をうまくやっていく上での複雑さを探求しています。","type":"adjective","meaning_category":"describing a relationship"},{"sentence":"She is **polyamorous** and has two partners.","translation":"彼女はポリアモリーで、2人のパートナーがいます。","type":"adjective","meaning_category":"describing a person"},{"sentence":"Many **polyamorous** individuals value open communication and honesty.","translation":"多くのポリアモリーの人々は、オープンなコミュニケーションと誠実さを重視しています。","type":"noun","meaning_category":"referring to people"}]}