{"word":"Un-Hindu","priority":"低","meanings":[{"part_of_speech":"adjective","definition":"ヒンドゥー教的でない、ヒンドゥー教の教義や慣習に反する","english_definition":"Not in accordance with Hindu principles, beliefs, or practices.","examples":[{"sentence":"His actions were considered un-Hindu by the community.","translation":"彼の行動はコミュニティによってヒンドゥー教的でないと見なされた。"},{"sentence":"The practice of eating beef is un-Hindu for many followers.","translation":"牛肉を食べる習慣は、多くの信者にとってヒンドゥー教的ではない。"}],"collocations":["un-Hindu practices","un-Hindu beliefs","un-Hindu behavior"],"synonyms":["non-Hindu","anti-Hindu"],"antonyms":["Hindu"],"notes":"Often used to describe actions or beliefs that contradict traditional Hindu values."}],"etymology":{"value":"Formed with the prefix 'un-' (not) and 'Hindu'.","priority":"中"},"pronunciation":{"ipa":"/ʌnˈhɪnduː/","syllables":"Un-Hin-du"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"The term 'Un-Hindu' is used to describe something that goes against the tenets or customs of Hinduism. It's often subjective and depends on interpretations of Hindu scriptures and traditions.","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"✗ He is un-Hindu because he is Christian.","correct":"✓ He is non-Hindu because he is Christian.","note":"'Un-Hindu' refers to actions or beliefs contrary to Hinduism, not simply being of a different religion. Use 'non-Hindu' to describe someone who is not Hindu."}],"priority":"低"},"related_words":{"derivatives":["Hinduism","Hindu"],"related_concepts":["Dharma","Karma","Moksha"]},"level_frequency":{"frequency_google_ngram":"低","priority":"低"},"readability_explanation":{"level":"C1","text":"The term 'Un-Hindu' is used to describe something that is not in accordance with the principles, beliefs, or practices of Hinduism. It is often used in discussions about religious and cultural norms within the Hindu community."},"example_sentences":[{"sentence":"The caste system, though historically present, is now often criticized as un-Hindu in its discriminatory aspects.","translation":"カースト制度は、歴史的には存在したが、現在では差別的な側面においてヒンドゥー教的でないと批判されることが多い。","type":"adjective","meaning_category":"Contrary to Hindu principles"},{"sentence":"Some modern interpretations of yoga, focusing solely on physical exercise, are seen as un-Hindu by traditionalists.","translation":"ヨガの現代的な解釈の中には、身体的な運動のみに焦点を当てたものが、伝統主義者によってヒンドゥー教的でないと見なされている。","type":"adjective","meaning_category":"Not aligned with Hindu tradition"}]}