{"word":"tensibleness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"引っ張ることができる性質、伸びやすさ、展性","english_definition":"The quality or state of being tensible; capability of being stretched or drawn out.","examples":[{"sentence":"The tensibleness of the metal allowed it to be drawn into thin wires.","translation":"その金属の展性のおかげで、細いワイヤーに引き伸ばすことができた。"}],"collocations":["high tensibleness","low tensibleness"],"synonyms":["ductility","stretchability","malleability","extensibility"],"antonyms":["brittleness","fragility","inflexibility"]}],"etymology":{"value":"'Tensibleness' is derived from 'tensible,' which comes from the Latin word 'tendere,' meaning 'to stretch.' The suffix '-ness' is added to form a noun indicating a quality or state.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɛnsɪbəlnəs/","syllables":"ten-si-ble-ness"},"inflection":{"noun_plural":"tensiblenesses (rarely used)"},"usage_notes":{"explanation":"'Tensibleness' refers to the degree to which a material can be stretched without breaking. It is often used in the context of materials science and engineering. While 'tensibleness' and 'tensility' are related, 'tensility' often refers to the tensile strength, whereas 'tensibleness' refers more generally to the capability of being stretched.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tensibleness of the rope was not enough to hold the weight.","correct":"✓ The tensile strength of the rope was not enough to hold the weight.","note":"Use 'tensile strength' to refer to the maximum stress a material can withstand while being stretched or pulled before failing. 'Tensibleness' refers to the general property of being able to be stretched."}],"priority":"★★☆"},"related_words":{"derivatives":["tensible (adjective)","tensility (noun)","tension (noun)","tensile (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tensibleness' is a technical term used to describe the quality of a material that allows it to be stretched or drawn out. It is related to concepts like ductility and malleability, but specifically emphasizes the ability to withstand tensile forces. This word is more common in scientific or engineering contexts when discussing material properties.","translation":"「tensibleness」は、材料が引き伸ばされたり引き出されたりすることを可能にする品質を説明するために使用される専門用語です。延性や可鍛性などの概念に関連していますが、特に引張力に耐える能力を強調しています。この単語は、材料の特性について議論する科学または工学の文脈でより一般的です。"},"example_sentences":[{"sentence":"The experiment measured the tensibleness of different polymers.","translation":"その実験では、さまざまなポリマーの展性を測定した。","type":"general","meaning_category":"material property"},{"sentence":"The tensibleness of the new alloy made it suitable for high-stress applications.","translation":"新しい合金の展性により、高応力用途に適していることがわかった。","type":"technical","meaning_category":"application"}]}