{"word":"Grecianized","meanings":[{"part_of_speech":"verb","definition":"ギリシア風にする、ギリシア化する","english_definition":"To make or become Greek in character or form.","examples":[{"sentence":"The Roman elite Grecianized their culture by adopting Greek art and philosophy.","translation":"ローマのエリートたちは、ギリシアの芸術や哲学を取り入れることで、自分たちの文化をギリシア化した。"},{"sentence":"The architecture of the building was Grecianized with the addition of columns and pediments.","translation":"その建物の建築は、柱やペディメントが追加されることでギリシア風になった。"}],"synonyms":["Hellenize","Greekify"],"antonyms":["Romanize","Latinize"]},{"part_of_speech":"adjective","definition":"ギリシア風にされた、ギリシア化された","english_definition":"Having been made or become Greek in character or form.","examples":[{"sentence":"The Grecianized statues in the museum were examples of Roman art influenced by Greek styles.","translation":"博物館にあるギリシア風の彫像は、ギリシア様式の影響を受けたローマ美術の例だった。"},{"sentence":"The Grecianized version of the play was set in ancient Athens.","translation":"その劇のギリシア風にされたバージョンは、古代アテネを舞台にしていた。"}],"synonyms":["Hellenized","Greekified"],"antonyms":["Romanized","Latinized"]}],"etymology":{"value":"From 'Grecian' (relating to Greece) + '-ize' (to make or become).","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡriːʃənaɪzd/","syllables":"Gre-cian-ized"},"inflection":{"verb_forms":{"present_simple":["Grecianize","Grecianizes"],"past_simple":"Grecianized","past_participle":"Grecianized","present_participle":"Grecianizing"}},"related_words":{"derivatives":["Grecianization (noun)"],"related_terms":["Greek","Grecian","Hellenic","Hellenize"]},"level_frequency":{},"usage_notes":{"explanation":"'Grecianized' refers to the process or result of something being influenced by or made to resemble Greek culture, art, or language. It can apply to various aspects, including architecture, art, literature, and even personal names.","priority":"★★☆"},"common_mistakes":{},"readability_explanation":{"level":"C1","text":"The word 'Grecianized' is relatively uncommon and is used in academic or historical contexts to describe something that has been influenced by Greek culture. It implies a deliberate or gradual transformation to resemble Greek forms or characteristics."},"example_sentences":[{"sentence":"The Roman Empire Grecianized many aspects of its culture, adopting Greek gods and philosophical ideas.","translation":"ローマ帝国は、ギリシアの神々や哲学思想を取り入れることで、文化の多くの側面をギリシア化した。","type":"verb","meaning_category":"ギリシア風にする"},{"sentence":"The Grecianized facade of the building gave it a classical appearance.","translation":"その建物のギリシア風のファサードは、古典的な外観を与えた。","type":"adjective","meaning_category":"ギリシア風にされた"}]}