{"word":"quasi-English","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"疑似英語、英語に似た言語、英語風の表現","english_definition":"A form of language that resembles English but is not standard or fully grammatical; often used humorously or to imitate English.","examples":[{"sentence":"The politician's speech was full of quasi-English phrases that were difficult to understand.","translation":"その政治家の演説は、理解するのが難しい疑似英語のフレーズでいっぱいだった。"},{"sentence":"The advertisement used quasi-English to appeal to a global audience.","translation":"その広告は、世界中の視聴者にアピールするために疑似英語を使用した。"},{"sentence":"The novel contained sections written in quasi-English to represent the character's limited language skills.","translation":"その小説には、登場人物の限られた言語スキルを表現するために、疑似英語で書かれたセクションが含まれていた。"}],"collocations":["speak quasi-English","use quasi-English","write in quasi-English","pseudo-English"],"synonyms":["mock English","imitation English","pseudo-English","broken English (sometimes, depending on context)"],"antonyms":["standard English","formal English","proper English"]},{"part_of_speech":"adjective","definition":"疑似英語の、英語風の","english_definition":"Resembling English but not being standard or fully grammatical.","examples":[{"sentence":"The website featured quasi-English translations that were often nonsensical.","translation":"そのウェブサイトには、しばしば意味不明な疑似英語の翻訳が掲載されていた。"},{"sentence":"The movie used quasi-English dialogue for comedic effect.","translation":"その映画は、コメディ効果のために疑似英語のセリフを使用した。"},{"sentence":"The user interface included quasi-English labels that confused many users.","translation":"そのユーザーインターフェースには、多くのユーザーを混乱させる疑似英語のラベルが含まれていた。"}],"collocations":["quasi-English translation","quasi-English dialogue","quasi-English text","quasi-English phrases"],"synonyms":["mock-English","imitation-English","pseudo-English"],"antonyms":["standard English","formal English","proper English"]}],"etymology":{"value":"The term is formed by combining the prefix 'quasi-' (meaning 'resembling' or 'apparently but not really') with the word 'English'. It indicates something that appears to be English but lacks the qualities of standard or proper English.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkweɪzaɪ ˈɪŋɡlɪʃ/","syllables":"quasi-En-glish"},"inflection":{"notes":"As a noun, it's generally uncountable. As an adjective, it doesn't inflect."},"usage_notes":{"explanation":"'Quasi-English' refers to language that superficially resembles English but deviates from its standard grammatical rules and vocabulary. It is often used intentionally for humorous effect, to represent a character's limited English proficiency, or in advertising to create a unique or memorable impression. It can also unintentionally arise from poor translation or a lack of fluency. The term is typically used to describe language that is recognizably derived from English but is not considered correct or standard.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He spoke quasi-English fluently.","correct":"✓ He spoke in quasi-English.","note":"You speak 'in' quasi-English, not quasi-English fluently. The focus is on the type of language used, not the fluency of speaking it."},{"incorrect":"✗ The quasi-English are hard to understand.","correct":"✓ Quasi-English is hard to understand.","note":"'Quasi-English' is generally treated as an uncountable noun, so it takes a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["quasi- (prefix meaning 'resembling' or 'apparently but not really')","English","pidgin English","broken English"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (not a standard language level)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'quasi-English' describes language that looks or sounds like English but is not grammatically correct or standard. It's often used intentionally for humor or to represent someone's limited English skills. Think of it as a playful or imperfect version of English. It's not a term you'd use in formal writing, but it's useful for describing language that's trying to be English but isn't quite there."},"example_sentences":[{"sentence":"The instructions were written in such poor English that it was practically quasi-English.","translation":"説明書は非常に質の悪い英語で書かれていたため、ほとんど疑似英語だった。","type":"noun","meaning_category":"resembling English"},{"sentence":"The company's marketing materials often used quasi-English slogans to attract attention.","translation":"その会社のマーケティング資料は、注目を集めるために疑似英語のスローガンをよく使用していた。","type":"adjective","meaning_category":"resembling English"},{"sentence":"The character's dialogue was a mix of English and quasi-English, reflecting his struggles with the language.","translation":"そのキャラクターのセリフは、英語と疑似英語の混ざり合いであり、彼の言語に対する苦労を反映していた。","type":"noun","meaning_category":"resembling English"}]}