{"word":"hypochloremic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"低クロール血症の、低塩化物血症の","english_definition":"Characterized by or relating to hypochloremia, a condition of having abnormally low levels of chloride in the blood.","examples":[{"sentence":"The patient was diagnosed as hypochloremic due to excessive vomiting.","translation":"その患者は、過度の嘔吐により低クロール血症と診断された。"},{"sentence":"Hypochloremic metabolic alkalosis can be caused by prolonged diuretic use.","translation":"低クロール血症性代謝性アルカローシスは、利尿剤の長期使用によって引き起こされる可能性がある。"}],"collocations":["hypochloremic alkalosis","hypochloremic dehydration"],"synonyms":[],"antonyms":["hyperchloremic"]}],"etymology":{"value":"From 'hypo-' (prefix meaning 'below, deficient') + 'chloremia' (condition of having chloride in the blood). 'Chloremia' is derived from 'chlor(o)-' (referring to chlorine or chloride) + '-emia' (suffix referring to a blood condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpoʊkləˈriːmɪk/","syllables":"hy-po-chlo-re-mic"},"inflection":{"notes":"This is an adjective, so it has comparative and superlative forms (more hypochloremic, most hypochloremic), though they are not commonly used."},"usage_notes":{"explanation":"'Hypochloremic' describes a condition or state related to hypochloremia, which is a medical term indicating a lower-than-normal level of chloride in the blood. It is often used in medical contexts to describe patients, conditions, or treatments related to this electrolyte imbalance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient is hypochloremia.","correct":"✓ The patient is hypochloremic.","note":"'Hypochloremia' is the noun referring to the condition itself, while 'hypochloremic' is the adjective describing something related to that condition."}],"priority":"★★☆"},"related_words":{"derivatives":["hypochloremia (noun: the condition of having abnormally low levels of chloride in the blood)"],"related_terms":["electrolyte imbalance","metabolic alkalosis","dehydration"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. This is a specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hypochloremic' is a technical medical term used to describe conditions or states related to lower-than-normal chloride levels in the blood (hypochloremia). Understanding this term requires knowledge of medical terminology and electrolyte balance. It is typically encountered in medical literature or clinical settings."},"example_sentences":[{"sentence":"The infant presented with severe vomiting and was found to be severely **hypochloremic**.","translation":"その乳児は重度の嘔吐を呈し、重度の低クロール血症であることが判明した。","type":"adjective","meaning_category":"medical condition"},{"sentence":"We need to correct the **hypochloremic** state with appropriate electrolyte replacement therapy.","translation":"適切な電解質補充療法で、この低クロール血症の状態を改善する必要がある。","type":"adjective","meaning_category":"medical treatment"}]}