{"word":"pensionably","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"年金受給資格を得て、年金受給可能な状態で","english_definition":"In a manner that qualifies one for a pension; in a way that allows one to receive a pension.","examples":[{"sentence":"He had worked pensionably for over 40 years.","translation":"彼は40年以上、年金受給資格を得られるように働いた。"},{"sentence":"She was employed pensionably, ensuring a comfortable retirement.","translation":"彼女は年金受給可能な状態で雇用され、快適な退職後生活を保証された。"}],"collocations":["work pensionably","employ pensionably"],"synonyms":["eligibly for pension","in a pensionable manner"],"antonyms":["non-pensionably"]}],"etymology":{"value":"The word is derived from 'pensionable,' which means eligible for a pension. The suffix '-ly' is added to form the adverb.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɛnʃənəbli/","syllables":"pen-sion-a-bly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"'Pensionably' describes the manner in which someone works or is employed, specifically in relation to accruing pension benefits. It emphasizes that the work or employment contributes towards eligibility for a pension. It is not a commonly used word but is precise in its meaning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He lived pensionably after retirement.","correct":"✓ He lived on a pension after retirement.","note":"'Pensionably' describes the manner of working or being employed, not living. Use 'on a pension' to describe living after retirement."}],"priority":"★★☆"},"related_words":{"derivatives":["pension (noun): 年金","pensionable (adjective): 年金受給資格のある","pensioner (noun): 年金受給者"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'pensionably' is a specialized term related to employment and retirement benefits. It describes the manner in which someone works or is employed in order to qualify for a pension. Due to its specific and somewhat technical nature, it is not commonly used in everyday language. Understanding requires familiarity with pension systems and related vocabulary."},"example_sentences":[{"sentence":"The contract specified that all employees must be employed pensionably.","translation":"契約書には、すべての従業員が年金受給資格を得られるように雇用されなければならないと明記されていた。","type":"adverb","meaning_category":"年金受給資格を得て"},{"sentence":"She served pensionably in the civil service for over three decades.","translation":"彼女は30年以上にわたり、年金受給資格を得て公務員として勤務した。","type":"adverb","meaning_category":"年金受給可能な状態で"}]}