{"word":"jealousy-provoking","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"嫉妬を誘う、妬ましい、羨ましい","english_definition":"Causing feelings of jealousy in someone.","examples":[{"sentence":"Her success was jealousy-provoking to her colleagues.","translation":"彼女の成功は同僚たちの嫉妬を誘った。"},{"sentence":"The celebrity's lavish lifestyle is jealousy-provoking to many.","translation":"その有名人の贅沢なライフスタイルは多くの人に妬ましいと思わせる。"},{"sentence":"The couple's seemingly perfect relationship can be jealousy-provoking.","translation":"そのカップルの完璧に見える関係は嫉妬を誘うことがある。"}],"collocations":["jealousy-provoking behavior (嫉妬を誘う行動)","jealousy-provoking comments (嫉妬を誘うコメント)","jealousy-provoking display (嫉妬を誘う見せびらかし)","jealousy-provoking lifestyle (嫉妬を誘うライフスタイル)"],"synonyms":["enviable","covetable","desirable","admirable","resentment-inducing"],"antonyms":["unremarkable","unimpressive","undesirable","unenvied"]}],"etymology":{"value":"The word is formed by combining 'jealousy' (the feeling of envy and resentment) with 'provoking' (causing a reaction). It describes something that incites or causes feelings of jealousy.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdʒɛləsi prəˈvoʊkɪŋ/","syllables":"jeal-ous-y pro-vok-ing"},"inflection":{"notes":"This is an adjective, so it doesn't inflect like a verb. It can be used to modify nouns."},"usage_notes":{"explanation":"'Jealousy-provoking' is used to describe something that is likely to make others feel jealous. It often implies that the thing being described is something desirable or impressive. The intensity of the jealousy provoked can vary depending on the context. It's important to note that the word carries a slightly negative connotation, as jealousy is generally considered an undesirable emotion.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is jealousy-provoking.","correct":"✓ His actions are jealousy-provoking.","note":"'Jealousy-provoking' describes something that causes jealousy, not a person. Use it to describe actions, situations, or possessions, not people directly."},{"incorrect":"✗ She felt jealousy-provoking.","correct":"✓ She felt jealous.","note":"'Jealousy-provoking' describes what causes jealousy, not the feeling itself. To describe the feeling, use 'jealous'."}],"priority":"★★☆"},"related_words":{"derivatives":["jealous (adjective: feeling or showing envy of someone or their achievements and advantages)","jealously (adverb: in a fiercely protective or possessive way)","provoke (verb: stimulate or give rise to (a reaction or emotion), typically a strong or unwelcome one)","provocation (noun: action or speech that makes someone annoyed or angry; incitement)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. More common in written language than spoken.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Jealousy-provoking' is a complex adjective used to describe something that causes feelings of jealousy. It's not a very common word, so it's more likely to be encountered in written texts or formal speech. Understanding the word requires knowledge of both 'jealousy' and 'provoking'. It implies that the object or situation being described is desirable enough to cause envy in others."},"example_sentences":[{"sentence":"The model's flawless skin was truly jealousy-provoking.","translation":"そのモデルの完璧な肌は本当に妬ましかった。","type":"adjective","meaning_category":"causing jealousy"},{"sentence":"His constant boasting about his wealth was jealousy-provoking to his less fortunate friends.","translation":"彼の絶え間ない富の自慢は、恵まれない友人たちに嫉妬を誘った。","type":"adjective","meaning_category":"causing jealousy"},{"sentence":"The company's innovative products are often jealousy-provoking to its competitors.","translation":"その会社の革新的な製品は、しばしば競合他社の嫉妬を誘う。","type":"adjective","meaning_category":"causing jealousy"}]}