{"word":"typification","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"類型化、典型化、典型例の作成","english_definition":"The act, process, or result of creating a typical example or representative model of something.","examples":[{"sentence":"The typification of the modern family is often debated.","translation":"現代家族の類型化はしばしば議論される。"},{"sentence":"His work involves the typification of different architectural styles.","translation":"彼の仕事は、さまざまな建築様式の類型化を伴う。"},{"sentence":"The study focused on the typification of consumer behavior.","translation":"その研究は、消費者行動の類型化に焦点を当てた。"}],"collocations":["social typification","cultural typification","historical typification","typification process","typification method"],"synonyms":["categorization","classification","generalization","representation","idealization"],"antonyms":["individualization","differentiation","particularization"]},{"part_of_speech":"noun","definition":"(社会学)社会現象を理解するために、特定の社会的役割や行動パターンを典型的なものとして捉えること","english_definition":"(Sociology) The process of creating standard or typical social roles or patterns of behavior to understand social phenomena.","examples":[{"sentence":"Schutz's theory emphasizes the importance of typification in social interaction.","translation":"シュッツの理論は、社会的な相互作用における類型化の重要性を強調している。"},{"sentence":"Typification allows us to make sense of the complex social world.","translation":"類型化によって、複雑な社会世界を理解することができる。"},{"sentence":"Stereotypes are a form of typification, though often inaccurate.","translation":"ステレオタイプは類型化の一形態であるが、しばしば不正確である。"}],"collocations":["social typification","everyday typification","Schutzian typification","typification scheme","typification process"],"synonyms":["social categorization","social classification","social construction","social representation"],"antonyms":["social deconstruction","social individualization"]}],"etymology":{"value":"The word \"typification\" is derived from the verb \"typify,\" which comes from the word \"type.\" The suffix \"-ification\" indicates the process or act of making something into a type.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɪpɪfɪˈkeɪʃən/","syllables":"ty-pi-fi-ca-tion"},"inflection":{"noun_plural":"typifications"},"usage_notes":{"explanation":"\"Typification\" refers to the process of creating a standard or typical example of something. In sociology, it is a key concept for understanding how individuals make sense of the social world by categorizing and classifying people, objects, and events into recognizable types. This process helps to simplify complex social interactions and allows for smoother communication and understanding.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The typification was very unique.","correct":"The typification was very specific.","note":"Typification involves creating a typical or representative example, so saying it is \"unique\" is contradictory. Use \"specific\" or \"detailed\" instead."},{"incorrect":"Typification is always accurate.","correct":"Typification can be inaccurate.","note":"Typifications are generalizations and may not always accurately reflect reality. They can be influenced by biases and stereotypes."}],"priority":"★★☆"},"related_words":{"derivatives":["typify (verb)","typical (adjective)","type (noun)"],"phrasal_verbs":[],"related_concepts":["ideal type (理想型)","stereotype (固定観念)","social construction (社会的構築)","phenomenology (現象学)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Typification\" is a relatively advanced term, particularly used in sociological contexts. It refers to the process of creating a standard or typical example of something, often to understand or categorize social phenomena. This concept is important in understanding how we simplify and make sense of the complex social world around us by forming mental categories and expectations. It's often used in academic discussions and writings about social theory.","priority":"★★☆"},"example_sentences":[{"sentence":"The artist's work is a typification of rural life.","translation":"その芸術家の作品は、農村生活の類型化である。","type":"noun","meaning_category":"Creating a typical example"},{"sentence":"Social typification helps us navigate everyday interactions.","translation":"社会的な類型化は、私たちが日常の相互作用を円滑に進めるのに役立つ。","type":"noun","meaning_category":"Sociological concept"},{"sentence":"The movie presents a typification of the American Dream.","translation":"その映画は、アメリカンドリームの類型化を提示している。","type":"noun","meaning_category":"Creating a typical example"}]}