{"word":"lionisation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"英雄扱い、神格化、過大評価","english_definition":"the act of treating someone as a celebrity or hero; excessive praise or admiration.","examples":[{"sentence":"The lionisation of athletes can sometimes be excessive.","translation":"スポーツ選手の英雄扱いは時に過度になることがある。"},{"sentence":"His lionisation by the media led to an inflated sense of self-importance.","translation":"メディアによる彼の英雄扱いは、自己重要感の肥大化につながった。"},{"sentence":"The film explores the dangers of the lionisation of political figures.","translation":"その映画は、政治家の神格化の危険性を探求している。"}],"collocations":["lionisation of a hero (英雄の英雄化)","media lionisation (メディアによる英雄化)","political lionisation (政治的な英雄化)"],"synonyms":["hero-worship","idolization","veneration","glorification","deification"],"antonyms":["criticism","vilification","condemnation","disparagement"]}],"etymology":{"value":"The word \"lionisation\" comes from the verb \"lionise,\" which originated in the early 19th century. It derives from the practice of visiting the lions at the Tower of London as a form of entertainment or to see something impressive. To \"lionise\" someone meant to treat them as a celebrity or someone worthy of great attention, like the lions themselves.","priority":"★★★"},"pronunciation":{"ipa":"/ˌlaɪənaɪˈzeɪʃən/","syllables":"li-on-i-sa-tion"},"inflection":{"noun_plural":"lionisations"},"usage_notes":{"explanation":"\"Lionisation\" refers to the act of treating someone as a celebrity or hero, often to an excessive degree. It implies a level of admiration and attention that may be unwarranted or disproportionate to the person's actual achievements or qualities. The term often carries a negative connotation, suggesting that the person is being overhyped or idealized.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lionisation was happened after his death.","correct":"✓ The lionisation occurred after his death.","note":"\"Lionisation\" is a noun, so it needs a verb like \"occurred\" or \"took place\" to form a sentence. \"Was happened\" is grammatically incorrect."},{"incorrect":"✗ He enjoyed the lionisation, but it was too much.","correct":"✓ He enjoyed the lionisation, but it became overwhelming.","note":"\"Too much\" is a bit vague. \"Overwhelming\" better captures the feeling of being excessively praised."}],"priority":"★★☆"},"related_words":{"derivatives":["lionise (verb: to treat someone as a celebrity)","lionised (adjective: treated as a celebrity)","lioniser (noun: someone who lionises others)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Lionisation\" is a relatively uncommon word that describes the act of treating someone like a celebrity or hero, often to an excessive degree. It's more formal and less frequently used than words like \"idolization\" or \"hero-worship.\" You'll typically encounter it in academic or journalistic contexts when discussing the public perception and treatment of individuals, especially in politics, sports, or entertainment. The word often carries a critical connotation, suggesting that the person is being overhyped or idealized beyond what is warranted."},"example_sentences":[{"sentence":"The artist's lionisation began after his death, with critics hailing him as a visionary.","translation":"その芸術家の英雄化は死後に始まり、批評家たちは彼を先見の明のある人物として称賛した。","type":"noun","meaning_category":"英雄扱い"},{"sentence":"Some historians argue that the lionisation of certain historical figures distorts our understanding of the past.","translation":"一部の歴史家は、特定の歴史上の人物の英雄化が過去の理解を歪めていると主張している。","type":"noun","meaning_category":"神格化"},{"sentence":"The film satirizes the media's tendency towards the lionisation of controversial celebrities.","translation":"その映画は、物議を醸す有名人を英雄化するメディアの傾向を風刺している。","type":"noun","meaning_category":"過大評価"}]}