{"word":"Grangerism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(稀) 辞書や百科事典などから不適切に引用された、または冗長で不必要な情報や知識のひけらかし。特に、スピーチや文章において、文脈や聴衆にそぐわない学術的な引用や知識を誇示する行為。","english_definition":"(rare) The inappropriate or excessive display of information or knowledge, especially in a speech or writing, often involving quotations from dictionaries, encyclopedias, or other reference works that are irrelevant or unsuitable for the context or audience.","examples":[{"sentence":"His speech was filled with grangerisms, making it difficult for the audience to follow his main point.","translation":"彼のスピーチはグレンジャーイズムで満ち溢れており、聴衆は彼の主張の要点を理解するのが困難だった。"},{"sentence":"The essay suffered from grangerism, as the student seemed more interested in showing off his vocabulary than in making a coherent argument.","translation":"そのエッセイはグレンジャーイズムに苦しめられており、学生は一貫した議論を展開するよりも、自分の語彙力を誇示することに熱心なようだった。"}],"collocations":["display of grangerism","affected by grangerism","avoid grangerism"],"synonyms":["pedantry","ostentation of learning","bombast","pompousness","grandiloquence"],"antonyms":["simplicity","brevity","conciseness","clarity"]}],"etymology":{"value":"この単語は、アメリカの作家ギデオン・グレンジャー（Gideon Granger, 1767-1822）に由来するとされる。グレンジャーは、冗長で難解な表現を多用したことで知られており、彼のスタイルを揶揄して「grangerism」という言葉が生まれた。ただし、この語源には異説もあり、正確な起源は不明確である。","priority":"★★☆"},"pronunciation":{"ipa":"ˈɡreɪndʒərɪzəm","syllables":"Grain-ger-ism"},"inflection":{"noun_plural":"Grangerisms"},"usage_notes":{"explanation":"「Grangerism」は、学術的な知識や引用を不適切にひけらかす行為を指す、やや古風で稀な単語です。スピーチや文章において、聴衆や文脈にそぐわない難解な言葉や引用を多用し、知識を誇示するような場合に用いられます。現代英語では、より一般的な「pedantry（衒学）」や「ostentation of learning（知識のひけらかし）」といった言葉が使われることが多いです。","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The painting was a grangerism of modern art.","correct":"✓ The painting was an example of modern art.","note":"「Grangerism」は、芸術作品そのものを指すのではなく、知識のひけらかしという行為を指します。"},{"incorrect":"✗ He suffered from grangerism and couldn't understand simple concepts.","correct":"✓ He suffered from a lack of understanding of simple concepts.","note":"「Grangerism」は、理解力の欠如ではなく、知識を誇示する傾向を指します。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["pedant","pedantic","ostentation","grandiloquence","bombast"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (非常に高度な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - ほとんど使われない。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"「**Grangerism**」は、非常に専門的な単語で、一般的にはほとんど使われません。この単語は、特にスピーチや文章の中で、不適切または過剰に知識や情報をひけらかすことを指します。これは、文脈や聴衆に合わないような、辞書や百科事典からの引用を含むことがあります。この単語は、高度な語彙力を持つ人や、文学や学術的な議論に携わる人が理解できるでしょう。"},"example_sentences":[{"sentence":"The professor's lecture was so full of grangerisms that the students struggled to grasp the core concepts.","translation":"教授の講義はグレンジャーイズムに満ち溢れており、学生たちは核心となる概念を理解するのに苦労した。","type":"noun","meaning_category":"知識のひけらかし"},{"sentence":"The politician's speech was criticized for its excessive use of grangerisms, which alienated many voters.","translation":"政治家の演説は、グレンジャーイズムの過剰な使用のために批判され、多くの有権者を遠ざけた。","type":"noun","meaning_category":"知識のひけらかし"}]}