{"word":"runfish","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(造語)走る魚、または走るように見える魚","english_definition":"(Neologism) A fish that runs, or appears to run, on land or in water. This is not a recognized scientific term.","examples":[{"sentence":"The mudskipper is a type of runfish, as it can move quickly across mudflats.","translation":"ムツゴロウは、干潟を素早く移動できるため、ある種のランフィッシュです。"},{"sentence":"In science fiction, a runfish might be a genetically engineered creature.","translation":"サイエンスフィクションでは、ランフィッシュは遺伝子操作された生物かもしれません。"}],"collocations":["mudskipper (ムツゴロウ)","walking fish (歩く魚)"],"synonyms":["walking fish","mudskipper"],"antonyms":[]}],"etymology":{"value":"A combination of the words 'run' and 'fish'. This is likely a newly coined term.","priority":"★★★"},"pronunciation":{"ipa":"/ˈrʌnˌfɪʃ/","syllables":"run-fish"},"inflection":{"noun_plural":"runfishes"},"usage_notes":{"explanation":"'Runfish' is not a standard or scientifically recognized term. It is likely a neologism or a descriptive term used informally to refer to fish that exhibit running-like movements. The term might be used in contexts such as science fiction, fantasy, or casual conversation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The runfish are swimming in the ocean.","correct":"✓ The runfish are moving on land.","note":"'Runfish' implies movement on land or a surface, not typical swimming."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Neologism)","frequency_google_ngram":"Very Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Runfish' is a made-up word, combining 'run' and 'fish'. It would likely be used to describe a fish that moves in a way that resembles running, usually on land or in shallow water. Because it's not a real word, its meaning depends on context and creative interpretation."},"example_sentences":[{"sentence":"The children giggled as they watched the tiny runfish scamper across the sand.","translation":"子供たちは小さなランフィッシュが砂の上をちょこまか走り回るのを見てくすくす笑った。","type":"noun","meaning_category":"走る魚"},{"sentence":"The scientist described the unique locomotion of the runfish, noting its adaptation to terrestrial environments.","translation":"科学者は、ランフィッシュの独特な運動について説明し、陸上環境への適応について言及した。","type":"noun","meaning_category":"走る魚"}]}