{"word":"voltameter","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"電量計、電気分解槽","english_definition":"An electrolytic cell used to measure electric current by measuring the amount of a substance deposited or liberated in a given time.","examples":[{"sentence":"The voltameter was used to accurately measure the current flowing through the circuit.","translation":"電量計は、回路を流れる電流を正確に測定するために使用されました。"},{"sentence":"By measuring the mass of copper deposited in the voltameter, the total charge passed could be determined.","translation":"電量計に析出した銅の質量を測定することで、通過した総電荷を決定することができました。"}],"collocations":["copper voltameter","silver voltameter","electrolytic voltameter","measure current with a voltameter","deposit metal in a voltameter"],"synonyms":["coulometer","electrolytic cell","electrochemical cell"],"antonyms":[]}],"etymology":{"value":"Derived from 'volt' (unit of electrical potential) + 'am(pere)' (unit of electric current) + '-meter' (measuring instrument).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌvɒltəˈmiːtər/","syllables":"vol-ta-me-ter"},"inflection":{"noun_plural":"voltameters"},"usage_notes":{"explanation":"A voltameter is a scientific instrument used to measure electric charge (in coulombs) through electrolytic action. It works by electrolyzing a solution and measuring the amount of substance (usually a metal) deposited or gas liberated at the electrodes. The mass of the substance is directly proportional to the quantity of electricity passed. Although the term 'coulometer' is often used interchangeably, 'voltameter' is the older term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The voltmeter is used to measure the quantity of electricity.","correct":"✓ The voltameter is used to measure the quantity of electricity.","note":"A voltmeter measures voltage (electrical potential), while a voltameter measures the quantity of electricity (charge)."},{"incorrect":"✗ The voltameter measures resistance.","correct":"✓ The ohmmeter measures resistance.","note":"An ohmmeter measures resistance, not a voltameter."}],"priority":"★★☆"},"related_words":{"derivatives":["voltametry (noun: an electrochemical method of analysis in which current voltage curves are measured)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A voltameter is a device used in science to measure the amount of electricity passing through a circuit. It does this by using a special liquid called an electrolyte, and measuring how much of a substance, like a metal, is deposited or released during a process called electrolysis. It's a relatively specialized term, mostly encountered in the context of electrochemistry or historical electrical measurements."},"example_sentences":[{"sentence":"The scientist used a silver **voltameter** to determine the precise amount of charge passed during the experiment.","translation":"科学者は、実験中に通過した電荷の正確な量を決定するために、銀電量計を使用しました。","type":"noun","meaning_category":"電量計"}]}