{"word":"anthozoan","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"花虫類（サンゴ、イソギンチャクなど）","english_definition":"A class of marine invertebrates which includes the sea anemones, corals, and sea pens. They are characterized by having a polyp body form and lacking a medusa stage in their life cycle.","examples":[{"sentence":"Corals are a type of anthozoan that build reefs in tropical oceans.","translation":"サンゴは熱帯の海で礁を築く花虫類の一種です。"},{"sentence":"Sea anemones are anthozoans that use stinging cells to capture prey.","translation":"イソギンチャクは刺胞を使って獲物を捕らえる花虫類です。"}],"collocations":["coral anthozoan","sea anemone anthozoan","anthozoan polyp","anthozoan reef"],"synonyms":["coral","sea anemone","sea pen","polyp"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek ἀνθός (anthós, \"flower\") + ζῷον (zōion, \"animal\"), referring to the flower-like appearance of many anthozoans.","priority":"★★★"},"pronunciation":{"ipa":"/ˌænθəˈzoʊən/","syllables":"an-tho-zo-an"},"inflection":{"noun_plural":"anthozoans"},"usage_notes":{"explanation":"Anthozoans are exclusively marine animals. They are characterized by their polyp body plan, which is a cylindrical body with a mouth surrounded by tentacles. They lack a medusa stage, unlike other cnidarians like jellyfish. Anthozoans are ecologically important, with corals forming extensive reefs that provide habitat for many marine species.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Anthozoans are plants.","correct":"✓ Anthozoans are animals.","note":"Anthozoans are marine invertebrates, belonging to the animal kingdom, not the plant kingdom."},{"incorrect":"✗ Anthozoans have a medusa stage in their life cycle.","correct":"✓ Anthozoans do not have a medusa stage in their life cycle.","note":"Anthozoans are characterized by the absence of a medusa stage."}],"priority":"★★☆"},"related_words":{"derivatives":["anthozoic (adjective)"],"phylum":"Cnidaria (刺胞動物門)","classes":["Hexacorallia (六放サンゴ亜綱)","Octocorallia (八放サンゴ亜綱)"],"priority":"★★★"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'anthozoan' is a scientific term used to classify a group of marine animals including corals and sea anemones. Understanding this term requires knowledge of biological classification and marine ecosystems. The word itself is derived from Greek roots meaning 'flower animal,' reflecting the flower-like appearance of many of these creatures.","priority":"★★☆"},"example_sentences":[{"sentence":"The Great Barrier Reef is largely composed of the skeletons of coral anthozoans.","translation":"グレートバリアリーフは主にサンゴの花虫類の骨格で構成されています。","type":"general","meaning_category":"description"},{"sentence":"Anthozoans play a crucial role in maintaining the biodiversity of coral reef ecosystems.","translation":"花虫類はサンゴ礁生態系の生物多様性を維持する上で重要な役割を果たしています。","type":"ecological","meaning_category":"importance"}]}