{"word":"Ephoi","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical) A type of traditional outer garment worn by men in ancient Greece, particularly in Sparta. It was a simple, sleeveless tunic.","english_definition":"A type of traditional outer garment worn by men in ancient Greece, particularly in Sparta. It was a simple, sleeveless tunic.","examples":[{"sentence":"The Spartan men often wore the ephoi during athletic events.","translation":"スパルタの男性は、運動競技の際にエフォイをよく着用した。"},{"sentence":"Historical accounts describe the ephoi as a practical garment for soldiers.","translation":"歴史的な記録では、エフォイは兵士にとって実用的な衣服として記述されている。"}],"collocations":["wear an ephoi","Spartan ephoi","ancient Greek clothing"],"synonyms":["tunic","chiton"],"antonyms":[]}],"etymology":{"value":"Derived from Ancient Greek. The exact etymology and usage details require further historical context and linguistic analysis.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈefɔɪ/","syllables":"E-phoi"},"inflection":{"noun_plural":"ephoi"},"usage_notes":{"explanation":"The term 'ephoi' refers specifically to a garment in ancient Greece, primarily associated with Spartan culture. It is not a commonly used word in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"related_terms":["chiton","himation","peplos"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'ephoi' is a specialized term related to ancient Greek history and clothing. It is unlikely to be encountered in general English usage and would primarily appear in historical or academic contexts. Understanding requires knowledge of ancient Greek culture."},"example_sentences":[{"sentence":"The museum exhibit featured a reconstruction of a Spartan warrior wearing a traditional ephoi.","translation":"博物館の展示では、伝統的なエフォイを身に着けたスパルタの戦士の復元が展示されていた。","type":"noun","meaning_category":"historical garment"}]}