{"word":"Romansh","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ロマンシュ語（スイスの公用語の一つ）","english_definition":"A Romance language spoken primarily in the Swiss canton of Graubünden. It is one of Switzerland's four national languages.","examples":[{"sentence":"Romansh is spoken by a small minority in Switzerland.","translation":"ロマンシュ語はスイスのごく少数派によって話されています。"},{"sentence":"There are several dialects of Romansh.","translation":"ロマンシュ語にはいくつかの異なる方言があります。"}],"collocations":["learn Romansh (ロマンシュ語を学ぶ)","speak Romansh (ロマンシュ語を話す)","Romansh language (ロマンシュ語)"],"synonyms":["Rumantsch","Grisons Romansh"],"antonyms":[]},{"part_of_speech":"adjective","definition":"ロマンシュ語の、ロマンシュ語を話す人々の","english_definition":"Relating to the Romansh language or the Romansh-speaking people.","examples":[{"sentence":"The Romansh culture is unique to the region.","translation":"ロマンシュ語文化はその地域に独特です。"},{"sentence":"Romansh literature is not widely known.","translation":"ロマンシュ語文学は広く知られていません。"}],"collocations":["Romansh culture (ロマンシュ語文化)","Romansh speaker (ロマンシュ語話者)","Romansh literature (ロマンシュ語文学)"],"synonyms":["Rumantsch"],"antonyms":[]}],"etymology":{"value":"From 'Roman' + '-sh'. Reflecting its origin as a language derived from Vulgar Latin, the language spoken by Roman soldiers and settlers in the region.","priority":"★★☆"},"pronunciation":{"ipa":"/roʊˈmænʃ/","syllables":"Ro-mansh"},"inflection":{"notes":"The noun is invariable. The adjective does not change form."},"usage_notes":{"explanation":"'Romansh' refers both to the language itself and, as an adjective, to things related to the language or the people who speak it. It is important to note that Romansh has several dialects, and its usage is primarily limited to the canton of Graubünden in Switzerland.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Romansh is a language spoken in Romania.","correct":"✓ Romansh is a language spoken in Switzerland.","note":"Romansh is spoken in Switzerland, not Romania."},{"incorrect":"✗ Romansh is similar to Romanian.","correct":"✓ Romansh is related to Romanian, but they are distinct languages.","note":"While both are Romance languages, Romansh and Romanian are distinct and not mutually intelligible."}],"priority":"★★☆"},"related_words":{"derivatives":["Rumantschgrischun (標準ロマンシュ語)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Romansh' is a term referring to a specific language spoken in a particular region of Switzerland. It is not a widely known language outside of linguistic or regional studies. Therefore, understanding requires some background knowledge of European languages and Swiss geography. The term is used in academic and cultural contexts when discussing Switzerland's linguistic diversity."},"example_sentences":[{"sentence":"The Swiss government supports the preservation of Romansh.","translation":"スイス政府はロマンシュ語の保存を支援しています。","type":"noun","meaning_category":"language"},{"sentence":"Romansh-speaking communities are found in the Grisons region.","translation":"ロマンシュ語を話すコミュニティは、グラウビュンデン地方にあります。","type":"adjective","meaning_category":"relating to the language"}]}