{"word":"etiogenic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"病因の、病因性の","english_definition":"Relating to or causing disease; pertaining to the cause or origin of a disease.","examples":[{"sentence":"The etiogenic factors of the disease are still unknown.","translation":"その病気の病因因子はまだ不明である。"},{"sentence":"Etiogenic agents can include bacteria, viruses, and environmental toxins.","translation":"病因物質には、細菌、ウイルス、環境毒素などが含まれる。"}],"collocations":["etiogenic agent","etiogenic factor","etiogenic mechanism"],"synonyms":["causative","pathogenic","causal"],"antonyms":["non-etiologic","non-causative"]}],"etymology":{"value":"From the Greek words 'aitia' (cause) and 'genesis' (origin, creation), combined with the suffix '-ic' (relating to).","priority":"★★★"},"pronunciation":{"ipa":"/ˌiːtioʊˈdʒɛnɪk/","syllables":"e-ti-o-gen-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English, aside from comparative and superlative forms, which are less common for this word."},"usage_notes":{"explanation":"'Etiogenic' is a term primarily used in medical and scientific contexts to describe factors that contribute to the development or cause of a disease. It is often used when discussing the origins and mechanisms of illnesses.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The etiogenic treatment was successful.","correct":"✓ The treatment targeting the etiogenic factors was successful.","note":"'Etiogenic' describes the cause, not the treatment. Treatments target etiogenic factors."}],"priority":"★☆☆"},"related_words":{"derivatives":["etiology (n)","etiological (adj)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Etiogenic' is a specialized term used in medical and scientific fields. It describes something that causes or contributes to the origin of a disease. Due to its technical nature, it is not commonly used in everyday language. Understanding requires familiarity with medical terminology and concepts related to disease causation."},"example_sentences":[{"sentence":"Researchers are investigating the etiogenic role of genetics in the development of the disorder.","translation":"研究者たちは、その疾患の発症における遺伝子の病因的役割を調査している。","type":"general","meaning_category":"causative"},{"sentence":"Identifying the etiogenic agent is crucial for effective treatment.","translation":"効果的な治療のためには、病因物質を特定することが重要である。","type":"medical","meaning_category":"causative"}]}