{"word":"Potidaea","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"ポティデア：古代ギリシャの都市。現在のギリシャ、ハルキディキ半島に位置していた。","english_definition":"An ancient Greek city located on the isthmus of the Pallene peninsula (modern Kassandra) in Chalkidiki, northern Greece. It was founded by Corinthian colonists in the 6th century BC.","examples":[{"sentence":"Potidaea was an important member of the Delian League.","translation":"ポティデアはデロス同盟の重要なメンバーだった。"},{"sentence":"The Battle of Potidaea was fought in 432 BC during the Peloponnesian War.","translation":"ポティデアの戦いは、ペロポネソス戦争中の紀元前432年に戦われた。"}],"collocations":["Siege of Potidaea","Battle of Potidaea","Corinthian colony of Potidaea"],"synonyms":["Nea Poteidaia (modern name of the area)"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek \"Ποτίδαια\" (Potídaia), possibly related to Poseidon (Ποσειδῶν), the Greek god of the sea, as it was a coastal city.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒtɪˈdiːə/","syllables":"Po-ti-dae-a"},"inflection":{},"usage_notes":{"explanation":"Potidaea is primarily used in historical contexts when discussing ancient Greece, the Peloponnesian War, or the history of the Chalkidiki region. It is not a commonly used word in modern English outside of academic or historical discussions. The modern settlement in the area is called Nea Poteidaia.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Potidaean (adjective: relating to Potidaea)"],"related_places":["Chalkidiki","Corinth","Athens","Pallene"],"historical_figures":["Perdiccas II of Macedon","Brasidas","Cleon"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily found in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Potidaea' is a specialized term primarily encountered in historical texts or academic discussions related to ancient Greece. Understanding requires familiarity with ancient Greek history, particularly the Peloponnesian War. The word is not part of everyday vocabulary.","note":"Requires background knowledge of ancient Greek history."},"example_sentences":[{"sentence":"The revolt of Potidaea against Athens was a major cause of the Peloponnesian War.","translation":"アテネに対するポティデアの反乱は、ペロポネソス戦争の主要な原因の一つだった。","type":"historical context","meaning_category":"location"},{"sentence":"Archaeological excavations have revealed much about life in ancient Potidaea.","translation":"考古学的発掘調査により、古代ポティデアの生活について多くのことが明らかになった。","type":"historical context","meaning_category":"location"}]}