{"word":"Pindarize","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"To write or speak in the style of Pindar; to compose or adapt something in the manner of Pindar's odes.","english_definition":"To imitate the style of Pindar, especially in writing or composing odes; to adapt something to the style of Pindar.","examples":[{"sentence":"The poet attempted to Pindarize his verses, aiming for a lofty and celebratory tone.","translation":"その詩人は、高尚で祝賀的な調子を目指して、自身の詩をピンダロス風に書こうと試みた。"},{"sentence":"Critics noted that the speech was Pindarized, filled with digressions and elaborate praise.","translation":"批評家たちは、その演説がピンダロス風であり、脱線や手の込んだ賛辞で満たされていると指摘した。"}],"collocations":["Pindarize a poem","Pindarize a speech","Pindarize one's style"],"synonyms":["imitate Pindar","emulate Pindar","write in the style of Pindar"],"antonyms":[]}],"etymology":{"value":"Derived from the name of the ancient Greek poet Pindar (c. 518 – c. 438 BC) + the suffix '-ize', indicating the act of making or doing something in a particular way.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɪndəraɪz/","syllables":"Pin-da-rize"},"inflection":{"verb_forms":{"present_simple":["Pindarize","Pindarizes"],"past_simple":"Pindarized","past_participle":"Pindarized","present_participle":"Pindarizing"}},"usage_notes":{"explanation":"\"Pindarize\" refers to writing or speaking in a style reminiscent of the ancient Greek poet Pindar, known for his complex, celebratory, and often digressive odes. The term implies a lofty tone, elaborate praise, and a tendency to deviate from a straightforward narrative. It is relatively uncommon in modern usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He tried to Pindarise the situation.","correct":"✓ He tried to Pindarize the poem.","note":"The word is typically used in the context of writing or speaking, not general situations."}],"priority":"★☆☆"},"related_words":{"derivatives":["Pindaric (adjective: relating to Pindar or his style)","Pindaric ode (noun: a type of ode in the style of Pindar)"]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Pindarize\" is a specialized and relatively rare term. It means to write or speak in a style similar to that of the ancient Greek poet Pindar. Pindar's odes are known for their complexity, elevated tone, and digressive nature. Therefore, to \"Pindarize\" something implies adopting these characteristics in one's own writing or speech. The word is most likely to be encountered in literary or academic contexts."},"example_sentences":[{"sentence":"The speaker chose to Pindarize his eulogy, incorporating elaborate metaphors and historical allusions.","translation":"講演者は、手の込んだ比喩や歴史的な言及を取り入れ、追悼の辞をピンダロス風に書くことを選んだ。","type":"verb","meaning_category":"To write or speak in the style of Pindar"},{"sentence":"Some critics found the modern poem overly Pindarized, lacking the directness they preferred.","translation":"一部の批評家は、その現代詩が過度にピンダロス風であり、彼らが好む直接性に欠けていると感じた。","type":"verb","meaning_category":"To write or speak in the style of Pindar"}]}