{"word":"captivatingly","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"魅惑的に、人を惹きつけて、心を奪うように","english_definition":"in a way that is capable of attracting and holding interest; fascinatingly; charmingly.","examples":[{"sentence":"She sang captivatingly, drawing the audience into her world.","translation":"彼女は魅惑的に歌い、聴衆を彼女の世界に引き込んだ。"},{"sentence":"The story was captivatingly told, making it hard to put the book down.","translation":"その物語は心を奪われるように語られ、本を置くのが難しかった。"},{"sentence":"The dancer moved captivatingly across the stage.","translation":"ダンサーは魅惑的に舞台を横切って動いた。"}],"collocations":["captivatingly beautiful","captivatingly charming","captivatingly interesting","captivatingly presented","captivatingly performed"],"synonyms":["charmingly","fascinatingly","enthrallingly","alluringly","engagingly","seductively","mesmerizingly"],"antonyms":["repulsively","disgustingly","offensively","boringly"]}],"etymology":{"value":"The word 'captivatingly' is formed by adding the suffix '-ly' to the adjective 'captivating'. 'Captivating' comes from the verb 'captivate', which originates from the Latin word 'captivare', meaning 'to take captive, capture'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkæptɪveɪtɪŋli/","syllables":"cap-ti-vat-ing-ly"},"inflection":{"notes":"As an adverb, 'captivatingly' does not have different inflections."},"usage_notes":{"explanation":"'Captivatingly' is used to describe actions or qualities that attract and hold someone's attention in a powerful and pleasing way. It suggests a high degree of charm, fascination, or allure. It is often used to describe performances, stories, or appearances that are particularly engaging.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie was very captivate.","correct":"✓ The movie was very captivating.","note":"'Captivate' is a verb. 'Captivating' is the adjective form that should be used to describe something that attracts interest. 'Captivatingly' is the adverb form."},{"incorrect":"✗ She spoke captivating.","correct":"✓ She spoke captivatingly.","note":"To describe how someone speaks in an attracting manner, use the adverb 'captivatingly' rather than the adjective 'captivating'."}],"priority":"★★☆"},"related_words":{"derivatives":["captivate (verb): to attract and hold the interest and attention of someone.","captivating (adjective): capable of attracting and holding interest; charming.","captivation (noun): the state of being captivated or charmed."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but understood in formal contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'captivatingly' is an adverb used to describe something done in a way that is very attractive and interesting. It's more common in formal writing or speech to emphasize the charm or fascination of something. If something is described as 'captivatingly' done, it means it was done in a way that really grabbed people's attention and held it. It is not a very common word in everyday conversation, but it is easily understood."},"example_sentences":[{"sentence":"The ballet was captivatingly choreographed, leaving the audience breathless.","translation":"そのバレエは魅惑的に振り付けられ、観客は息をのんだ。","type":"adverb","meaning_category":"魅惑的に"},{"sentence":"The museum exhibit was captivatingly designed to engage visitors of all ages.","translation":"博物館の展示は、あらゆる年齢層の訪問者を引き込むように魅惑的に設計されていた。","type":"adverb","meaning_category":"人を惹きつけて"},{"sentence":"He spoke captivatingly about his adventures in the Amazon rainforest.","translation":"彼はアマゾンの熱帯雨林での冒険について、心を奪うように語った。","type":"adverb","meaning_category":"心を奪うように"}]}