{"word":"upliftingly","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"人を元気づけるように、高揚感を与えるように、鼓舞するように","english_definition":"in a way that makes someone feel happier, more hopeful, or more enthusiastic.","examples":[{"sentence":"The music played upliftingly, filling the room with joy.","translation":"その音楽は人を元気づけるように流れ、部屋を喜びに満たした。"},{"sentence":"She spoke upliftingly about the future, inspiring everyone in the audience.","translation":"彼女は未来について高揚感を与えるように語り、聴衆全員を鼓舞した。"},{"sentence":"The film ended upliftingly, leaving the viewers with a sense of hope.","translation":"その映画は人を元気づけるような結末を迎え、視聴者に希望の感覚を残した。"}],"collocations":["speak upliftingly","end upliftingly","play upliftingly","write upliftingly","act upliftingly"],"synonyms":["inspiringly","cheeringly","encouragingly","hearteningly","exhilaratingly","buoyantly"],"antonyms":["depressingly","discouragingly","dishearteningly"]}],"etymology":{"value":"The word \"upliftingly\" is formed by adding the suffix \"-ly\" to the adjective \"uplifting.\" \"Uplifting\" itself is derived from the verb \"uplift,\" which combines \"up\" and \"lift.\" The etymology reflects the idea of physically or emotionally raising something or someone.","priority":"★★★"},"pronunciation":{"ipa":"/ʌpˈlɪftɪŋli/","syllables":"up-lift-ing-ly"},"inflection":{"notes":"As an adverb, \"upliftingly\" does not have different inflections."},"usage_notes":{"explanation":"\"Upliftingly\" describes the manner in which something is done, emphasizing that it has a positive and encouraging effect on people's emotions or spirits. It often suggests a sense of hope, joy, or inspiration. It is used to describe actions, events, or experiences that elevate one's mood or outlook.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The upliftingly movie made me cry.","correct":"✓ The uplifting movie made me cry.","note":"\"Upliftingly\" is an adverb and should modify a verb, adjective, or another adverb. In this case, \"uplifting\" (adjective) should be used to describe the movie."},{"incorrect":"✗ She felt upliftingly after the concert.","correct":"✓ She felt uplifted after the concert.","note":"\"Upliftingly\" describes how something is done, not how someone feels. To describe how someone feels, use the adjective \"uplifted\"."}],"priority":"★★☆"},"related_words":{"derivatives":["uplift (verb, noun)","uplifting (adjective)"],"phrasal_verbs":[],"related_adjectives":["uplifting","inspiring","encouraging","positive"],"related_nouns":["uplift","inspiration","encouragement","hope"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but used in formal and literary contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Upliftingly\" is an adverb that describes something done in a way that makes people feel happier or more hopeful. It is often used in formal writing or when describing art, music, or speeches that have a positive emotional impact. Because it is a more advanced word, it is less common in everyday conversation but is useful for expressing nuanced and positive sentiments.","priority":"★★☆"},"example_sentences":[{"sentence":"The choir sang upliftingly, filling the church with a sense of peace.","translation":"聖歌隊は人を元気づけるように歌い、教会を平和な感覚で満たした。","type":"general","meaning_category":"元気づけるように"},{"sentence":"The speaker addressed the crowd upliftingly, urging them to pursue their dreams.","translation":"講演者は聴衆に高揚感を与えるように語りかけ、夢を追い求めるように促した。","type":"general","meaning_category":"鼓舞するように"},{"sentence":"The story was written upliftingly, focusing on themes of resilience and hope.","translation":"その物語は、回復力と希望というテーマに焦点を当て、人を元気づけるように書かれていた。","type":"general","meaning_category":"高揚感を与えるように"}]}