{"word":"teratologic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"奇形学の、奇形に関する","english_definition":"Relating to or involving the scientific study of congenital abnormalities and malformations.","examples":[{"sentence":"The teratologic examination revealed several anomalies.","translation":"奇形学的検査でいくつかの異常が明らかになった。"},{"sentence":"Teratologic studies are crucial for understanding birth defects.","translation":"奇形学的研究は、先天性欠損症を理解するために重要である。"}],"collocations":["teratologic examination","teratologic study","teratologic effects"],"synonyms":["teratological"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'teras' (monster, marvel) and 'logos' (study, science).","priority":"★★★"},"pronunciation":{"ipa":"/ˌtɛrətəˈlɒdʒɪk/","syllables":"te-ra-to-lo-gic"},"inflection":{},"usage_notes":{"explanation":"'Teratologic' is primarily used in scientific and medical contexts. It specifically refers to the study of structural birth defects, their causes, and their development. It's often used in the context of research, diagnosis, and the assessment of environmental factors that may lead to congenital abnormalities.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["teratology (noun): The study of abnormalities of physiological development.","teratogen (noun): An agent or factor that causes malformation of an embryo.","teratogenic (adjective): Capable of causing malformations in an embryo or fetus."],"priority":"★★★"},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word 'teratologic' is a highly specialized term used in the fields of medicine and developmental biology. It refers to the science of studying birth defects and abnormalities in developing organisms. Due to its technical nature, it is not commonly used outside of these specific contexts."},"example_sentences":[{"sentence":"The researchers conducted a teratologic analysis of the affected tissues.","translation":"研究者たちは、影響を受けた組織の奇形学的分析を実施した。","type":"general","meaning_category":"奇形学の"},{"sentence":"The teratologic effects of the drug were carefully documented.","translation":"その薬物の奇形学的影響は注意深く記録された。","type":"medical","meaning_category":"奇形に関する"}]}