{"word":"enturbiamiento","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"濁り、混濁、混乱、不明瞭化","english_definition":"The act or effect of making something turbid, muddy, or unclear; clouding, muddling, or obscuring.","examples":[{"sentence":"El enturbiamiento del agua del río fue causado por las fuertes lluvias.","translation":"川の水の濁りは、大雨によって引き起こされた。","context":"Literal turbidity of water."},{"sentence":"El enturbiamiento de la situación política preocupa a los ciudadanos.","translation":"政治状況の混乱は、市民を不安にさせている。","context":"Figurative use regarding a confused or unclear situation."},{"sentence":"Se produjo un enturbiamiento de las relaciones diplomáticas entre ambos países.","translation":"両国間の外交関係の不明瞭化が生じた。","context":"Figurative use regarding strained or unclear diplomatic relations."}],"collocations":["enturbiamiento del agua (水の濁り)","enturbiamiento de la situación (状況の混乱)","enturbiamiento de las relaciones (関係の不明瞭化)"],"synonyms":["turbidez (濁り)","confusión (混乱)","oscurecimiento (不明瞭化)","complicación (複雑化)"],"antonyms":["claridad (明瞭さ)","transparencia (透明性)","limpieza (清潔さ)","orden (秩序)"]}],"etymology":{"value":"Derivado del verbo \"enturbiar\" (濁らせる、混乱させる) + el sufijo \"-miento\" (～すること、～の状態). \"Enturbiar\" proviene de \"turbio\" (濁った、混乱した), que a su vez tiene origen incierto, posiblemente del latín \"turbidus\".","priority":"N/A"},"pronunciation":{"ipa":"/en.tuɾ.βjaˈmjen.to/","syllables":"en-tur-bia-mien-to"},"inflection":{"gender":"masculine","number":"singular"},"usage_notes":{"explanation":"\"Enturbiamiento\" se utiliza tanto en sentido literal para describir la turbidez del agua u otros líquidos, como en sentido figurado para referirse a la confusión, complicación o falta de claridad en situaciones, relaciones, o procesos. Implica una pérdida de transparencia o entendimiento.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"El enturbiamiento de la agua.","correct":"El enturbiamiento del agua.","note":"\"Agua\" es un sustantivo femenino, pero por razones fonéticas se usa el artículo masculino \"el\" en singular. Por lo tanto, la forma correcta es \"el agua\" y \"del agua\"."}],"priority":"N/A"},"related_words":{"derivatives":["enturbiar (濁らせる、混乱させる)","turbio (濁った、混乱した)","turbidez (濁り、混乱)"]},"level_frequency":{"frequency_corpus":"Relativamente bajo. Se usa más en contextos formales o técnicos.","priority":"N/A"},"readability_explanation":{"level":"B2-C1","text":"\"Enturbiamiento\" es una palabra relativamente formal que se utiliza para describir el proceso o el resultado de hacer algo turbio o confuso. Puede referirse a la turbidez literal del agua, pero también se usa comúnmente en un sentido figurado para describir situaciones políticas, económicas o sociales que se vuelven confusas, complicadas o poco claras. Es importante entender el contexto para determinar si se está utilizando en un sentido literal o figurado."},"example_sentences":[{"sentence":"El informe denuncia el enturbiamiento de las cuentas públicas.","translation":"その報告書は、公的会計の混乱を非難している。","type":"noun","meaning_category":"混乱"},{"sentence":"El exceso de sedimentos causó el enturbiamiento del lago.","translation":"過剰な堆積物が湖の濁りを引き起こした。","type":"noun","meaning_category":"濁り"}]}