{"word":"Lamaze","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ラマーズ法（無痛分娩法の一種）","english_definition":"A method of childbirth involving psychological and physical preparation by the prospective mother, with the object of reducing the need for painkilling drugs.","examples":[{"sentence":"She attended Lamaze classes to prepare for the birth of her baby.","translation":"彼女は赤ちゃんの出産に備えてラマーズ教室に通った。"},{"sentence":"The hospital offers Lamaze classes for expectant parents.","translation":"その病院では、出産を控えた両親のためにラマーズ教室を提供している。"}],"collocations":["Lamaze class","Lamaze method","attend Lamaze","Lamaze technique"],"synonyms":["prepared childbirth","natural childbirth"],"antonyms":["medicated childbirth"]},{"part_of_speech":"adjective","definition":"ラマーズ法に関する","english_definition":"Relating to the Lamaze method of childbirth.","examples":[{"sentence":"She practiced Lamaze breathing techniques during labor.","translation":"彼女は陣痛中にラマーズ呼吸法を練習した。"},{"sentence":"The Lamaze philosophy emphasizes the woman's confidence in her ability to give birth.","translation":"ラマーズ法の哲学は、女性が出産する能力に対する自信を強調している。"}],"collocations":["Lamaze breathing","Lamaze philosophy","Lamaze techniques"],"synonyms":[]}],"etymology":{"value":"Named after Fernand Lamaze, a French obstetrician who popularized the method in the West after observing its use in the Soviet Union.","priority":"★★★"},"pronunciation":{"ipa":"/ləˈmɑːz/","syllables":"La-maze"},"inflection":{"notes":"It is a proper noun, so it does not have a plural form in the traditional sense. However, you might say 'Lamaze methods' or 'Lamaze techniques' to refer to different aspects of the method."},"usage_notes":{"explanation":"Lamaze is a specific method of prepared childbirth that focuses on breathing techniques, relaxation, and education to manage pain and anxiety during labor. It emphasizes the woman's confidence in her body's ability to give birth naturally, reducing the reliance on medical interventions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to do Lamaze for my baby.","correct":"✓ I'm going to take Lamaze classes to prepare for my baby's birth.","note":"You 'take Lamaze classes' or 'use the Lamaze method,' not 'do Lamaze.'"},{"incorrect":"✗ Lamaze is only about breathing.","correct":"✓ Lamaze involves breathing techniques, relaxation, and education.","note":"While breathing is a key component, Lamaze also includes relaxation techniques, education about the birthing process, and support from a partner or doula."}],"priority":"★★☆"},"related_words":{"derivatives":["Lamaze instructor","Lamaze International"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (in contexts related to childbirth and parenting)","frequency_google_ngram":"Relatively low frequency, primarily used in contexts related to childbirth.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Lamaze' refers to a specific method of childbirth preparation. It's not a commonly used word outside of discussions about pregnancy, childbirth, and parenting. Understanding the term implies a certain level of familiarity with these topics. It's more likely to be encountered in books, articles, or conversations related to childbirth education.","priority":"★★☆"},"example_sentences":[{"sentence":"She learned various breathing exercises in her **Lamaze** class.","translation":"彼女はラマーズ教室で様々な呼吸法を学んだ。","type":"noun","meaning_category":"ラマーズ法"},{"sentence":"The couple decided to use the **Lamaze** method for a more natural birth experience.","translation":"その夫婦は、より自然な出産体験のためにラマーズ法を使うことに決めた。","type":"noun","meaning_category":"ラマーズ法"},{"sentence":"Her **Lamaze** training helped her manage the pain of labor without medication.","translation":"彼女のラマーズ法のトレーニングは、薬を使わずに陣痛の痛みを管理するのに役立った。","type":"adjective","meaning_category":"ラマーズ法に関する"}]}