{"word":"uncommunicatively","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"非社交的に、打ち解けずに、口下手な様子で、コミュニケーションを取ろうとしない様子で","english_definition":"in a way that shows an unwillingness to communicate or share information; in a reserved or taciturn manner.","examples":[{"sentence":"He sat uncommunicatively in the corner, refusing to join the conversation.","translation":"彼は隅に打ち解けずに座り、会話に参加することを拒否した。"},{"sentence":"She answered the questions uncommunicatively, giving only the bare minimum of information.","translation":"彼女は質問に口下手に応じ、必要最低限の情報しか与えなかった。"},{"sentence":"The suspect remained uncommunicatively silent during the interrogation.","translation":"容疑者は尋問中、非社交的に黙秘を続けた。"}],"collocations":["sit uncommunicatively","answer uncommunicatively","remain uncommunicatively silent"],"synonyms":["taciturnly","reticently","reservedly","secretively","quietly","tersely","curtly"],"antonyms":["communicatively","openly","forthrightly","candidly","expressively","sociably"]}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (not) and the suffix '-ly' (in a manner) to the word 'communicative'. 'Communicative' itself comes from 'communicate', which originates from the Latin word 'communicare' meaning 'to share, impart, make common'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnkəˈmjuːnɪkətɪvli/","syllables":"un-com-mu-ni-ca-tive-ly"},"inflection":{"notes":"This is an adverb, so it does not have different forms for gender or number."},"usage_notes":{"explanation":"'Uncommunicatively' describes the manner in which someone acts or speaks when they are unwilling or unable to communicate effectively or openly. It suggests a lack of sociability and a reluctance to share thoughts or feelings. The word emphasizes the absence of communication rather than active resistance to it. It is often used to describe someone's behavior in social situations, interviews, or interrogations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted uncommunicative.","correct":"✓ He acted uncommunicatively.","note":"'Uncommunicative' is an adjective, while 'uncommunicatively' is an adverb. Use the adverb to describe how someone acts."},{"incorrect":"✗ She was uncommunicatively because she was shy.","correct":"✓ She was uncommunicative because she was shy.","note":"'Uncommunicative' is the adjective to describe her state of being. 'Uncommunicatively' describes the manner in which she does something."}],"priority":"★★☆"},"related_words":{"derivatives":["uncommunicative (adjective)","communicate (verb)","communication (noun)"],"phrasal_verbs":[],"related_adverbs":["communicatively","openly","expressively","forthrightly"],"related_nouns":["reticence","taciturnity","reserve"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'uncommunicatively' is an advanced term used to describe someone's behavior when they are unwilling to share information or engage in conversation. It is often used in formal writing or speech to describe a person who is reserved, taciturn, or secretive. Understanding this word requires a strong grasp of vocabulary and the ability to recognize subtle nuances in meaning. It is not commonly used in everyday conversation, making it more suitable for advanced learners of English."},"example_sentences":[{"sentence":"The witness answered the lawyer's questions uncommunicatively, providing only brief and vague responses.","translation":"証人は弁護士の質問に非社交的に答え、簡潔で曖昧な返答しか提供しなかった。","type":"adverb","meaning_category":"manner of answering"},{"sentence":"Despite repeated attempts to engage him, he remained uncommunicatively silent throughout the meeting.","translation":"彼と話そうと何度も試みたにもかかわらず、彼は会議中ずっと打ち解けずに黙っていた。","type":"adverb","meaning_category":"manner of remaining silent"},{"sentence":"She stared out the window uncommunicatively, lost in her own thoughts.","translation":"彼女は窓の外を非社交的に見つめ、自分の考えにふけっていた。","type":"adverb","meaning_category":"manner of staring"}]}