{"word":"goosishly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"アホらしく、間抜けな様子で、ガチョウのように","english_definition":"In a silly, foolish, or goose-like manner.","examples":[{"sentence":"He giggled goosishly at her joke.","translation":"彼は彼女の冗談にアホらしく笑った。"},{"sentence":"She blushed goosishly when he complimented her.","translation":"彼が彼女を褒めると、彼女は間抜けな様子で赤面した。"}],"collocations":["giggle goosishly","blush goosishly","smile goosishly"],"synonyms":["foolishly","silly","inanely","absurdly"],"antonyms":["seriously","sensibly","intelligently"]}],"etymology":{"value":"Derived from the adjective 'goosish,' which means resembling a goose in some way, especially in silliness or foolishness. The suffix '-ly' turns it into an adverb.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡuːsɪʃli/","syllables":"goo-sish-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"The adverb 'goosishly' describes an action or behavior performed in a silly, foolish, or goose-like manner. It often implies a lack of seriousness or intelligence. The term is not commonly used in formal contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She acted goosishly, but she was very intelligent.","correct":"✓ She acted goosishly, even though she was very intelligent.","note":"'Goosishly' implies a lack of intelligence or seriousness, so it contrasts with being intelligent. Use a conjunction like 'even though' to show the contrast."}],"priority":"★★☆"},"related_words":{"derivatives":["goose (noun)","goosish (adjective)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Rare)","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'goosishly' is a rare and somewhat whimsical term used to describe behavior that is silly or foolish, reminiscent of the perceived behavior of a goose. Because of its rarity and specific connotation, it is most likely to be encountered in advanced literary contexts or humorous writing where the author aims for a particular effect. Understanding the base word 'goose' and the suffix '-ish' helps in deciphering its meaning, but its infrequent usage makes it a less common word for general vocabulary acquisition."},"example_sentences":[{"sentence":"He waved his arms goosishly, trying to imitate a bird.","translation":"彼は鳥の真似をしようと、ガチョウのように腕を振った。","type":"adverb","meaning_category":"foolishly"},{"sentence":"She smiled goosishly at the handsome stranger.","translation":"彼女はハンサムな見知らぬ人に、間抜けな様子で微笑んだ。","type":"adverb","meaning_category":"silly"}]}