{"word":"tetartohedral","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(結晶学で)四分半面像の、四分半面晶族に属する","english_definition":"(crystallography) Belonging to a crystal class having only one quarter of the full set of symmetry elements possible for that crystal system.","examples":[{"sentence":"Tetartohedral crystals lack a center of symmetry and have only rotational symmetry elements.","translation":"四分半面像の結晶は対称の中心を欠き、回転対称要素のみを有する。"}],"collocations":["tetartohedral class","tetartohedral symmetry"],"synonyms":["hemihedral","enantiomorphic"],"antonyms":["holohedral"]},{"part_of_speech":"noun","definition":"(結晶学で)四分半面晶族","english_definition":"(crystallography) A crystal class having only one quarter of the full set of symmetry elements possible for that crystal system.","examples":[{"sentence":"The tetartohedral class is a subgroup of the hemihedral class.","translation":"四分半面晶族は半面像晶族の下位群である。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Greek 'tetartos' (fourth) + 'hedron' (face) + '-al'. Refers to crystals exhibiting only one-fourth of the possible faces due to symmetry restrictions.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɛtɑːrtoʊˈhiːdrəl/","syllables":"te-tar-to-he-dral"},"inflection":{"notes":"Adjective: tetartohedral; Noun: tetartohedral class"},"usage_notes":{"explanation":"The term 'tetartohedral' is highly specialized and used almost exclusively within the field of crystallography to describe crystal systems with specific symmetry properties. It indicates a crystal class that possesses only a quarter of the symmetry elements expected for its crystal system. This often results in crystals that are chiral, meaning they are non-superimposable on their mirror image.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The crystal is tetartohedral because it is small.","correct":"✓ The crystal is tetartohedral because it lacks certain symmetry elements.","note":"Size is not a determining factor for tetartohedral symmetry; it is based on the absence of specific symmetry elements."}],"priority":"★★☆"},"related_words":{"derivatives":["tetartohedrally"],"phrasal_verbs":[],"related_terms":["hemihedral","holohedral","crystal system","symmetry element","enantiomorphism"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency - almost exclusively used in crystallography texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tetartohedral' is a highly technical term used in crystallography. It describes crystal structures that exhibit only one-fourth of the possible symmetry elements for their crystal system. This means they lack certain symmetry operations like mirror planes, inversion centers, or rotation axes that would be present in crystals with higher symmetry. The concept is complex and requires a strong understanding of crystallography and symmetry principles."},"example_sentences":[{"sentence":"Quartz can sometimes exhibit tetartohedral forms.","translation":"石英は時々、四分半面像を示すことがある。","type":"adjective","meaning_category":"crystallography"},{"sentence":"The identification of tetartohedral symmetry is crucial for understanding the crystal's physical properties.","translation":"四分半面像の対称性の識別は、結晶の物理的特性を理解する上で重要である。","type":"adjective","meaning_category":"crystallography"}]}