{"word":"charkhana","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A workshop or factory, especially in South Asia, where textiles or other goods are produced, often involving manual labor.","english_definition":"A workshop or factory, especially in South Asia, where textiles or other goods are produced, often involving manual labor.","examples":[{"sentence":"The charkhana was filled with the sounds of looms and the chatter of workers.","translation":"そのチャルカナは、織機の音と労働者のおしゃべりで満たされていた。"},{"sentence":"Many families in the village depended on the charkhana for their livelihood.","translation":"村の多くの家族は、生活のためにチャルカナに頼っていた。"}],"collocations":["operate a charkhana","work in a charkhana","textile charkhana","traditional charkhana"],"synonyms":["workshop","factory","mill","atelier"],"antonyms":[]}],"etymology":{"value":"The word 'charkhana' is derived from the Persian word 'charkh' meaning 'wheel' or 'spinning wheel' and 'khana' meaning 'house' or 'place'. It refers to a place where spinning wheels or other machinery are used for production.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtʃɑːrˈkɑːnə/","syllables":"char-kha-na"},"inflection":{"noun_plural":"charkhanas"},"usage_notes":{"explanation":"The term 'charkhana' is primarily used in South Asian contexts to describe a traditional workshop or small factory, particularly those involved in textile production. It often implies a setting with manual labor and traditional methods.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The charkhana is a modern automated factory.","correct":"✓ The charkhana is a traditional workshop with manual labor.","note":"'Charkhana' typically refers to a traditional, often manual workshop, not a modern automated factory."}],"priority":"★★☆"},"related_words":{"derivatives":["charkha (spinning wheel)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'charkhana' is a specialized term primarily used in South Asian contexts to refer to a traditional workshop or factory, often for textile production. It is not commonly used in general English and may require explanation for those unfamiliar with South Asian culture and industry."},"example_sentences":[{"sentence":"The artisan proudly displayed his work from the family's charkhana.","translation":"職人は、家族のチャルカナで作られた作品を誇らしげに展示した。","type":"noun","meaning_category":"workshop"},{"sentence":"The charkhana provided employment for many women in the rural community.","translation":"そのチャルカナは、農村コミュニティの多くの女性に雇用を提供した。","type":"noun","meaning_category":"factory"}]}