{"word":"Germanomania","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ドイツかぶれ、ドイツ趣味、ドイツ熱","english_definition":"An excessive enthusiasm for or infatuation with German culture, language, or customs.","examples":[{"sentence":"His Germanomania led him to study in Berlin and immerse himself in German literature.","translation":"彼のドイツかぶれは、彼をベルリンでの留学とドイツ文学への没頭へと導いた。"},{"sentence":"The wave of Germanomania swept through the art world, influencing many painters and sculptors.","translation":"ドイツ趣味の波が美術界を席巻し、多くの画家や彫刻家に影響を与えた。"}],"collocations":["catch Germanomania (ドイツかぶれになる)","suffer from Germanomania (ドイツかぶれに苦しむ)","a case of Germanomania (ドイツかぶれの事例)"],"synonyms":["Teutonism","Germanophilia"],"antonyms":["Germanophobia"],"notes":"Often used in a historical context, especially regarding the 19th and early 20th centuries."}],"etymology":{"value":"Formed from \"Germano-\" (combining form relating to Germany or Germans) + \"-mania\" (denoting obsession or enthusiasm).","priority":"★★★"},"pronunciation":{"ipa":"/ˌdʒɜːrmənoʊˈmeɪniə/","syllables":"Ger-ma-no-ma-ni-a"},"inflection":{"noun_plural":"Germanomanias"},"usage_notes":{"explanation":"\"Germanomania\" describes an intense interest in German culture. It can range from a simple appreciation to an almost obsessive fascination. The term is not always used positively; it can sometimes imply that someone is excessively or uncritically enthusiastic about all things German.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a Germanomania for French films.","correct":"✓ He has a Germanomania for German films.","note":"Germanomania is specifically about enthusiasm for German culture, not other cultures."}],"priority":"★★☆"},"related_words":{"derivatives":["Germanomaniac (noun: ドイツかぶれの人)"],"related_terms":["Anglomania (イギリスかぶれ)","Francophilia (フランスかぶれ)","Sinophilia (中国かぶれ)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in academic or historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Germanomania\" is a relatively uncommon word that refers to an excessive enthusiasm for German culture, language, or customs. It is often used in historical or academic contexts to describe a period or individual with a strong affinity for Germany. Understanding the word requires familiarity with the suffix \"-mania,\" which denotes obsession or enthusiasm."},"example_sentences":[{"sentence":"The professor's Germanomania was evident in his lectures on Romantic literature.","translation":"その教授のドイツかぶれは、ロマン派文学に関する講義で明らかだった。","type":"noun","meaning_category":"ドイツ趣味"},{"sentence":"During the 19th century, Germanomania influenced many aspects of British intellectual life.","translation":"19世紀の間、ドイツかぶれはイギリスの知的生活の多くの側面に影響を与えた。","type":"noun","meaning_category":"ドイツ熱"}]}