{"word":"partisanly","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"党派的に、偏って、一方的に","english_definition":"in a manner that is biased towards a particular political party, group, or cause; showing strong support for one side only.","examples":[{"sentence":"The issue was discussed partisanly, with each side refusing to compromise.","translation":"その問題は党派的に議論され、各陣営は妥協を拒否した。"},{"sentence":"The newspaper is known to report partisanly on political events.","translation":"その新聞は政治的な出来事を党派的に報道することで知られている。"},{"sentence":"He acted partisanly by only considering the views of his own party members.","translation":"彼は自分の党のメンバーの意見だけを考慮することで、党派的に行動した。"}],"collocations":["act partisanly","report partisanly","discuss partisanly","vote partisanly","behave partisanly"],"synonyms":["biasedly","prejudicially","partially","one-sidedly","factionally","sectarianly"],"antonyms":["impartially","objectively","neutrally","fairly","equitably"]}],"etymology":{"value":"The word 'partisanly' is derived from 'partisan' (adjective or noun), which comes from the Italian 'partigiano' meaning 'adherent, one belonging to a party.' The suffix '-ly' is added to form the adverb.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɑːrtɪzənli/","syllables":"par-ti-san-ly"},"inflection":{"notes":"As an adverb, 'partisanly' does not have different forms for tense or number."},"usage_notes":{"explanation":"'Partisanly' describes actions, reports, or discussions that are heavily influenced by a specific political party or group, often to the exclusion of other viewpoints. It implies a lack of objectivity and a strong bias towards one side of an issue. The term is often used in political contexts to criticize or describe behavior that favors a particular party or ideology.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He partisanly supported all the candidates.","correct":"✓ He supported all the candidates in a partisan manner. / ✓ He partisanly supported the candidates from his party.","note":"'Partisanly' implies support for one side only. Supporting all candidates is not partisan. To convey partisan support, specify that the support is only for candidates from a particular party."},{"incorrect":"✗ The judge acted partisanly and fairly.","correct":"✓ The judge acted partisanly and unfairly.","note":"'Partisanly' and 'fairly' are antonyms. Partisan behavior is inherently unfair."}],"priority":"★★☆"},"related_words":{"derivatives":["partisan (noun, adjective)","partisanship (noun)"],"phrasal_verbs":[],"related_concepts":["ideology","political bias","factionalism","sectarianism"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, primarily used in formal or political contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'partisanly' is used to describe actions or statements that are strongly biased towards a particular political party or group. It suggests a lack of objectivity and an unwillingness to consider other viewpoints. This word is most commonly found in discussions of politics, media, and social issues, where bias and impartiality are key concerns. Understanding this word helps in analyzing and critiquing information presented in a biased manner.","priority":"★★★"},"example_sentences":[{"sentence":"The debate was conducted so partisanly that no common ground could be found.","translation":"その討論は非常に党派的に行われたため、共通の基盤を見つけることができなかった。","type":"general","meaning_category":"biased manner"},{"sentence":"The news channel reported partisanly on the election, favoring one candidate over the others.","translation":"そのニュースチャンネルは選挙を党派的に報道し、ある候補者を他の候補者よりも優遇した。","type":"media","meaning_category":"biased reporting"},{"sentence":"The committee members voted partisanly along party lines.","translation":"委員会のメンバーは党派的に党の方針に沿って投票した。","type":"politics","meaning_category":"biased voting"}]}