{"word":"mechanoreceptive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"機械受容性の、機械的刺激を受容する","english_definition":"Capable of responding to mechanical stimuli, such as touch, pressure, sound waves, and stretching.","examples":[{"sentence":"Mechanoreceptive neurons in the skin detect pressure and vibration.","translation":"皮膚の機械受容性ニューロンは、圧力と振動を検出します。"},{"sentence":"Hair cells in the inner ear are mechanoreceptive, transducing sound waves into electrical signals.","translation":"内耳の有毛細胞は機械受容性であり、音波を電気信号に変換します。"}],"collocations":["mechanoreceptive neuron","mechanoreceptive cell","mechanoreceptive afferent"],"synonyms":["mechanosensitive","pressure-sensitive","touch-sensitive"],"antonyms":[]}],"etymology":{"value":"Derived from 'mechano-' (referring to mechanics or mechanical stimuli) and 'receptive' (capable of receiving or responding to stimuli).","priority":"★★★"},"pronunciation":{"ipa":"/məˌkænəˌriˈseptɪv/","syllables":"me-chan-o-re-cep-tive"},"inflection":{"notes":"Does not inflect (only used as an adjective)."},"usage_notes":{"explanation":"'Mechanoreceptive' describes cells, neurons, or structures that are specialized to detect and respond to mechanical forces or stimuli. These stimuli can include touch, pressure, vibration, stretching, and sound waves. The term is commonly used in the fields of biology, neuroscience, and physiology.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant has mechanoreception abilities.","correct":"✓ The plant has mechanoreceptive abilities.","note":"'Mechanoreception' is the noun referring to the sense, while 'mechanoreceptive' is the adjective describing the cells or structures involved."}],"priority":"★★☆"},"related_words":{"derivatives":["mechanoreceptor (noun): A sensory receptor that responds to mechanical pressure or distortion.","mechanoreception (noun): The reception of mechanical stimuli by sensory receptors."],"related_terms":["somatosensory","haptic","auditory","vestibular"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency (specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mechanoreceptive' is a technical term used in biology and neuroscience to describe something that can sense mechanical stimuli like touch, pressure, or sound. It's often used to describe specific cells or neurons in the body. If you're not studying these fields, you probably won't encounter this word often."},"example_sentences":[{"sentence":"The Pacinian corpuscles are **mechanoreceptive** structures that respond to deep pressure and vibration.","translation":"パチニ小体は、深部の圧力と振動に応答する機械受容性構造です。","type":"adjective","meaning_category":"mechanical stimuli"},{"sentence":"Studies show that **mechanoreceptive** afferents play a crucial role in tactile perception.","translation":"研究によると、機械受容性求心性神経は触覚認識において重要な役割を果たしています。","type":"adjective","meaning_category":"mechanical stimuli"}]}