{"word":"Sivaism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"シヴァ派：ヒンドゥー教の主要な宗派の一つで、シヴァ神を至高の神として崇拝する。","english_definition":"A major tradition within Hinduism that reveres Shiva as the Supreme Being.","examples":[{"sentence":"Sivaism is one of the oldest and most influential traditions within Hinduism.","translation":"シヴァ派は、ヒンドゥー教の中で最も古く、最も影響力のある伝統の一つです。"},{"sentence":"Followers of Sivaism often wear a tripundra, three horizontal lines of sacred ash on their foreheads.","translation":"シヴァ派の信者は、額に聖灰で描かれた三本の横線、トリプンドラを身につけることが多いです。"},{"sentence":"Many ancient temples in South India are dedicated to Shiva and are important pilgrimage sites for those practicing Sivaism.","translation":"南インドの多くの古代寺院はシヴァ神に捧げられており、シヴァ派を信仰する人々にとって重要な巡礼地となっています。"}],"collocations":["practice Sivaism (シヴァ派を信仰する)","followers of Sivaism (シヴァ派の信者)","Sivaism tradition (シヴァ派の伝統)","Sivaism philosophy (シヴァ派の哲学)"],"synonyms":["Shaivism"],"antonyms":[]},{"part_of_speech":"noun","definition":"シヴァ信仰、シヴァ崇拝","english_definition":"The worship of Shiva.","examples":[{"sentence":"Sivaism emphasizes the importance of devotion and asceticism.","translation":"シヴァ信仰は、献身と禁欲の重要性を強調しています。"},{"sentence":"Through Sivaism, devotees seek liberation (moksha) by realizing their unity with Shiva.","translation":"シヴァ信仰を通して、信者はシヴァ神との一体性を悟ることによって解脱（モクシャ）を求めます。"}],"collocations":["path of Sivaism (シヴァ信仰の道)","principles of Sivaism (シヴァ信仰の原則)"],"synonyms":["Shiva worship"],"antonyms":[]}],"etymology":{"value":"The term \"Sivaism\" is derived from \"Shiva,\" the name of the Hindu deity, and the suffix \"-ism,\" which denotes a doctrine, practice, or system of beliefs.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃɪvəˌɪzəm/","syllables":"Shi-va-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Sivaism\" (also spelled Shaivism) refers to the religious tradition within Hinduism that considers Shiva as the Supreme God. It encompasses a wide range of philosophical schools, devotional practices, and ritual traditions. Followers of Sivaism, known as Shaivas, may worship Shiva in various forms, including the lingam (a symbolic representation of Shiva), as well as through iconic representations. Sivaism is particularly prominent in South India, but it has adherents throughout the Indian subcontinent and beyond.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Sivaism is a god.","correct":"✓ Sivaism is a religion or a tradition.","note":"Sivaism is a religion or a tradition, not a god. Shiva is the god worshipped in Sivaism."},{"incorrect":"✗ Sivaism only exists in India now.","correct":"✓ Sivaism is primarily practiced in India, but has followers worldwide.","note":"While primarily practiced in India, Sivaism has spread globally."}],"priority":"★★☆"},"related_words":{"derivatives":["Shaiva (noun: a follower of Sivaism; adjective: relating to Sivaism)","Shaivism (alternative spelling of Sivaism)","Shiva (the deity)","lingam (a symbolic representation of Shiva)","tripundra (three horizontal lines of sacred ash worn by Shaivas)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"relatively low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Sivaism\" is a term referring to the Hindu tradition centered on the worship of Shiva as the supreme deity. Understanding this term requires familiarity with Hinduism and its various denominations. It's often discussed in the context of comparative religion, religious studies, and South Asian history. The term is not commonly used in everyday conversation but is important for academic and religious discourse."},"example_sentences":[{"sentence":"The philosophy of Sivaism emphasizes the unity of the individual soul with the divine.","translation":"シヴァ派の哲学は、個人の魂と神との一体性を強調しています。","type":"general","meaning_category":"シヴァ派の教義"},{"sentence":"Ancient texts provide insights into the rituals and beliefs of early Sivaism.","translation":"古代の文献は、初期のシヴァ信仰の儀式や信念に関する洞察を提供します。","type":"historical","meaning_category":"シヴァ派の歴史"},{"sentence":"Many forms of yoga and meditation are practiced within the context of Sivaism to achieve spiritual realization.","translation":"多くのヨガや瞑想の形態は、霊的な悟りを達成するためにシヴァ派の文脈の中で実践されています。","type":"practice","meaning_category":"シヴァ派の実践"}]}