{"word":"nominally","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"名目上は、表面的には、建前上は","english_definition":"in name only; formally but not in reality.","examples":[{"sentence":"He was nominally in charge, but she did all the work.","translation":"彼は名目上は責任者だったが、彼女がすべての仕事をしていた。"},{"sentence":"The country is nominally independent, but in reality, it's controlled by a foreign power.","translation":"その国は名目上は独立しているが、実際には外国の勢力に支配されている。"},{"sentence":"She's nominally a member of the committee, but she never attends the meetings.","translation":"彼女は名目上は委員会のメンバーだが、一度も会議に出席しない。"}],"collocations":["nominally independent","nominally in charge","nominally responsible","nominally a member","nominally owned"],"synonyms":["formally","officially","ostensibly","allegedly","superficially","theoretically"],"antonyms":["actually","really","truly","genuinely","effectively","practically"]}],"etymology":{"value":"From \"nominal\" + \"-ly\". \"Nominal\" comes from Latin \"nominalis\", from \"nomen\" (name).","priority":"★★★"},"pronunciation":{"ipa":"/ˈnɒmɪnəli/","syllables":"nom-i-nal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"\"Nominally\" indicates a discrepancy between what is claimed or appears to be the case and what is actually true. It suggests that something exists or is true in name only, without possessing the real qualities or exercising the real power associated with that name. It is often used to express skepticism or to highlight a lack of genuine substance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was nominally rich, but he had a lot of money.","correct":"✓ He was nominally rich, but he had no actual assets.","note":"\"Nominally rich\" suggests someone who appears to be rich but lacks real wealth. The incorrect sentence contradicts this meaning."},{"incorrect":"✗ She was nominally the best student, because she studied hard.","correct":"✓ She was supposedly the best student, but her grades were average.","note":"\"Nominally the best\" implies that she's called the best, but not actually the best. The incorrect sentence provides a reason why she *is* the best, contradicting the meaning of \"nominally\"."}],"priority":"★★☆"},"related_words":{"derivatives":["nominal (adjective)","nominate (verb)","nomination (noun)"],"related_concepts":["title","designation","appearance vs. reality","facade"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent but used in formal contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word \"nominally\" means \"in name only\" or \"officially, but not in reality.\" It's used to show that something is true in a formal or stated way, but not necessarily in practice. This word is more common in formal writing and speech, and it requires a good understanding of abstract concepts. It's not a word you'd typically encounter in everyday conversation, making it a more advanced vocabulary item."},"example_sentences":[{"sentence":"The project was nominally a success, but the results were disappointing.","translation":"そのプロジェクトは名目上は成功だったが、結果は期待外れだった。","type":"general","meaning_category":"表面的には"},{"sentence":"He is nominally the CEO, but the board makes all the decisions.","translation":"彼は名目上はCEOだが、すべての決定は取締役会が行う。","type":"general","meaning_category":"名目上は"},{"sentence":"The country is nominally a democracy, but elections are rigged.","translation":"その国は名目上は民主主義国家だが、選挙は不正操作されている。","type":"political","meaning_category":"建前上は"}]}