{"word":"innovators","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"革新者、改革者、刷新者","english_definition":"People who introduce new ideas, methods, or products.","examples":[{"sentence":"The company is looking for innovators to help develop new products.","translation":"その会社は、新製品の開発を支援する革新者を求めています。"},{"sentence":"He is considered one of the great innovators in the field of medicine.","translation":"彼は医学分野における偉大な革新者の一人と考えられています。"},{"sentence":"Innovators often challenge traditional ways of thinking.","translation":"革新者はしばしば伝統的な考え方に挑戦します。"}],"collocations":["leading innovators (主導的な革新者)","key innovators (主要な革新者)","social innovators (社会的な革新者)","technological innovators (技術的な革新者)"],"synonyms":["pioneers","trailblazers","visionaries","reformers","revolutionaries"],"antonyms":["followers","traditionalists","conservatives","imitators"]}],"etymology":{"value":"The word \"innovator\" comes from the Latin word \"innovare,\" meaning \"to renew or alter.\" It is formed by combining \"in-\" (into) and \"novare\" (to make new), which is derived from \"novus\" (new).","priority":"★★★"},"pronunciation":{"ipa":"ˈɪnəveɪtərz","syllables":"in-no-va-tors"},"inflection":{"noun_plural":"innovators","noun_singular":"innovator"},"usage_notes":{"explanation":"\"Innovators\" refers to individuals or groups who introduce something new, whether it's a product, a method, or an idea. They are often associated with creativity, risk-taking, and a willingness to challenge the status quo. The term is commonly used in business, technology, and social contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"She is a innovator in her field.","correct":"She is an innovator in her field.","note":"Use \"an\" before \"innovator\" because it begins with a vowel sound."},{"incorrect":"The innovators was praised for their work.","correct":"The innovators were praised for their work.","note":"\"Innovators\" is plural, so use the plural verb \"were.\""}],"priority":"★★☆"},"related_words":{"derivatives":["innovate (verb: 革新する)","innovation (noun: 革新)","innovative (adjective: 革新的な)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively frequent, especially in business and technology contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"\"Innovators\" are people who come up with new ideas, methods, or products that change the way things are done. They are often creative and willing to take risks. This word is used when discussing advancements and progress in various fields, such as technology, business, and social issues. Understanding this word helps in comprehending discussions about new developments and improvements in society."},"example_sentences":[{"sentence":"These young **innovators** are changing the face of the tech industry.","translation":"これらの若い革新者たちは、テクノロジー業界の様相を変えつつあります。","type":"noun","meaning_category":"革新者"},{"sentence":"The company encourages its employees to be **innovators** and think outside the box.","translation":"その会社は、従業員が革新者となり、既成概念にとらわれずに考えることを奨励しています。","type":"noun","meaning_category":"革新者"},{"sentence":"**Innovators** often face resistance from those who are comfortable with the status quo.","translation":"革新者はしばしば現状に満足している人々からの抵抗に直面します。","type":"noun","meaning_category":"革新者"}]}