{"word":"Obmutescence","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"選択性緘黙（せんたくせいかんもく）","english_definition":"The complete cessation of speech, especially when caused by extreme emotional trauma or psychological distress; selective mutism.","examples":[{"sentence":"The child's obmutescence was a clear sign of the severe trauma they had experienced.","translation":"その子供の選択性緘黙は、彼らが経験した深刻なトラウマの明らかな兆候だった。"},{"sentence":"Obmutescence can be a symptom of various underlying psychological conditions.","translation":"選択性緘黙は、さまざまな潜在的な心理的状態の症状となりうる。"}],"collocations":["selective obmutescence","traumatic obmutescence","psychogenic obmutescence"],"synonyms":["mutism","selective mutism","aphasia (in some contexts)"],"antonyms":["loquacity","talkativeness","garrulity"]}],"etymology":{"value":"From Latin 'obmutescere', meaning 'to become mute, to be struck dumb'. 'Ob-' signifies 'in the way of, against', and 'mutescere' means 'to become mute'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒbmjuːˈtɛsns/","syllables":"ob-mu-tes-cence"},"inflection":{"noun_plural":"obmutescences"},"usage_notes":{"explanation":"'Obmutescence' is a relatively rare and formal term, often used in clinical or academic contexts to describe the condition of being mute, particularly when caused by psychological factors. It is often used interchangeably with 'selective mutism', although 'obmutescence' can sometimes imply a more complete or profound loss of speech.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He suffered from obmutescence after the accident, so he couldn't understand what people said.","correct":"✓ He suffered from obmutescence after the accident, so he couldn't speak.","note":"Obmutescence refers to the inability to speak, not the inability to understand speech. If the person cannot understand speech, aphasia or other language processing disorders might be more appropriate terms."}],"priority":"★☆☆"},"related_words":{"derivatives":["obmutescent (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Obmutescence' is a specialized term primarily used in medical and psychological contexts. It refers to a condition where a person becomes mute, often due to psychological trauma or distress. Due to its specific and technical nature, it is not commonly used in everyday conversation and is more likely to be encountered in academic or clinical settings. Understanding the term requires a good grasp of medical terminology and psychological concepts."},"example_sentences":[{"sentence":"The psychiatrist diagnosed the patient with obmutescence following the traumatic event.","translation":"精神科医は、その患者をトラウマとなる出来事の後に選択性緘黙と診断した。","type":"noun","meaning_category":"medical condition"},{"sentence":"Her obmutescence made it difficult for therapists to communicate with her initially.","translation":"彼女の選択性緘黙は、セラピストが最初彼女とコミュニケーションをとることを困難にした。","type":"noun","meaning_category":"symptom"},{"sentence":"The sudden obmutescence of the witness raised suspicions during the trial.","translation":"証人の突然の緘黙は、裁判中に疑念を生じさせた。","type":"noun","meaning_category":"behavioral response"}]}