{"word":"Puseyistical","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(歴史) プーシー主義の、プーシー主義者的な","english_definition":"Of or pertaining to Puseyism or its adherents.","examples":[{"sentence":"The Puseyistical movement sought to revive certain Catholic doctrines and rituals within the Church of England.","translation":"プーシー主義運動は、イングランド国教会内で特定のカトリック教義と儀式を復活させようとしました。"}],"collocations":["Puseyistical principles","Puseyistical practices","Puseyistical tendencies"],"synonyms":["High Church","Anglo-Catholic"],"antonyms":["Low Church","Evangelical"]},{"part_of_speech":"adjective","definition":"(軽蔑的) 儀式主義的な、形式主義的な","english_definition":"(derogatory) Excessively ritualistic or formalistic.","examples":[{"sentence":"His sermons were criticized for being overly Puseyistical and lacking in spiritual depth.","translation":"彼の説教は、儀式主義に走りすぎて精神的な深みに欠けると批判されました。"}],"collocations":["Puseyistical ceremonies","Puseyistical decorations","Puseyistical approach"],"synonyms":["ritualistic","formalistic","ceremonial"],"antonyms":["informal","unceremonious"]}],"etymology":{"value":"Named after Edward Bouverie Pusey (1800–1882), an English theologian and leader of the Oxford Movement, also known as Puseyism. The suffix '-istical' denotes 'relating to' or 'characteristic of'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpjuːziˈɪstɪkəl/","syllables":"Pu-sey-is-ti-cal"},"inflection":{"notes":"Adjectives do not typically inflect in English, though comparative and superlative forms exist (more Puseyistical, most Puseyistical)."},"usage_notes":{"explanation":"'Puseyistical' primarily refers to aspects related to Puseyism, a movement within the Church of England that sought to revive High Church or Anglo-Catholic principles. However, it can also be used, often pejoratively, to describe something excessively focused on ritual or formality, regardless of its connection to Puseyism. Context is crucial to understanding the intended meaning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Puseyistical church was built last year.","correct":"✓ The church with Puseyistical elements was built last year.","note":"While a church might exhibit Puseyistical characteristics, it's more accurate to say it has 'Puseyistical elements' or 'follows Puseyistical practices' rather than directly labeling the church as 'Puseyistical.'"},{"incorrect":"✗ He is a Puseyistical.","correct":"✓ He is a Puseyite.","note":"When referring to a person, the term 'Puseyite' is more common than 'Puseyistical person.'"}],"priority":"★★☆"},"related_words":{"derivatives":["Puseyism (名詞: プーシー主義)","Puseyite (名詞: プーシー主義者)"],"related_terms":["Oxford Movement","High Church","Anglo-Catholicism"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Very rare; historical/theological context)","frequency_google_ngram":"Extremely low.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Puseyistical' is a specialized term primarily used in historical or theological contexts to describe something related to Puseyism or the Oxford Movement within the Church of England. It can also be used, sometimes negatively, to describe something excessively ritualistic or formal. Due to its specific and often historical usage, it is not a commonly encountered word. Understanding requires familiarity with 19th-century religious history and theological debates within the Anglican Church."},"example_sentences":[{"sentence":"The historian described the church's architecture as having Puseyistical influences.","translation":"歴史家はその教会の建築様式をプーシー主義の影響を受けていると説明した。","type":"adjective","meaning_category":"プーシー主義の"},{"sentence":"Some critics viewed the new liturgical practices as overly Puseyistical.","translation":"一部の批評家は、新しい典礼慣行を過度に儀式主義的だと見なした。","type":"adjective","meaning_category":"儀式主義的な"}]}