{"word":"congelation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"凝固、凝結","english_definition":"The process of changing from a liquid or gaseous state to a solid state.","examples":[{"sentence":"The congelation of water into ice occurs at 0 degrees Celsius.","translation":"水の氷への凝固は摂氏0度で起こる。"},{"sentence":"The quick congelation of the metal allowed for a fine crystalline structure.","translation":"金属の急速な凝固により、微細な結晶構造が可能になった。"}],"collocations":["rapid congelation","slow congelation","congelation point","complete congelation"],"synonyms":["solidification","freezing","clotting","curdling"],"antonyms":["liquefaction","melting","fusion"]}],"etymology":{"value":"From Latin 'congelatio', from 'congelare' (to freeze together), from 'com-' (together) + 'gelare' (to freeze).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒndʒəˈleɪʃən/","syllables":"con-ge-la-tion"},"inflection":{"noun_plural":"congelations"},"usage_notes":{"explanation":"'Congelation' is a formal term primarily used in scientific or technical contexts to describe the process of a substance changing from a liquid or gaseous state into a solid state. It emphasizes the act of solidifying or freezing. While often interchangeable with 'freezing', 'congelation' tends to be used in more precise or technical discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The congelation was very cold.","correct":"The result of the congelation was very cold.","note":"'Congelation' refers to the process, not the resulting solid. To describe the solid, use terms like 'ice' or 'solidified substance'."}],"priority":"★☆☆"},"related_words":{"derivatives":["congeal (verb)","congealed (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific and technical writing.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Congelation' is a relatively uncommon and technical term referring to the process of a substance solidifying from a liquid or gaseous state. It is most often encountered in scientific or technical contexts. Understanding this word requires a strong vocabulary and familiarity with scientific concepts related to phase transitions."},"example_sentences":[{"sentence":"The experiment demonstrated the congelation of the solution at low temperatures.","translation":"その実験は、低温での溶液の凝固を示した。","type":"noun","meaning_category":"凝固"},{"sentence":"The rapid congelation process preserved the cellular structure of the sample.","translation":"急速な凝固プロセスは、サンプルの細胞構造を保存した。","type":"noun","meaning_category":"凝結"}]}