{"word":"Woodbridge","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(イギリスの)ウッドブリッジ (サフォーク州にある町)","english_definition":"A market town in Suffolk, England, known for its historic buildings, tidal mill, and scenic location on the River Deben.","examples":[{"sentence":"We visited Woodbridge on our trip to Suffolk.","translation":"私たちはサフォークへの旅行でウッドブリッジを訪れました。"},{"sentence":"Woodbridge is a charming town with a rich maritime history.","translation":"ウッドブリッジは豊かな海洋史を持つ魅力的な町です。"}],"collocations":["Woodbridge Tide Mill (ウッドブリッジ潮汐ミル)","River Deben (デベン川)","Suffolk Coast (サフォーク海岸)"],"synonyms":["None (Proper noun - place name)"],"antonyms":["None (Proper noun - place name)"]},{"part_of_speech":"noun","definition":"(アメリカの)ウッドブリッジ (ニュージャージー州、バージニア州、コネチカット州などにある地名)","english_definition":"A place name in the United States, including a township in New Jersey, a town in Virginia, and a neighborhood in Connecticut.","examples":[{"sentence":"Woodbridge, New Jersey, is a large and diverse township.","translation":"ニュージャージー州のウッドブリッジは、大規模で多様なタウンシップです。"},{"sentence":"We drove through Woodbridge, Virginia, on our way to Washington, D.C.","translation":"ワシントンD.C.へ向かう途中、バージニア州のウッドブリッジを通り過ぎました。"}],"collocations":["Woodbridge Township (ウッドブリッジ・タウンシップ)","Woodbridge, NJ (ニュージャージー州ウッドブリッジ)","Woodbridge, VA (バージニア州ウッドブリッジ)"],"synonyms":["None (Proper noun - place name)"],"antonyms":["None (Proper noun - place name)"]}],"etymology":{"value":"The name 'Woodbridge' likely originates from the Old English words 'wudu' (wood) and 'brycg' (bridge), referring to a wooden bridge that once existed in the area.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwʊdˌbɹɪdʒ/","syllables":"Wood-bridge"},"inflection":{"notes":"Proper noun - no plural form."},"usage_notes":{"explanation":"'Woodbridge' is primarily a place name. It refers to several locations, most notably a town in Suffolk, England, and a township in New Jersey, USA. When using the name, it's helpful to specify the location (e.g., Woodbridge, Suffolk; Woodbridge, NJ) to avoid ambiguity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to the Woodbridge next week.","correct":"✓ I am going to Woodbridge next week.","note":"'Woodbridge' is a proper noun and doesn't usually require an article ('the') unless referring to a specific institution or landmark within Woodbridge (e.g., 'the Woodbridge Tide Mill')."},{"incorrect":"✗ Woodbridges is a nice town.","correct":"✓ Woodbridge is a nice town.","note":"'Woodbridge' is a singular place name and does not have a plural form in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["Woodbridgian (adjective/noun: relating to or an inhabitant of Woodbridge)"],"idioms_phrases":["None (place name)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Proper noun)","frequency_google_ngram":"Relatively low frequency, but varies depending on the specific location being referenced.","priority":"★☆☆"},"readability_explanation":{"level":"N/A","text":"'Woodbridge' is a proper noun, specifically a place name. Its readability depends on the reader's familiarity with the location being discussed. If the context makes the location clear (e.g., 'a trip to Suffolk'), the name is easily understood. Otherwise, specifying the region or country is helpful for clarity."},"example_sentences":[{"sentence":"The train station in Woodbridge provides easy access to London.","translation":"ウッドブリッジの駅からはロンドンへのアクセスが簡単です。","type":"noun","meaning_category":"Place name (Suffolk, England)"},{"sentence":"Woodbridge offers a mix of urban and suburban living.","translation":"ウッドブリッジは都市型と郊外型の生活が混在しています。","type":"noun","meaning_category":"Place name (New Jersey, USA)"}]}