{"word":"Anaxagorize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(哲学)万物の根源を無限に分割可能な微小要素（種子、スペルマタ）であると説く","english_definition":"To interpret or explain in the manner of Anaxagoras; to attribute all change and diversity to the mixture and separation of pre-existing, infinitely divisible particles.","examples":[{"sentence":"He attempted to Anaxagorize the complex phenomena of the universe.","translation":"彼は宇宙の複雑な現象をアナクサゴラスのように解釈しようと試みた。"}],"collocations":[],"synonyms":["philosophize","interpret","explain"],"antonyms":[]}],"etymology":{"value":"Derived from the name of the ancient Greek philosopher Anaxagoras (c. 510 – 428 BC), who proposed that all things are composed of infinitely divisible particles called 'seeds' or 'spermata'.","priority":"★★★"},"pronunciation":{"ipa":"/əˈnæksəˈɡɔːraɪz/","syllables":"A-nax-a-go-rize"},"inflection":{"verb_forms":{"present_simple":["Anaxagorize","Anaxagorizes"],"past_simple":"Anaxagorized","past_participle":"Anaxagorized","present_participle":"Anaxagorizing"}},"usage_notes":{"explanation":"'Anaxagorize' is a relatively rare and technical term, mainly used in philosophical or historical contexts when discussing the theories of Anaxagoras or similar concepts of matter and change. It implies a specific approach to understanding the composition and transformations of the universe.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Anaxagorean (adjective, noun)","Anaxagoras"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Extremely rare.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Anaxagorize' is a highly specialized term primarily encountered in philosophical discussions related to pre-Socratic philosophy, specifically the ideas of Anaxagoras. Understanding requires familiarity with philosophical concepts and terminology. Its usage is confined to academic and scholarly contexts."},"example_sentences":[{"sentence":"Some modern physicists attempt to Anaxagorize quantum phenomena by positing ever-smaller subatomic particles.","translation":"現代の物理学者の中には、より小さな亜原子粒子を仮定することで、量子現象をアナクサゴラスのように解釈しようとする者もいる。","type":"verb","meaning_category":"philosophical interpretation"}]}