{"word":"Hypopoddia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A condition characterized by abnormally small feet.","english_definition":"A medical condition in which an individual has feet that are smaller than normal.","examples":[{"sentence":"The doctor diagnosed the infant with hypopoddia after noticing the disproportionately small size of their feet.","translation":"医師は、乳児の足が不均衡に小さいことに気づき、小足症と診断した。"},{"sentence":"Hypopoddia can sometimes be associated with other congenital abnormalities.","translation":"小足症は、他の先天性異常と関連している場合がある。"}],"collocations":["diagnose hypopoddia","associated with hypopoddia","congenital hypopoddia"],"synonyms":["micropodia"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'hypo' (meaning under or below) and 'pous, podos' (meaning foot).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpoʊˈpɒdiə/","syllables":"hy-po-pod-di-a"},"inflection":{"noun_plural":"hypopoddias"},"usage_notes":{"explanation":"Hypopoddia is a relatively rare medical term primarily used in clinical settings. It refers specifically to the condition of having abnormally small feet, often in relation to the overall body size. It is important to note that having small feet alone does not automatically indicate a medical issue; the condition is diagnosed based on a significant deviation from normal foot size for the individual's age and overall development.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The child's hands were hypopoddia.","correct":"✓ The child had hypopoddia, affecting their feet.","note":"Hypopoddia specifically refers to the feet, not the hands. If the hands are abnormally small, a different term would be used."},{"incorrect":"✗ She has hypopoddia, so she wears very small shoes.","correct":"✓ She has hypopoddia, which means she has abnormally small feet.","note":"While it's true that someone with hypopoddia may wear small shoes, the definition of hypopoddia is the condition of having small feet, not simply wearing small shoes."}],"priority":"★☆☆"},"related_words":{"derivatives":["hypopodic (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specialized medical term)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hypopoddia' is a specialized medical term referring to the condition of having abnormally small feet. It is primarily used in clinical or academic contexts related to medicine and genetics. Understanding this term requires familiarity with medical terminology and a high level of English proficiency. It is not commonly encountered in everyday language.","priority":"★☆☆"},"example_sentences":[{"sentence":"Further examination is needed to determine the cause of the patient's hypopoddia.","translation":"患者の小足症の原因を特定するためには、さらなる検査が必要です。","type":"medical","meaning_category":"small feet"},{"sentence":"Genetic testing was performed to see if hypopoddia was linked to any known syndromes.","translation":"小足症が既知の症候群に関連しているかどうかを確認するために、遺伝子検査が実施された。","type":"medical","meaning_category":"small feet"}]}