{"word":"trailingly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"後に引きずりながら、だらだらと、後退しながら","english_definition":"In a trailing manner; in a way that something is drawn or hangs loosely behind; in a receding or declining manner.","examples":[{"sentence":"The bride's veil flowed trailingly behind her as she walked down the aisle.","translation":"花嫁が通路を歩くにつれて、ベールが彼女の後ろにだらだらと流れました。"},{"sentence":"The company's profits are trailingly lower than last year's.","translation":"その会社の利益は、昨年よりもだらだらと減少しています。"},{"sentence":"He spoke trailingly, his voice fading as he finished his sentence.","translation":"彼は後に引きずるように話し、文を終えるにつれて声が小さくなっていきました。"}],"collocations":["trailingly behind","trailingly lower","trailingly off"],"synonyms":["loosely","recedingly","decliningly","languidly","danglingly","saggingly"],"antonyms":["leadingly","advancingly","progressively","directly"]}],"etymology":{"value":"Derived from the verb 'trail' (to draw or be drawn along behind) with the addition of the suffix '-ingly', which indicates a manner or way of doing something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtreɪlɪŋli/","syllables":"trail-ing-ly"},"inflection":{"notes":"Adverb, no comparative or superlative forms."},"usage_notes":{"explanation":"'Trailingly' describes an action or state where something is following behind or diminishing gradually. It often implies a lack of energy or a receding quality. The word is relatively uncommon.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She trailingly walked to the store.","correct":"✓ She walked trailing her scarf to the store.","note":"'Trailingly' describes *how* something is trailing, not how someone is walking. To describe her walk, use a different adverb or rephrase the sentence."},{"incorrect":"✗ The team was trailingly winning.","correct":"✓ The team was gradually winning.","note":"'Trailingly' implies a decline or recession, not a gradual increase or victory. Use 'gradually' or 'slowly' to describe a slow increase."}],"priority":"★☆☆"},"related_words":{"derivatives":["trail (verb, noun)","trailing (adjective)"],"phrasal_verbs":[],"related_adverbs":["slowly","gradually","loosely","languidly"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'trailingly' is a relatively uncommon adverb that describes something happening in a way that it is drawn or hangs loosely behind, or in a receding manner. It's often used to describe physical objects or abstract concepts that are diminishing or following behind. Because of its rarity, it's more likely to be encountered in advanced texts or specialized contexts."},"example_sentences":[{"sentence":"The ivy grew trailingly down the ancient stone wall.","translation":"ツタは古びた石壁をだらだらと垂れ下がって生えていました。","type":"adverb","meaning_category":"後に引きずりながら"},{"sentence":"His voice trailed off trailingly as he drifted to sleep.","translation":"眠りに落ちるにつれて、彼の声はだらだらと小さくなっていきました。","type":"adverb","meaning_category":"後退しながら"},{"sentence":"The sales figures are trailingly below expectations this quarter.","translation":"今四半期の売上高は、期待をだらだらと下回っています。","type":"adverb","meaning_category":"後退しながら"}]}