{"word":"counterradiation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"対放射、向かい放射","english_definition":"Radiation emitted by the atmosphere towards the Earth's surface.","examples":[{"sentence":"Counterradiation plays a crucial role in maintaining the Earth's temperature.","translation":"対放射は地球の温度を維持する上で重要な役割を果たしています。"},{"sentence":"The amount of counterradiation depends on the atmospheric conditions.","translation":"対放射の量は大気の状態に左右されます。"}],"collocations":["atmospheric counterradiation","longwave counterradiation"],"synonyms":["downward radiation","atmospheric back radiation"],"antonyms":["outgoing radiation","terrestrial radiation"]}],"etymology":{"value":"'Counter-' (反対、対抗) + 'radiation' (放射) から構成される。","priority":"★★★"},"pronunciation":{"ipa":"/ˌkaʊntərˌreɪdiˈeɪʃən/","syllables":"coun-ter-ra-di-a-tion"},"inflection":{"noun_plural":"counterradiations"},"usage_notes":{"explanation":"Counterradiation is a term primarily used in meteorology, climatology, and related fields. It refers specifically to the longwave radiation emitted by the atmosphere back towards the Earth's surface. This is a key component of the Earth's energy budget and the greenhouse effect.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Counterradiation is the same as solar radiation.","correct":"✓ Counterradiation is radiation emitted by the atmosphere towards the Earth, while solar radiation comes from the sun.","note":"Counterradiation is emitted by the atmosphere, not directly from the sun."}],"priority":"★★☆"},"related_words":{"derivatives":["radiation","longwave radiation","shortwave radiation","greenhouse effect"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Counterradiation' is a technical term used in climate science and meteorology. It refers to the infrared radiation emitted by the atmosphere back towards the Earth's surface. It is a key component of the Earth's energy balance and the greenhouse effect. Understanding this term requires a background knowledge of radiative transfer and atmospheric science."},"example_sentences":[{"sentence":"Increased greenhouse gases enhance atmospheric counterradiation, leading to warming.","translation":"温室効果ガスの増加は大気対放射を増加させ、温暖化につながります。","type":"noun","meaning_category":"対放射"},{"sentence":"Models of climate change must accurately account for counterradiation.","translation":"気候変動モデルは対放射を正確に考慮しなければなりません。","type":"noun","meaning_category":"対放射"}]}