{"word":"canun","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) A type of traditional Korean clothing, specifically a headband or hair accessory worn by women.","english_definition":"(historical) A type of traditional Korean clothing, specifically a headband or hair accessory worn by women.","examples":[{"sentence":"The noblewoman adorned her hair with a beautiful canun.","translation":"その貴婦人は美しいカヌンで髪を飾った。"}],"collocations":["wear a canun","traditional canun","silk canun"],"synonyms":["hairband","headband","hair accessory"],"antonyms":[]}],"etymology":{"value":"Likely derived from Korean historical texts and terminology related to traditional clothing. Further research needed for precise origin.","priority":"★☆☆"},"pronunciation":{"ipa":"/ka.nun/","syllables":"ka-nun"},"inflection":{"noun_plural":"canuns"},"usage_notes":{"explanation":"\"Canun\" refers to a specific type of traditional Korean headwear. It is not a commonly used word in modern English, and its usage is primarily limited to discussions of Korean history, fashion, or culture.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She wore a modern canun to the party.","correct":"✓ She wore a modern headband to the party.","note":"Using \"canun\" for modern headbands is incorrect. It specifically refers to the historical Korean item."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_korean_terms":["hanbok (한복): traditional Korean clothing","gache (가체): traditional Korean wig","binyeo (비녀): Korean ornamental hairpin"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. Primarily used in specialized contexts related to Korean history and culture.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Canun\" is a highly specialized term with limited applicability outside of contexts concerning Korean historical fashion. Understanding requires familiarity with Korean culture and history. It is unlikely to be encountered in general English usage."},"example_sentences":[{"sentence":"The museum exhibit featured a collection of intricately designed canuns from the Joseon dynasty.","translation":"博物館の展示では、朝鮮王朝時代の精巧にデザインされたカヌンのコレクションが展示されていた。","type":"noun","meaning_category":"historical clothing"},{"sentence":"Scholars study the canun to understand the social status and fashion trends of women in historical Korea.","translation":"学者たちはカヌンを研究して、歴史的な韓国の女性の社会的地位とファッショントレンドを理解しようとしている。","type":"noun","meaning_category":"historical clothing"}]}