{"word":"curvimeter","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"曲線測定器、曲線計","english_definition":"An instrument for measuring the length of a curved line, especially on a map.","examples":[{"sentence":"He used a curvimeter to measure the length of the river on the map.","translation":"彼は曲線計を使って地図上の川の長さを測った。"},{"sentence":"The curvimeter is a useful tool for cartographers.","translation":"曲線測定器は地図製作者にとって便利な道具だ。"}],"collocations":["use a curvimeter","measure with a curvimeter"],"synonyms":["opisometer","map measurer"],"antonyms":[]}],"etymology":{"value":"「curve」（曲線）+「-i-」（連結母音）+「meter」（測定器）から構成される。","priority":"★★☆"},"pronunciation":{"ipa":"/kərˈvɪmɪtər/","syllables":"cur-vim-i-ter"},"inflection":{"noun_plural":"curvimeters"},"usage_notes":{"explanation":"A curvimeter is a specialized tool primarily used in cartography and related fields. It's designed to accurately measure distances along curved lines on maps, plans, and drawings. It typically consists of a small wheel that is run along the line to be measured, with a dial or digital display indicating the length.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a ruler to measure the curve, but a curvimeter would have been better.","correct":"✓ He used a ruler to estimate the curve, but a curvimeter would have been more accurate.","note":"Rulers are not effective for measuring curves, so 'measure' is less appropriate than 'estimate' in this context."}],"priority":"★☆☆"},"related_words":{"derivatives":["curve","meter","measurement"],"related_terms":["cartography","map","distance","length"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A curvimeter is a specialized tool used for measuring the length of curved lines, particularly on maps. It is a niche instrument, and understanding its purpose requires familiarity with cartography or technical drawing. The word itself is derived from 'curve' and 'meter,' indicating its function as a curve-measuring device. Its usage is limited to contexts where precise measurement of curved distances is necessary."},"example_sentences":[{"sentence":"The surveyor employed a curvimeter to determine the actual distance of the winding road on the topographic map.","translation":"測量技師は地形図上の曲がりくねった道路の実際の距離を測定するために曲線計を使用した。","type":"noun","meaning_category":"measurement"},{"sentence":"Using the curvimeter, she precisely traced the route of the ancient Roman aqueduct across the historical map.","translation":"曲線計を使って、彼女は古地図上で古代ローマの水道の経路を正確にたどった。","type":"noun","meaning_category":"cartography"}]}