{"word":"acrodermatitis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"肢端皮膚炎","english_definition":"Inflammation of the skin of the extremities (hands and feet).","examples":[{"sentence":"Acrodermatitis enteropathica is a genetic disorder affecting zinc absorption.","translation":"腸性肢端皮膚炎は、亜鉛の吸収に影響を与える遺伝性疾患です。"},{"sentence":"The patient presented with symptoms of acrodermatitis, including rash and scaling on the hands and feet.","translation":"患者は、手足の発疹や鱗屑などの肢端皮膚炎の症状を呈しました。"}],"collocations":["acrodermatitis enteropathica (腸性肢端皮膚炎)","vesiculobullous acrodermatitis (水疱性肢端皮膚炎)"],"synonyms":["dermatitis of the extremities","skin inflammation of the hands and feet"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'acro-' (extremity), 'derma' (skin), and '-itis' (inflammation).","priority":"★★★"},"pronunciation":{"ipa":"/ˌækroʊˌdɜːrməˈtaɪtɪs/","syllables":"ac-ro-der-ma-ti-tis"},"inflection":{"noun_plural":"acrodermatitides"},"usage_notes":{"explanation":"'Acrodermatitis' refers to a group of skin conditions characterized by inflammation of the skin on the extremities, such as the hands and feet. It is often associated with specific underlying causes, such as genetic disorders or nutritional deficiencies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Acrodermatitis is caused by bacteria.","correct":"✓ Acrodermatitis can be caused by various factors, including genetic disorders or nutritional deficiencies.","note":"Acrodermatitis is not always caused by bacteria; it can have various underlying causes."}],"priority":"★★☆"},"related_words":{"derivatives":["acrodermatitic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Acrodermatitis' is a specialized medical term referring to inflammation of the skin on the extremities. Understanding requires knowledge of medical terminology and related conditions. It is typically encountered in medical contexts."},"example_sentences":[{"sentence":"Chronic acrodermatitis can significantly impact a patient's quality of life.","translation":"慢性肢端皮膚炎は、患者の生活の質に大きな影響を与える可能性があります。","type":"general","meaning_category":"general"},{"sentence":"Diagnosis of acrodermatitis often involves a thorough clinical examination and sometimes skin biopsies.","translation":"肢端皮膚炎の診断には、徹底的な臨床検査と、場合によっては皮膚生検が含まれます。","type":"diagnosis","meaning_category":"medical"}]}