{"word":"lesbianisms","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"レズビアン特有の行動、特徴、文化、またはレズビアンであることの様々な側面","english_definition":"The characteristics, behaviors, culture, or various aspects of being a lesbian; lesbian-specific traits or actions.","examples":[{"sentence":"The play explored various lesbianisms, from butch-femme dynamics to political activism.","translation":"その劇は、ブッチとフェムの関係性から政治活動まで、さまざまなレズビアンイズムを探求した。"},{"sentence":"Her work examines the diverse range of lesbianisms within the community.","translation":"彼女の作品は、コミュニティ内の多様なレズビアンイズムの範囲を検証している。"}],"collocations":["explore lesbianisms","examine lesbianisms","various lesbianisms","diverse lesbianisms"],"synonyms":["lesbian culture","lesbian identity","lesbian experiences","lesbianism"],"antonyms":[]}],"etymology":{"value":"\"Lesbian\" + \"-ism\" + pluralizing suffix \"-s\". \"Lesbian\" refers to women who are sexually or romantically attracted to other women, originating from the Greek island of Lesbos, the birthplace of the poet Sappho, who wrote about love between women. The suffix \"-ism\" denotes a doctrine, theory, practice, or characteristic behavior.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɛzbiəˌnɪzəmz/","syllables":"lez-bi-a-niz-ums"},"inflection":{"noun_plural":"lesbianisms"},"usage_notes":{"explanation":"The term \"lesbianisms\" is used to acknowledge the diversity of lesbian experiences, identities, and expressions. It recognizes that there is no single way to be a lesbian and encompasses the wide range of behaviors, cultures, and identities within the lesbian community. It is often used in academic or sociological contexts to analyze and discuss the various facets of lesbian identity and culture.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a lesbianism.","correct":"✓ She is a lesbian.","note":"\"Lesbianism\" refers to the state or characteristics of being a lesbian, not an individual person. Use \"lesbian\" to refer to a person. "},{"incorrect":"✗ All lesbianisms are the same.","correct":"✓ Lesbianisms are diverse and varied.","note":"The term \"lesbianisms\" is used to emphasize the diversity within the lesbian community. Avoid generalizations that suggest all lesbians are the same."}],"priority":"★☆☆"},"related_words":{"derivatives":["lesbian (noun, adjective)","lesbianism (singular noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"lesbianisms\" is a plural noun that refers to the diverse range of experiences, behaviors, and cultural expressions within the lesbian community. It's used to recognize that there isn't one single way to be a lesbian, and it encompasses the various identities and practices that exist. This term is often used in academic or sociological discussions to analyze the complexities of lesbian identity and culture.","priority":"★★☆"},"example_sentences":[{"sentence":"The conference featured panels discussing various aspects of lesbianisms in contemporary society.","translation":"会議では、現代社会におけるレズビアンイズムの様々な側面について議論するパネルが設けられた。","type":"noun","meaning_category":"多様な側面"},{"sentence":"Scholars have explored the historical construction of lesbianisms across different cultures.","translation":"学者たちは、異なる文化におけるレズビアンイズムの歴史的構築を探求してきた。","type":"noun","meaning_category":"文化的構築"},{"sentence":"The book aims to represent the multiplicity of lesbianisms through personal narratives and essays.","translation":"その本は、個人的な物語やエッセイを通して、レズビアンイズムの多様性を表現することを目的としている。","type":"noun","meaning_category":"多様性"}]}