{"word":"thelytokous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"単為生殖の、処女生殖の（特にメスからメスのみが生じる場合）","english_definition":"relating to or characterized by thelytoky, a type of parthenogenesis in which females produce only female offspring.","examples":[{"sentence":"The aphid species is thelytokous, meaning it reproduces without fertilization and produces only female offspring.","translation":"そのアブラムシの種は単為生殖であり、受精なしに繁殖し、メスの子供のみを産むことを意味します。"},{"sentence":"Thelytokous parthenogenesis is common in some insect groups.","translation":"単為生殖は、いくつかの昆虫グループで一般的です。"}],"collocations":["thelytokous parthenogenesis","thelytokous reproduction","thelytokous species"],"synonyms":["parthenogenetic","unisexual"],"antonyms":["amphitokous","arrhenotokous"]}],"etymology":{"value":"ギリシャ語の θῆλυς (thēlys, \"female\") + τόκος (tokos, \"birth\") から。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌθelɪˈtoʊkəs/","syllables":"the-ly-tok-ous"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"「**thelytokous**」は、生物学、特に昆虫学の分野で使用される専門用語です。単為生殖の一種である「thelytoky」に関連し、メスが受精なしにメスの子供のみを産む繁殖様式を指します。一般的な会話で使用されることは稀であり、学術的な文脈や専門的な議論で用いられます。関連語として、オスのみを産む単為生殖を指す「arrhenotokous」、オスとメスの両方を産む単為生殖を指す「amphitokous」があります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Thelytokous is a type of sexual reproduction.","correct":"✓ Thelytokous is a type of asexual reproduction.","note":"Thelytoky is a form of parthenogenesis, which is asexual reproduction, not sexual reproduction."},{"incorrect":"✗ Thelytokous offspring are always genetically identical to the mother.","correct":"✓ Thelytokous offspring are usually genetically similar, but not always identical, to the mother, depending on the specific mechanism of parthenogenesis.","note":"While thelytoky often results in offspring that are very similar to the mother, genetic mutations and recombination can still occur, leading to some genetic differences."}],"priority":"★☆☆"},"related_words":{"derivatives":["thelytoky (名詞: 単為生殖、処女生殖)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (非常に専門的な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**thelytokous**」は、生物学の専門用語で、単為生殖の一種である「thelytoky」に関連する形容詞です。thelytokyとは、メスが受精なしにメスの子供のみを産む繁殖様式を指します。この単語は、生物学、特に昆虫学の研究論文や専門書で使われます。一般的な会話ではほとんど使用されません。関連語として「parthenogenesis（単為生殖）」や「arrhenotokous（オスのみを産む単為生殖）」などがあります。"},"example_sentences":[{"sentence":"Many species of aphids reproduce through thelytokous parthenogenesis.","translation":"多くのアブラムシ種は単為生殖によって繁殖する。","type":"adjective","meaning_category":"単為生殖の"},{"sentence":"The thelytokous nature of this insect population allows for rapid population growth.","translation":"この昆虫個体群の単為生殖的な性質は、急速な個体数増加を可能にする。","type":"adjective","meaning_category":"単為生殖の"},{"sentence":"Understanding the genetic mechanisms behind thelytokous reproduction is an area of active research.","translation":"単為生殖の背後にある遺伝的メカニズムを理解することは、活発な研究分野である。","type":"adjective","meaning_category":"単為生殖の"}]}