{"word":"crystoleum","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"クリストリウム：写真に油絵風の彩色を施し、裏面から見たときに立体的に見えるようにした装飾品。通常、凸レンズ状のガラスに挟んで飾る。","english_definition":"A picture on glass, made by pasting a photograph face downwards on a concave piece of glass, and then coloring it with oil paints, so that it appears like an oil painting when viewed from the front.","examples":[{"sentence":"She collected crystoleums as a hobby.","translation":"彼女は趣味としてクリストリウムを集めていた。"},{"sentence":"The crystoleum depicted a Victorian family.","translation":"そのクリストリウムには、ヴィクトリア朝時代の家族が描かれていた。"}],"collocations":["crystoleum painting","Victorian crystoleum","antique crystoleum"],"synonyms":["glass painting","photo under glass"],"antonyms":[]},{"part_of_speech":"noun","definition":"クリストリウム制作の技法","english_definition":"The process or technique of making a crystoleum.","examples":[{"sentence":"He learned the art of crystoleum from his grandfather.","translation":"彼は祖父からクリストリウムの技術を学んだ。"}],"collocations":["crystoleum technique","crystoleum art"],"synonyms":["glass painting technique"],"antonyms":[]}],"etymology":{"value":"Derived from 'crystal' (referring to the glass) and 'oleum' (Latin for oil, referring to the oil paints used).","priority":"★★☆"},"pronunciation":{"ipa":"/krɪˈstoʊliəm/","syllables":"crys-to-le-um"},"inflection":{"noun_plural":"crystoleums"},"usage_notes":{"explanation":"Crystoleums were popular in the late 19th and early 20th centuries. The process involved adhering a photographic print to the back of a concave piece of glass, thinning the paper, and then hand-coloring the image with oil paints. This created a three-dimensional effect when viewed from the front, resembling an oil painting. Crystoleums are now considered antiques and are collected by enthusiasts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a crystoleum made of crystal oil.","correct":"✓ I saw a crystoleum, which is a photograph colored with oil paints on glass.","note":"Crystoleums are not made of crystal oil; they are photographs colored with oil paints on glass."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Very rare, historical term)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Crystoleum' is a specialized term referring to a specific type of antique photograph. Understanding requires knowledge of historical photographic techniques and art history. The word is rarely encountered in modern contexts outside of antique collecting or art historical discussions."},"example_sentences":[{"sentence":"The museum displayed a rare example of a hand-painted **crystoleum**.","translation":"博物館には、手塗りの珍しいクリストリウムの例が展示されていた。","type":"noun","meaning_category":"装飾品"},{"sentence":"The **crystoleum** process was a popular way to create artistic portraits in the Victorian era.","translation":"クリストリウムの技法は、ヴィクトリア朝時代に芸術的な肖像画を作成する一般的な方法だった。","type":"noun","meaning_category":"技法"}]}