{"word":"Microlithic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"極小石器の、細石器の","english_definition":"Relating to or denoting an industry characterized by very small stone tools, typically geometric in shape, used in composite tools.","examples":[{"sentence":"Microlithic tools were used extensively during the Mesolithic period.","translation":"細石器は中石器時代に広く使用されていました。"},{"sentence":"The microlithic industry represents a significant technological advancement.","translation":"細石器文化は重要な技術的進歩を示しています。"}],"collocations":["microlithic tools","microlithic industry","microlithic technology"],"synonyms":["nanolithic","leptolithic"],"antonyms":["macrolithic"]}],"etymology":{"value":"'Micro-' (small) + 'lithic' (of or relating to stone).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmaɪkroʊˈlɪθɪk/","syllables":"mi-cro-lith-ic"},"inflection":{"notes":"Does not inflect as it is an adjective."},"usage_notes":{"explanation":"'Microlithic' refers specifically to a type of stone tool industry characterized by the production of very small, often geometric, stone tools. These tools were typically used as components in larger tools or weapons.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artifact was macrolithic, indicating a microlithic culture.","correct":"✓ The artifact was macrolithic, indicating an earlier lithic culture.","note":"Macrolithic and microlithic cultures are distinct and do not occur simultaneously."}],"priority":"★☆☆"},"related_words":{"derivatives":["microlith (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'microlithic' is a specialized term used in archaeology to describe a specific type of stone tool technology. Understanding this term requires familiarity with archaeological terminology and concepts related to stone tool industries."},"example_sentences":[{"sentence":"The archaeological site yielded numerous microlithic implements.","translation":"その遺跡からは多数の細石器が出土しました。","type":"general","meaning_category":"descriptive"},{"sentence":"Microlithic technology allowed for more efficient hunting practices.","translation":"細石器技術は、より効率的な狩猟を可能にしました。","type":"historical","meaning_category":"technology"}]}