{"word":"rectangularity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"長方形であること、長方形度、矩形性","english_definition":"The state or quality of being rectangular; the degree to which something resembles a rectangle.","examples":[{"sentence":"The rectangularity of the room made it easy to arrange furniture.","translation":"部屋の矩形性が家具の配置を容易にした。"},{"sentence":"The software measures the rectangularity of the shape.","translation":"そのソフトウェアは形状の矩形性を測定する。"},{"sentence":"High rectangularity is a desired characteristic in certain manufactured components.","translation":"高い矩形性は、特定の製造部品において望ましい特性である。"}],"collocations":["measure rectangularity","high rectangularity","low rectangularity","degree of rectangularity"],"synonyms":["squareness","quadrangularity","oblongness"],"antonyms":["irregularity","roundness","circularity"]}],"etymology":{"value":"From 'rectangular' + '-ity'. 'Rectangular' comes from 'rectangle' + '-ar'. 'Rectangle' comes from Latin 'rectangulus', from 'rectus' (right, straight) + 'angulus' (angle). The suffix '-ity' denotes a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɛkˌtæŋɡjʊˈlærɪti/","syllables":"rec-tan-gu-lar-i-ty"},"inflection":{"noun_plural":"rectangularities"},"usage_notes":{"explanation":"'Rectangularity' is a technical term used to describe how closely a shape or object resembles a perfect rectangle. It is often used in engineering, manufacturing, and computer graphics. It is a more precise term than simply saying something is 'rectangular'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rectangularity of the circle was low.","correct":"✓ The circularity of the shape was high. / ✓ The rectangularity of the shape was low.","note":"'Rectangularity' applies to shapes that are expected to be rectangular. Using it with a circle is incorrect. Use 'circularity' to describe how circular something is."}],"priority":"★★☆"},"related_words":{"derivatives":["rectangular (adjective)","rectangle (noun)"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Rectangularity' is a technical term primarily used in fields like engineering, manufacturing, and computer graphics. It refers to the degree to which something resembles a perfect rectangle. The word is formed by adding the suffix '-ity' to 'rectangular', which itself is derived from 'rectangle'. Understanding this word requires a familiarity with geometric concepts and a technical vocabulary. It's not a word commonly used in everyday conversation."},"example_sentences":[{"sentence":"The rectangularity of the machined part was within the specified tolerance.","translation":"機械加工された部品の矩形性は、指定された公差内であった。","type":"noun","meaning_category":"長方形度"},{"sentence":"The image processing algorithm calculated the rectangularity of each object in the scene.","translation":"画像処理アルゴリズムは、シーン内の各オブジェクトの矩形性を計算した。","type":"noun","meaning_category":"長方形度"},{"sentence":"The architect considered the rectangularity of the building's footprint when designing the layout.","translation":"建築家は、レイアウトを設計する際に、建物のフットプリントの矩形性を考慮した。","type":"noun","meaning_category":"長方形度"}]}