{"word":"streaming-haired","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having long, flowing hair that appears to be streaming or moving freely, often suggesting a wild, untamed, or ethereal appearance.","english_definition":"Describing someone with long, flowing hair that looks as if it's streaming or moving freely, often implying a wild or ethereal quality.","examples":[{"sentence":"The painting depicted a nymph with streaming-haired beauty, her locks cascading down her back.","translation":"その絵は、髪が流れ落ちるように美しいニンフを描いており、彼女の髪は背中に流れ落ちていた。"},{"sentence":"She appeared on stage, a streaming-haired vision in white, captivating the audience with her presence.","translation":"彼女は舞台に現れ、白い衣装をまとった髪が流れ落ちるような幻影で、その存在で観客を魅了した。"},{"sentence":"The artist sought to capture the essence of freedom in his sculpture, depicting a streaming-haired figure running against the wind.","translation":"アーティストは彫刻で自由の本質を捉えようとし、風に向かって走る髪が流れ落ちる人物を描いた。"}],"collocations":["streaming-haired beauty","streaming-haired figure","streaming-haired nymph","long, streaming hair","flowing hair","wild hair","untamed hair","ethereal appearance"],"synonyms":["flowing-haired","long-haired","cascading-haired","windblown-haired","unbound-haired","free-flowing-haired"],"antonyms":["short-haired","close-cropped","neatly-coiffed","tidy-haired","bound-haired","restrained-haired"]}],"etymology":{"value":"A compound adjective formed by combining 'streaming' (referring to something flowing freely) and 'haired' (having hair). The term evokes the image of hair that is long and unrestrained, moving as if in a stream or current.","priority":"N/A"},"pronunciation":{"ipa":"/ˈstriːmɪŋˌheərd/","syllables":"stream-ing-haired"},"inflection":{"notes":"Adjectives do not typically inflect in English, aside from comparative and superlative forms, which are less common for compound adjectives like this one.","adjective_forms":{"comparative":"more streaming-haired","superlative":"most streaming-haired"}},"usage_notes":{"explanation":"'Streaming-haired' is a descriptive adjective used to create a vivid image of someone with long, flowing hair. It's often used in literature, poetry, or art descriptions to convey a sense of freedom, wildness, or ethereal beauty. The term is not commonly used in everyday conversation but is more frequently found in creative writing.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ She was a streaming hair girl.","correct":"✓ She was a streaming-haired girl.","note":"The correct form is 'streaming-haired' as a compound adjective modifying 'girl.'"},{"incorrect":"✗ The streaming haired was beautiful.","correct":"✓ The streaming-haired woman was beautiful.","note":"'Streaming-haired' is an adjective and needs to modify a noun. It cannot stand alone as a noun."}],"priority":"N/A"},"related_words":{"derivatives":["streaming (adjective, verb)","haired (adjective)"],"phrases":["flowing locks","cascading hair","windblown hair","long tresses"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - The term is relatively uncommon and primarily used in descriptive writing.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Streaming-haired' is a descriptive adjective used to portray someone with long, flowing hair. It is not a common term in everyday language but is more often found in literary or artistic contexts to evoke a sense of wildness, freedom, or ethereal beauty. Understanding the compound structure helps in interpreting the meaning: 'streaming' implies movement and flow, while 'haired' indicates the presence of hair. This term is more suited for advanced English learners who are familiar with descriptive and figurative language."},"example_sentences":[{"sentence":"The artist painted a portrait of a streaming-haired goddess emerging from the sea.","translation":"画家は海から現れる、髪が流れ落ちる女神の肖像画を描いた。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"With a streaming-haired silhouette against the sunset, she looked like a mythical creature.","translation":"夕焼けを背景に髪が流れ落ちる彼女のシルエットは、神話の生き物のように見えた。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"The novel described the heroine as a streaming-haired adventurer, fearless and free.","translation":"その小説は、ヒロインを、恐れを知らず自由な、髪が流れ落ちる冒険家として描いた。","type":"adjective","meaning_category":"Descriptive"}]}