{"word":"sexualizing","priority":"★★☆","meanings":[{"part_of_speech":"verb (gerund or present participle)","definition":"性的なものにする、性的に解釈する、性的な意味合いを持たせる","english_definition":"to make something sexual; to interpret something in a sexual way; to attribute sexual qualities to something or someone.","examples":[{"sentence":"The media is often accused of sexualizing young girls.","translation":"メディアはしばしば若い女の子を性的に見せようとしていると非難される。"},{"sentence":"He felt uncomfortable with the way she was sexualizing his comments.","translation":"彼は彼女が彼のコメントを性的に解釈しているやり方に不快感を覚えた。"},{"sentence":"Some people argue that advertising sexualizes everyday products.","translation":"広告は日常的な製品を性的に見せようとしていると主張する人もいる。"}],"collocations":["sexualizing children (子供を性的に扱うこと)","sexualizing images (画像を性的にすること)","sexualizing behavior (行動を性的にすること)","sexualizing comments (コメントを性的にすること)"],"synonyms":["objectifying","eroticizing","sensualizing"],"antonyms":["desexualizing","platonicizing"]},{"part_of_speech":"noun","definition":"性的対象化、性的な解釈、性的な意味合いを持たせること","english_definition":"the act of making something sexual; the interpretation of something in a sexual way; the attribution of sexual qualities to something or someone.","examples":[{"sentence":"The sexualizing of women in advertising is a common topic of discussion.","translation":"広告における女性の性的対象化は、よく議論されるテーマだ。"},{"sentence":"She spoke out against the sexualizing of her appearance.","translation":"彼女は自身の外見が性的に解釈されることに反対を表明した。"},{"sentence":"The film was criticized for its gratuitous sexualizing of violence.","translation":"その映画は、不必要な暴力の性的描写で批判された。"}],"collocations":["sexualizing of women (女性の性的対象化)","sexualizing of children (子供の性的対象化)","sexualizing of violence (暴力の性的対象化)"],"synonyms":["objectification","eroticization","sensualization"],"antonyms":["desexualization","platonicization"]}],"etymology":{"value":"Derived from the verb 'sexualize,' which is formed by adding the suffix '-ize' (meaning 'to make or become') to the adjective 'sexual.' The term implies the process of imbuing something with sexual characteristics or interpreting it in a sexual context.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɛkʃuəlaɪzɪŋ/","syllables":"sek-shu-al-iz-ing"},"inflection":{"verb_forms":{"present_simple":["sexualize","sexualizes"],"past_simple":"sexualized","past_participle":"sexualized","present_participle":"sexualizing"},"noun_plural":"sexualizings"},"usage_notes":{"explanation":"'Sexualizing' refers to the act of making something sexual or interpreting it in a sexual manner. It often carries a negative connotation, particularly when applied to children or in contexts where it is deemed inappropriate or exploitative. The term can be used to describe the actions of individuals, media, or societal trends that promote or normalize the objectification or sexualization of others.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The sexualizing is bad.","correct":"✓ The sexualization is bad.","note":"'Sexualizing' is a verb form (gerund or present participle), while 'sexualization' is the noun form that refers to the process or act of making something sexual."},{"incorrect":"✗ They are sexualizing about her.","correct":"✓ They are sexualizing her.","note":"'Sexualize' is a transitive verb, meaning it requires a direct object. The preposition 'about' is not needed."}],"priority":"★★☆"},"related_words":{"derivatives":["sexualize (verb)","sexualization (noun)","sexualized (adjective)","sexual (adjective)","sexuality (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing in recent years due to discussions around media and societal issues.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sexualizing' is a term used to describe the act of making something sexual or interpreting it in a sexual way. It often implies a critical perspective, especially when discussing the representation of individuals (particularly children or women) in media or advertising. The word suggests that something is being inappropriately or excessively presented in a sexual context. It is important to understand the negative connotations often associated with this term, as it is frequently used in discussions about exploitation and objectification."},"example_sentences":[{"sentence":"The debate centered on whether the advertisement was sexualizing the product.","translation":"議論の中心は、その広告が製品を性的に見せようとしているかどうかだった。","type":"verb (present participle)","meaning_category":"性的にすること"},{"sentence":"The sexualizing of young girls in the media is a serious concern.","translation":"メディアにおける若い女の子の性的対象化は深刻な懸念事項だ。","type":"noun","meaning_category":"性的対象化"},{"sentence":"She accused the photographer of sexualizing her image.","translation":"彼女は写真家が自分のイメージを性的に見せようとしていると非難した。","type":"verb (present participle)","meaning_category":"性的にすること"},{"sentence":"The article discussed the dangers of sexualizing children.","translation":"その記事は子供を性的に扱うことの危険性について論じた。","type":"noun","meaning_category":"性的対象化"}]}