{"word":"clericalism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"聖職者主義、僧侶政治、教権主義","english_definition":"Belief in the inherent superiority of clerics over laity; policies, practices, or beliefs that prioritize the power or status of the clergy, often to the detriment of the laity.","examples":[{"sentence":"Clericalism has been identified as a root cause of some of the problems within the Church.","translation":"聖職者主義は、教会内の問題の根本的な原因のいくつかとして特定されています。"},{"sentence":"The reforms aimed to reduce clericalism and increase the involvement of lay people in church governance.","translation":"改革は、聖職者主義を減らし、教会運営への一般信徒の関与を増やすことを目的としていました。"},{"sentence":"Critics argue that clericalism leads to a culture of deference and secrecy.","translation":"批判者たちは、聖職者主義が服従と秘密主義の文化につながると主張しています。"}],"collocations":["combat clericalism (聖職者主義と闘う)","address clericalism (聖職者主義に対処する)","challenge clericalism (聖職者主義に異議を唱える)","root out clericalism (聖職者主義を根絶する)","effects of clericalism (聖職者主義の影響)","dangers of clericalism (聖職者主義の危険性)"],"synonyms":["ecclesiocracy","hierocracy","priestcraft","pontificalism"],"antonyms":["laicism","secularism","egalitarianism"]},{"part_of_speech":"noun","definition":"聖職者の立場・権威の擁護","english_definition":"Advocacy of the rights, privileges, or power of the clergy.","examples":[{"sentence":"His speech was interpreted as a defense of clericalism.","translation":"彼の演説は、聖職者主義の擁護と解釈された。"}],"collocations":["support clericalism (聖職者主義を支持する)","defend clericalism (聖職者主義を擁護する)"],"synonyms":["pro-clericalism"],"antonyms":["anti-clericalism"]}],"etymology":{"value":"From 'clerical' (pertaining to the clergy) + '-ism' (a doctrine, principle, or ideology).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈklɛrɪkəlɪzəm/","syllables":"cler-i-cal-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Clericalism' generally has a negative connotation, implying an undue emphasis on the power and privilege of the clergy, often at the expense of the laity. However, it can also be used neutrally to describe the advocacy of clerical rights. The specific meaning depends on the context. It is often discussed in religious or political contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The clericalism was very kind.","correct":"✓ The cleric was very kind.","note":"'Clericalism' is an ideology or system, not a person. Use 'cleric' to refer to a member of the clergy."}],"priority":"★☆☆"},"related_words":{"derivatives":["clerical (adjective: 聖職の、事務の)","cleric (noun: 聖職者)","anti-clericalism (noun: 反聖職者主義)"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Clericalism' is a complex term related to religious and political systems. It refers to the belief in the superiority of the clergy or the prioritization of their power and status. It is often used in discussions about the role of the clergy in society and the balance of power between the clergy and the laity. Understanding the nuances of this term requires familiarity with religious and political discourse.","priority":"★☆☆"},"example_sentences":[{"sentence":"The bishop spoke out against the dangers of clericalism in the church.","translation":"司教は教会における聖職者主義の危険性について発言した。","type":"noun","meaning_category":"聖職者主義"},{"sentence":"Some argue that clericalism is a barrier to greater lay involvement in the church.","translation":"聖職者主義は、教会への一般信徒のより大きな関与への障壁であると主張する人もいる。","type":"noun","meaning_category":"聖職者主義"},{"sentence":"The council sought to address the issue of clericalism and promote a more egalitarian structure.","translation":"評議会は聖職者主義の問題に対処し、より平等な構造を促進しようとした。","type":"noun","meaning_category":"聖職者主義"}]}