{"word":"thermionics","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"熱電子工学、熱イオン放射","english_definition":"The branch of physics dealing with the emission of electrons from heated surfaces.","examples":[{"sentence":"Thermionics is crucial for the operation of vacuum tubes.","translation":"熱電子工学は真空管の動作に不可欠である。"},{"sentence":"The study of thermionics led to the development of various electronic devices.","translation":"熱電子工学の研究は、様々な電子デバイスの開発につながった。"}],"collocations":["thermionic emission","thermionic converter","thermionic device"],"synonyms":["thermionic emission","thermal emission"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'thermos' (heat) and 'ion' (ion), combined with '-ics' to denote a field of study.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌθɜːrmiˈɒnɪks/","syllables":"ther-mi-on-ics"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Thermionics is a specialized field of physics, primarily concerned with the emission of electrons from a heated surface. This phenomenon, known as thermionic emission, is the basis for the operation of vacuum tubes and other electronic devices. The term is relatively uncommon in everyday language, primarily used within scientific and engineering contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Thermionics are used in modern transistors.","correct":"✓ Semiconductors are used in modern transistors.","note":"Thermionics is primarily associated with vacuum tubes, not transistors. Transistors rely on semiconductor physics."}],"priority":"★☆☆"},"related_words":{"derivatives":["thermionic (adjective)","thermion (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Thermionics is a highly specialized term related to physics and electrical engineering. It refers to the study and application of thermionic emission, the process where electrons are emitted from a heated surface. This concept is fundamental to understanding the operation of older technologies like vacuum tubes. Due to its technical nature, it is not commonly encountered outside of scientific or engineering contexts."},"example_sentences":[{"sentence":"The efficiency of the thermionic converter depends on the work function of the emitting material.","translation":"熱電子コンバーターの効率は、放射材料の仕事関数に依存する。","type":"noun","meaning_category":"熱電子工学"},{"sentence":"Early radio technology relied heavily on thermionics for signal amplification.","translation":"初期の無線技術は、信号増幅のために熱電子工学に大きく依存していた。","type":"noun","meaning_category":"熱電子工学"}]}