{"word":"peer-assessed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"同僚評価された、仲間によって評価された","english_definition":"Evaluated or assessed by one's peers (people of similar status or standing).","examples":[{"sentence":"The assignment was peer-assessed, so students received feedback from their classmates.","translation":"その課題は同僚評価されたので、学生はクラスメートからフィードバックを受け取りました。"},{"sentence":"Peer-assessed learning encourages students to reflect on their own work and the work of others.","translation":"同僚評価による学習は、学生が自分の作品や他者の作品を振り返ることを奨励します。"},{"sentence":"The research proposal was peer-assessed by experts in the field.","translation":"その研究提案は、その分野の専門家によって同僚評価されました。"}],"collocations":["peer-assessed assignment (同僚評価された課題)","peer-assessed learning (同僚評価による学習)","peer-assessed research (同僚評価された研究)","peer-assessed review (同僚評価されたレビュー)"],"synonyms":["peer-reviewed","colleague-assessed","evaluated by peers","assessed by colleagues"],"antonyms":["self-assessed","teacher-assessed","instructor-assessed"]}],"etymology":{"value":"The term is formed by combining 'peer' (a person of equal standing with another in a group) and 'assessed' (evaluated or judged). It indicates that the assessment process is conducted by individuals who are at a similar level or position.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɪər əˈsɛst/","syllables":"peer-as-sessed"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Peer-assessed' is commonly used in educational and professional contexts to describe evaluations conducted by individuals of similar standing. It is often used in academic settings where students assess each other's work, or in professional environments where colleagues provide feedback on each other's performance. The term emphasizes the collaborative and equitable nature of the evaluation process.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The peer assessed the teacher.","correct":"✓ The students peer-assessed each other.","note":"Peer assessment is typically done among individuals of similar status. Teachers do not usually get peer-assessed by students."},{"incorrect":"✗ The peer-assessed was helpful.","correct":"✓ The peer-assessment was helpful.","note":"'Peer-assessed' is an adjective. The noun form is 'peer assessment'."}],"priority":"★★☆"},"related_words":{"derivatives":["peer assessment (同僚評価)","peer review (査読)","peer feedback (同僚からのフィードバック)"],"phrasal_verbs":[],"related_terms":["self-assessment (自己評価)","formative assessment (形成的評価)","summative assessment (総括的評価)"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in academic and professional contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'peer-assessed' is used in academic and professional settings to describe a process where individuals of similar standing evaluate each other's work. It is often used in higher education when students provide feedback on each other's assignments, or in professional contexts where colleagues review each other's performance. The term implies a collaborative and equitable assessment process. Understanding this term requires familiarity with assessment terminology and academic/professional contexts."},"example_sentences":[{"sentence":"The students' presentations were peer-assessed using a standardized rubric.","translation":"学生のプレゼンテーションは、標準化されたルーブリックを用いて同僚評価されました。","type":"adjective","meaning_category":"同僚評価された"},{"sentence":"Peer-assessed feedback can be more readily accepted by students than feedback from instructors.","translation":"同僚評価によるフィードバックは、教員からのフィードバックよりも学生に受け入れられやすいことがあります。","type":"adjective","meaning_category":"同僚評価された"},{"sentence":"The journal uses a rigorous peer-assessed review process to ensure the quality of its publications.","translation":"そのジャーナルは、出版物の質を保証するために、厳格な同僚評価による査読プロセスを使用しています。","type":"adjective","meaning_category":"同僚評価された"}]}