{"word":"repaving","priority":"★☆☆","meanings":[{"part_of_speech":"verb (gerund/present participle)","definition":"(道路などを)再舗装すること","english_definition":"The act of paving again; applying a new surface to a road, sidewalk, or other paved area.","examples":[{"sentence":"The city is repaving several streets this summer.","translation":"市は今年の夏、いくつかの道路を再舗装している。"},{"sentence":"Repaving the driveway will improve the property's value.","translation":"私道（車道）を再舗装することで、不動産の価値が向上するだろう。"},{"sentence":"They are repaving the highway to improve driving conditions.","translation":"彼らは運転状況を改善するために高速道路を再舗装している。"}],"collocations":["repaving project","repaving costs","repaving contract","repaving work","street repaving","road repaving"],"synonyms":["resurfacing","reconstructing","re-laying","paving again"],"antonyms":["demolishing","unpaving"]}],"etymology":{"value":"The word 'repaving' is formed by adding the prefix 're-' (meaning 'again') to the word 'paving'. 'Paving' comes from the verb 'to pave,' which originates from the Latin word 'pavire,' meaning 'to beat, tread down, or ram firm.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈpeɪvɪŋ/","syllables":"re-pav-ing"},"inflection":{"verb_forms":{"present_simple":["repave","repaves"],"past_simple":"repaved","past_participle":"repaved","present_participle":"repaving"}},"usage_notes":{"explanation":"'Repaving' refers specifically to the process of applying a new surface layer to an existing paved area. This is typically done when the existing surface is damaged, worn, or needs improvement. It is distinct from initial paving, which is the original creation of a paved surface. The term is most commonly used in the context of roads, streets, driveways, and sidewalks.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The repaving was very expensively.","correct":"✓ The repaving was very expensive.","note":"'Expensive' is an adjective, so it should be used to describe the cost of the repaving. 'Expensively' is an adverb and doesn't fit in this context."},{"incorrect":"✗ They are repaving the road with bricks. That's re-bricking.","correct":"✓ They are repaving the road with bricks. They are re-laying the bricks.","note":"While 'repaving' generally implies using asphalt or concrete, if bricks are being used, it's more accurate to say they are 're-laying the bricks' or 're-bricking' (though 're-bricking' is less common)."}],"priority":"★★☆"},"related_words":{"derivatives":["repave (verb): to pave again","pavement (noun): a paved surface, especially a sidewalk","paver (noun): a person or machine that paves; a paving stone or brick","paving (noun): the process of covering a surface with paving material"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'repaving' is a relatively straightforward term that combines the prefix 're-' (meaning 'again') with the verb 'paving.' It specifically describes the action of applying a new surface to an existing paved area, such as a road or sidewalk. Understanding the meaning of 're-' and 'paving' makes the meaning of 'repaving' easily accessible. It is commonly used in discussions about infrastructure maintenance and construction.","priority":"★★★"},"example_sentences":[{"sentence":"The repaving of the highway caused significant traffic delays.","translation":"高速道路の再舗装は、重大な交通渋滞を引き起こした。","type":"noun (gerund)","meaning_category":"再舗装"},{"sentence":"The city council approved the repaving project for Main Street.","translation":"市議会はメインストリートの再舗装プロジェクトを承認した。","type":"noun (gerund)","meaning_category":"再舗装"},{"sentence":"Repaving the parking lot is scheduled for next week.","translation":"駐車場（駐車場）の再舗装は来週予定されている。","type":"noun (gerund)","meaning_category":"再舗装"},{"sentence":"The repaving work will take approximately three weeks to complete.","translation":"再舗装工事は完了までに約3週間かかる予定です。","type":"noun (gerund)","meaning_category":"再舗装"}]}