{"word":"leaseholding","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"借地権、賃借権","english_definition":"The holding of property by lease; a system of land tenure where land is leased for a fixed period.","examples":[{"sentence":"Leaseholding is common in urban areas where land is scarce.","translation":"借地権は土地が不足している都市部で一般的です。"},{"sentence":"The leaseholding agreement specified the terms of the tenancy.","translation":"借地権契約には、賃貸借の条件が明記されていました。"}],"collocations":["acquire a leaseholding","transfer a leaseholding","extend a leaseholding","leaseholding agreement","leaseholding property"],"synonyms":["tenancy","leasehold","rental agreement","land lease"],"antonyms":["freehold","ownership"]},{"part_of_speech":"adjective","definition":"借地権の、賃借権の","english_definition":"Relating to the holding of property by lease.","examples":[{"sentence":"The leaseholding properties are subject to specific regulations.","translation":"借地権物件は特定の規制の対象となります。"},{"sentence":"The leaseholding system allows for long-term use of the land.","translation":"借地権制度により、土地の長期利用が可能になります。"}],"collocations":["leaseholding properties","leaseholding system","leaseholding rights"],"synonyms":["leasehold","tenanted"],"antonyms":["freehold"]}],"etymology":{"value":"The word 'leaseholding' is derived from the combination of 'lease' (a contract by which one conveys real estate for a specified term and rent) and 'holding' (the act or state of possessing property).","priority":"★★★"},"pronunciation":{"ipa":"/ˈliːsˌhoʊldɪŋ/","syllables":"lease-hold-ing"},"inflection":{"noun_plural":"leaseholdings"},"usage_notes":{"explanation":"'Leaseholding' refers to the system where land or property is held under a lease agreement for a specified period. It is a common form of land tenure, particularly in areas where outright ownership (freehold) is not feasible or available. The terms and conditions of the lease, including the duration and rent, are outlined in the lease agreement.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a leasehold in this house.","correct":"✓ I have a leaseholding on this house.","note":"The correct preposition to use with 'leaseholding' is 'on' when referring to a specific property."},{"incorrect":"✗ The leaseholding is free.","correct":"✓ The leaseholding is subject to rent.","note":"Leaseholdings are not free; they involve paying rent to the landowner."}],"priority":"★★☆"},"related_words":{"derivatives":["leaseholder","leasehold","lease"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in legal and real estate contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Leaseholding' is a term typically used in the context of property law and real estate. It refers to the system where someone holds a property under a lease agreement, meaning they have the right to use the property for a specific period in exchange for rent. This term is more complex and less common in everyday conversation, making it suitable for advanced learners. Understanding this term requires familiarity with legal and property-related vocabulary."},"example_sentences":[{"sentence":"The value of the leaseholding decreased due to the short remaining term.","translation":"残りの期間が短いため、借地権の価値は減少しました。","type":"noun","meaning_category":"借地権"},{"sentence":"The leaseholding agreement outlined the responsibilities of both the landlord and the tenant.","translation":"借地権契約には、地主とテナント両方の責任が明記されていました。","type":"noun","meaning_category":"借地権"},{"sentence":"Many apartment buildings in the city are built on leaseholding land.","translation":"都市の多くのアパートは借地権の土地に建てられています。","type":"adjective","meaning_category":"借地権の"}]}