{"word":"flywheel-explosion","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"はずみ車爆発","english_definition":"The catastrophic failure of a flywheel due to excessive rotational speed or material defects, resulting in fragments being ejected at high velocity.","examples":[{"sentence":"The flywheel-explosion caused significant damage to the surrounding machinery.","translation":"はずみ車の爆発は、周囲の機械に重大な損傷を引き起こしました。"},{"sentence":"Safety regulations are in place to prevent flywheel-explosions in industrial settings.","translation":"産業現場では、はずみ車の爆発を防ぐための安全規制が設けられています。"}],"collocations":["prevent flywheel-explosion","cause a flywheel-explosion","flywheel-explosion damage","flywheel-explosion risk"],"synonyms":["flywheel failure","rotational burst","mechanical explosion"],"antonyms":["flywheel integrity","stable operation"]},{"part_of_speech":"noun","definition":"(比喩的に)計画や取り組みの突然の破綻、または予期せぬ壊滅的な失敗","english_definition":"(Figuratively) A sudden and catastrophic failure of a plan, project, or undertaking, often with widespread negative consequences.","examples":[{"sentence":"The project suffered a flywheel-explosion when funding was unexpectedly withdrawn.","translation":"資金が予期せず引き上げられたとき、プロジェクトは突然破綻しました。"},{"sentence":"The company's expansion plans experienced a flywheel-explosion due to poor market research.","translation":"会社の拡大計画は、不十分な市場調査のために壊滅的な失敗を経験しました。"}],"collocations":["project flywheel-explosion","economic flywheel-explosion","strategy flywheel-explosion"],"synonyms":["catastrophic failure","sudden collapse","complete breakdown","disastrous outcome"],"antonyms":["successful launch","smooth implementation","positive outcome"]}],"etymology":{"value":"The term combines 'flywheel,' a mechanical device used to store rotational energy, and 'explosion,' indicating a sudden and violent rupture. The figurative sense extends from the literal event, highlighting the sudden and destructive nature of the failure.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈflaɪwiːl ɪkˌsploʊʒən/","syllables":"fly-wheel-ex-plo-sion"},"inflection":{"noun_plural":"flywheel-explosions"},"usage_notes":{"explanation":"The term 'flywheel-explosion' is used both literally, to describe the physical event of a flywheel bursting apart, and figuratively, to describe the sudden and catastrophic failure of a plan or project. In both cases, it implies a sudden, unexpected, and destructive event. The figurative use is less common but conveys a strong sense of complete and irreversible failure.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The flywheel explosioned.","correct":"✓ The flywheel exploded. / ✓ There was a flywheel-explosion.","note":"'Flywheel-explosion' is a noun, not a verb. Use 'exploded' as a verb or 'flywheel-explosion' as a noun."},{"incorrect":"✗ The plan had a flywheel.","correct":"✓ The plan experienced a flywheel-explosion.","note":"The figurative sense requires the full term 'flywheel-explosion' to convey the sudden and catastrophic nature of the failure."}],"priority":"★★☆"},"related_words":{"derivatives":["flywheel (noun)","explosion (noun)","explode (verb)"],"related_terms":["mechanical failure","catastrophic event","system collapse","structural failure"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (technical and specialized vocabulary)","frequency_google_ngram":"Low frequency (specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'flywheel-explosion' refers to the sudden and catastrophic failure of a flywheel, a mechanical device used to store rotational energy. This term is also used figuratively to describe the complete and disastrous failure of a plan or project. Understanding this term requires knowledge of both mechanical engineering and figurative language. It is most commonly used in technical or specialized contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The investigation revealed that metal fatigue contributed to the flywheel-explosion.","translation":"調査の結果、金属疲労がはずみ車の爆発の一因となったことが明らかになった。","type":"noun","meaning_category":"literal"},{"sentence":"The company's ambitious expansion plans suffered a flywheel-explosion when the market conditions changed unexpectedly.","translation":"市場の状況が予期せず変化したとき、会社の野心的な拡大計画は突然破綻した。","type":"noun","meaning_category":"figurative"}]}