{"word":"Aphidophagous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"アブラムシを食べる、アブラムシ食性の","english_definition":"feeding on aphids","examples":[{"sentence":"Ladybugs are aphidophagous insects.","translation":"テントウムシはアブラムシ食性の昆虫です。"},{"sentence":"Aphidophagous predators can help control aphid populations in gardens.","translation":"アブラムシ食性の捕食者は、庭のアブラムシの個体数を制御するのに役立ちます。"}],"collocations":["aphidophagous insects","aphidophagous predators","aphidophagous larvae"],"synonyms":["aphid-eating"],"antonyms":[]}],"etymology":{"value":"\"Aphidophagous\" comes from the combination of \"aphido-\" (referring to aphids) and \"-phagous\" (meaning \"eating\" or \"feeding on\"). The \"aphido-\" part is derived from the scientific name of aphids, which is Aphididae. The \"-phagous\" part comes from the Greek word \"phagein,\" meaning \"to eat.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌeɪfɪdəˈfɑːɡəs/","syllables":"A-phi-do-pha-gous"},"inflection":{"notes":"This is an adjective, so it doesn't have plural forms or verb conjugations."},"usage_notes":{"explanation":"\"Aphidophagous\" is a scientific term used to describe organisms, typically insects, that have a diet consisting primarily or entirely of aphids. It's often used in the context of biological pest control, where aphidophagous insects are introduced to control aphid populations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The aphidophagous is a ladybug.","correct":"✓ The aphidophagous insect is a ladybug. / ✓ A ladybug is aphidophagous.","note":"\"Aphidophagous\" is an adjective, not a noun. You need to use it to describe a noun, like \"insect\" or \"predator,\" or use it as a predicate adjective after a linking verb."}],"priority":"★★☆"},"related_words":{"derivatives":["phagous","phage","polyphagous","oligophagous","monophagous"],"related_terms":["aphid","Aphididae","biological control","pest control"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Aphidophagous\" is a technical term used in biology and entomology. It describes organisms that feed on aphids. This word is not commonly used in everyday language and is typically found in scientific or academic contexts related to pest control, agriculture, or ecology. Understanding this term requires knowledge of scientific vocabulary and concepts related to feeding habits and ecological relationships."},"example_sentences":[{"sentence":"The farmer introduced aphidophagous wasps to control the aphid infestation in his crops.","translation":"農家は作物のアブラムシの蔓延を制御するために、アブラムシ食性のハチを導入しました。","type":"general","meaning_category":"General Use"},{"sentence":"Aphidophagous insects play a crucial role in maintaining the balance of ecosystems.","translation":"アブラムシ食性の昆虫は、生態系のバランスを維持する上で重要な役割を果たします。","type":"scientific","meaning_category":"Scientific Context"},{"sentence":"Research is being conducted to identify the most effective aphidophagous species for integrated pest management.","translation":"統合的病害虫管理のために、最も効果的なアブラムシ食性種を特定するための研究が行われています。","type":"agricultural","meaning_category":"Agricultural Context"}]}