{"word":"time-binding","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"時間結合：人間が過去の経験から学び、それを未来の世代に伝える能力。","english_definition":"The uniquely human capacity to accumulate knowledge and experience from the past and transmit it to future generations.","examples":[{"sentence":"Time-binding allows societies to progress beyond the limitations of individual lifespans.","translation":"時間結合によって、社会は個人の寿命の限界を超えて進歩することができます。"},{"sentence":"Writing is a key tool for time-binding, enabling the preservation and dissemination of knowledge across generations.","translation":"書くことは時間結合の重要なツールであり、知識を保存し、世代を超えて普及させることができます。"}],"collocations":["facilitate time-binding (時間結合を促進する)","enhance time-binding (時間結合を強化する)","the concept of time-binding (時間結合の概念)","time-binding capacity (時間結合能力)"],"synonyms":["cultural transmission","knowledge accumulation","generational learning","social inheritance"],"antonyms":["instinctual behavior","rote learning","isolated knowledge"],"notes":"時間結合は、アルフレッド・コージブスキーによって提唱された一般意味論の重要な概念です。"}],"etymology":{"value":"アルフレッド・コージブスキーが作った言葉で、人間が時間を通じて知識を蓄積し伝達する能力を指すために作られた。","priority":"★★★"},"pronunciation":{"ipa":"/ˈtaɪmˌbaɪndɪŋ/","syllables":"time-bind-ing"},"inflection":{"noun_plural":"time-bindings"},"usage_notes":{"explanation":"Time-binding is a concept central to Alfred Korzybski's General Semantics. It describes the human ability to learn from the past, build upon existing knowledge, and transmit that knowledge to future generations. This capacity distinguishes humans from animals, which primarily rely on instinct and immediate experience. Time-binding is facilitated by language, writing, and other forms of communication that allow for the accumulation and preservation of knowledge over time.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Time-binding is the same as memory.","correct":"✓ Time-binding is the ability to pass knowledge from one generation to the next.","note":"Time-binding is not simply memory; it's the active transmission and accumulation of knowledge across generations."},{"incorrect":"✗ Animals also exhibit time-binding.","correct":"✓ Time-binding is a uniquely human characteristic.","note":"While animals can learn, time-binding, in the Korzybskian sense, is considered a uniquely human ability to build upon past knowledge and transmit it to future generations."}],"priority":"★★☆"},"related_words":{"derivatives":["space-binding (空間結合)","organism-binding (有機体結合)"],"related_concepts":["General Semantics (一般意味論)","abstraction (抽象化)","non-identity (非同一性)","self-reflexiveness (自己反省性)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"低頻度 (Low frequency) - 専門的な概念。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Time-binding' is a specialized term, primarily used in the context of General Semantics, a theory developed by Alfred Korzybski. It refers to the uniquely human ability to learn from past experiences, accumulate knowledge, and pass it on to future generations. This concept emphasizes how humans are not limited to instinct or immediate experience but can build upon the knowledge of those who came before them. Understanding 'time-binding' requires familiarity with the broader framework of General Semantics and its focus on how humans create meaning and understanding through language and abstraction."},"example_sentences":[{"sentence":"The invention of the printing press greatly enhanced time-binding by making knowledge more accessible.","translation":"印刷機の発明は、知識へのアクセスを容易にすることで、時間結合を大幅に強化しました。","type":"general","meaning_category":"知識の伝達"},{"sentence":"Through time-binding, each generation can build upon the achievements of its predecessors, leading to continuous progress.","translation":"時間結合を通じて、各世代は先人たちの成果の上に築き上げることができ、継続的な進歩につながります。","type":"general","meaning_category":"知識の蓄積"},{"sentence":"Korzybski argued that time-binding is essential for human survival and advancement.","translation":"コージブスキーは、時間結合が人間の生存と進歩に不可欠であると主張しました。","type":"theoretical","meaning_category":"理論的な重要性"}]}