{"word":"pasquinader","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"風刺文、痛烈な風刺","english_definition":"A lampoon or satire, especially one posted in a public place.","examples":[{"sentence":"The town was rife with pasquinaders aimed at the corrupt mayor.","translation":"その町は、堕落した市長を対象とした風刺文で溢れていた。"},{"sentence":"His political cartoons were often described as pasquinaders in visual form.","translation":"彼の政治漫画は、視覚的な形の風刺文としてよく評された。"}],"collocations":["political pasquinader","anonymous pasquinader","public pasquinader"],"synonyms":["lampoon","satire","squib","libel","caricature"],"antonyms":["eulogy","panegyric","compliment"]}],"etymology":{"value":"Derived from 'Pasquino', the nickname of a Roman statue on which satirical verses were posted in the 16th century.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpæskwɪˈneɪdər/","syllables":"pas-qui-na-der"},"inflection":{"noun_plural":"pasquinaders"},"usage_notes":{"explanation":"'Pasquinader' refers to a specific type of satire that is often public and intended to mock or ridicule someone, especially a public figure. It is less common in modern usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wrote a pasquinader about the beauty of nature.","correct":"✓ He wrote a pasquinader about the absurdity of the political system.","note":"Pasquinaders are typically critical or satirical, not complimentary."}],"priority":"★★☆"},"related_words":{"derivatives":["pasquinade (noun: a satire or lampoon)","pasquinading (verb: the act of writing or posting satires)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pasquinader' is a sophisticated term referring to a satirical piece, often public, designed to mock or ridicule. Understanding this word requires familiarity with literary and historical contexts related to satire and public expression. It is rarely used in everyday conversation."},"example_sentences":[{"sentence":"The walls of the city were plastered with pasquinaders during the election.","translation":"選挙期間中、都市の壁は風刺文で覆われていた。","type":"noun","meaning_category":"風刺文"},{"sentence":"The anonymous pasquinader cleverly exposed the hypocrisy of the ruling class.","translation":"匿名の風刺文は、支配階級の偽善を巧妙に暴露した。","type":"noun","meaning_category":"風刺"}]}