{"word":"vitellus","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"卵黄","english_definition":"The yolk of an egg; the yellow, nutrient-rich portion of an egg that provides nourishment for the developing embryo.","examples":[{"sentence":"The vitellus provides essential nutrients for the developing chick.","translation":"卵黄は、発生中の雛に必要な栄養素を提供する。"},{"sentence":"The color of the vitellus can vary depending on the hen's diet.","translation":"卵黄の色は、鶏の餌によって異なることがある。"}],"collocations":["vitelline membrane","vitellogenesis","yolk sac"],"synonyms":["egg yolk","yolk"],"antonyms":[]}],"etymology":{"value":"From Latin 'vitellus', meaning 'little calf' or 'yolk of an egg'. The association with 'little calf' is thought to be due to the yolk's resemblance to a small, round object.","priority":"★★☆"},"pronunciation":{"ipa":"/vaɪˈtɛləs/","syllables":"vi-tel-lus"},"inflection":{"noun_plural":"vitelli (Latin plural)"},"usage_notes":{"explanation":"'Vitellus' is a scientific or technical term for egg yolk. It is less commonly used in everyday language than 'yolk'. It is typically encountered in biology, zoology, and culinary contexts when discussing the composition and function of eggs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The vitellus is white.","correct":"The vitellus is yellow.","note":"The vitellus, or yolk, is characteristically yellow, although the shade may vary."}],"priority":"★☆☆"},"related_words":{"derivatives":["vitelline (adjective: relating to the yolk of an egg)","vitellogenesis (noun: the formation of yolk in an egg)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Vitellus' is a technical term used in biology and culinary arts to specifically refer to the yolk of an egg. It's not a word commonly used in everyday conversation. Understanding this word is helpful when reading scientific literature or detailed descriptions of food preparation. It's important to remember that 'vitellus' and 'yolk' are essentially synonyms, but 'vitellus' is more formal and precise."},"example_sentences":[{"sentence":"The size of the vitellus influences the development of the embryo.","translation":"卵黄の大きさは、胚の発達に影響を与える。","type":"noun","meaning_category":"egg yolk"},{"sentence":"Vitellogenesis is the process by which the vitellus is formed in the ovary.","translation":"卵黄形成は、卵巣内で卵黄が形成される過程である。","type":"noun","meaning_category":"egg yolk"}]}