{"word":"Satanism","priority":"★★★☆ (Due to cultural significance and frequent misrepresentation)","categories":{"definition":{"value":"Satanism encompasses a diverse range of beliefs and practices, generally united by a rejection of traditional Abrahamic religious values and often, but not always, the symbolic use of Satan as a figure of rebellion, individualism, and earthly indulgence. It is *not* synonymous with devil worship.","priority":"★★★★★"},"historical_context":{"value":"The term 'Satanism' emerged in the mid-20th century, but roots can be traced to earlier anti-establishment and occult movements.  Early modern accusations of witchcraft often conflated various practices with devil worship, creating a historical association that continues to influence perceptions.","priority":"★★☆"},"major_branches":{"list":[{"name":"LaVeyan Satanism (The Church of Satan)","description":"Founded by Anton LaVey in 1969.  This is the most well-known form. It is a non-theistic religion that views Satan as an archetype representing individualism, carnal desires, and rejection of hypocrisy.  It focuses on self-indulgence and personal liberty, advocating for a pragmatic, materialistic worldview. Rituals are often psychological dramas intended to fulfill emotional needs.","key_beliefs":["Individualism","Self-indulgence","Pragmatism","Rejection of guilt","Social Darwinism"],"theistic_status":"Atheistic/Non-Theistic","priority":"★★★★★"},{"name":"The Satanic Temple (TST)","description":"Founded in 2013.  This is a politically active organization that uses Satanic imagery to advocate for religious freedom, social justice, and separation of church and state. They are not devil worshippers; their use of Satan is symbolic – representing the spirit of rebellion against arbitrary authority and promoting compassion, reason, and human rights. They often engage in protests and legal challenges.","key_beliefs":["Religious Freedom","Social Justice","Separation of Church and State","Compassion","Rationalism"],"theistic_status":"Generally Atheistic/Non-Theistic (some members may hold varying beliefs)","priority":"★★★★"},{"name":"Traditional Satanism (Luciferian Satanism)","description":"A less common branch that *does* involve the worship of a literal Satan or Lucifer as a deity. It often draws from various occult traditions, including ceremonial magic and grimoires.  This form is more likely to be associated with rituals aimed at contacting demonic entities.","key_beliefs":["Deity Worship (Satan/Lucifer)","Occultism","Ceremonial Magic","Spiritual Advancement"],"theistic_status":"Theistic","priority":"★★★☆"},{"name":"Other Forms","description":"Various individual practitioners and small groups exist with diverse interpretations of Satanism, often blending elements from different traditions. These can range from philosophical explorations to esoteric practices.","key_beliefs":"Highly Variable","theistic_status":"Variable","priority":"★★☆"}],"priority":"★★★★★"},"misconceptions":{"list":[{"myth":"Satanists are evil and practice human sacrifice.","reality":"This is a pervasive and false stereotype.  LaVeyan Satanism explicitly rejects human sacrifice, and most other branches do not engage in such practices. The Church of Satan condemns violence and illegal activities."},{"myth":"Satanists worship the Devil.","reality":"While some forms of Traditional Satanism involve deity worship, LaVeyan Satanism does *not*.  They see Satan as a symbol, not a literal being. The Satanic Temple also uses Satan symbolically."},{"myth":"Satanists are all criminals.","reality":"There is no correlation between Satanism and criminal behavior.  Members come from diverse backgrounds and professions."}],"priority":"★★★★★"},"symbolism":{"value":"Common symbols include the Sigil of Baphomet (a pentagram with a goat head), inverted pentacles, and various depictions of Satan or Lucifer.  The meaning of these symbols varies depending on the branch of Satanism.","priority":"★★☆"},"rituals_and_practices":{"value":"Rituals vary widely. LaVeyan Satanism focuses on psychological rituals intended to release emotional energy and affirm personal desires. The Satanic Temple uses protests, art installations, and legal challenges as forms of ritual action. Traditional Satanists may engage in ceremonial magic and invocation.","priority":"★★★☆"},"ethics_and_morality":{"value":"LaVeyan Satanism promotes a self-centered morality based on individual needs and desires.  The Nine Statements of the Church of Satan outline its ethical principles. The Satanic Temple emphasizes compassion, reason, and social responsibility.","priority":"★★★☆"},"social_impact":{"value":"Satanism has often been a target of moral panics and negative stereotypes.  However, organizations like The Satanic Temple have gained recognition for their advocacy work and challenges to religious discrimination.","priority":"★★☆☆"}},"resources_for_further_research":{"list":[{"name":"Church of Satan","url":"https://www.churchofsatan.com/"},{"name":"The Satanic Temple","url":"https://thesatanictemple.com/"}],"priority":"★★☆"}}