{"word":"plastiqueur","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(フランス語) プラスチック爆弾を使用するテロリスト、爆弾魔","english_definition":"(French) A terrorist who uses plastic explosives.","examples":[{"sentence":"Les services de renseignement étaient à la recherche du plastiqueur.","translation":"The intelligence services were searching for the plastiqueur.","note":"This is a French sentence demonstrating the word's usage."}],"collocations":[],"synonyms":["bomber","terrorist"],"antonyms":[]}],"etymology":{"value":"From French 'plastique' (plastic explosive) + '-eur' (agent suffix).","priority":"★★★"},"pronunciation":{"ipa":"/plas.ti.kœʁ/","syllables":"plas-ti-keur"},"inflection":{},"usage_notes":{"explanation":"This word is primarily used in French-speaking contexts and refers specifically to someone who employs plastic explosives, often in a terrorist or criminal capacity. It carries strong negative connotations.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["plastiquer (verb - to use plastic explosives)","plastique (noun - plastic explosive)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in specific contexts related to terrorism or criminal activity.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'plastiqueur' is a specialized term, primarily found in French, referring to someone who uses plastic explosives, typically in a terrorist or criminal context. Its usage is limited to situations involving such activities, making it a relatively rare word outside of these specific discussions."},"example_sentences":[{"sentence":"Le réseau de plastiqueurs a été démantelé par la police.","translation":"The network of plastiqueurs was dismantled by the police.","type":"noun","meaning_category":"terrorist"},{"sentence":"On suspecte un groupe de plastiqueurs d'être derrière cet attentat.","translation":"A group of plastiqueurs is suspected of being behind this attack.","type":"noun","meaning_category":"terrorist"}]}