{"word":"Upraisers","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"Plural form of upraiser. An upraiser is someone or something that elevates, lifts, or improves something else.","english_definition":"The plural form of 'upraiser,' referring to multiple entities that elevate, lift, or improve something.","examples":[{"sentence":"The upraisers of the community worked tirelessly to improve the local school.","translation":"地域社会の向上者たちは、地元の学校を改善するために精力的に活動しました。"},{"sentence":"These policies are designed to be the upraisers of economic standards for all citizens.","translation":"これらの政策は、すべての市民の経済水準を向上させるように設計されています。"}],"collocations":["community upraisers","economic upraisers","social upraisers"],"synonyms":["elevators","lifters","improvers","boosters"],"antonyms":["depressors","lowerers","worseners"]}],"etymology":{"value":"Derived from the verb 'uprise,' meaning to rise up or elevate, with the suffix '-er' indicating someone or something that performs the action.","priority":"N/A"},"pronunciation":{"ipa":"/ˈʌpˌreɪzərz/","syllables":"Up-rais-ers"},"inflection":{"noun_plural":"Upraisers"},"usage_notes":{"explanation":"'Upraisers' is a relatively uncommon term, typically used in formal or literary contexts to describe individuals or initiatives that contribute to the betterment or elevation of something, be it social, economic, or moral standards.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The upraiser of the building was completed.","correct":"The raising of the building was completed.","note":"'Upraiser' refers to the entity causing the elevation, not the act of elevation itself."}],"priority":"N/A"},"related_words":{"derivatives":["Uprise (verb)","Upraising (noun)"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'upraisers' is not commonly used, indicating a higher level of language proficiency. It refers to entities that elevate or improve something, often used in formal contexts."},"example_sentences":[{"sentence":"The social upraisers in the organization focused on improving employee morale.","translation":"組織内の社会的向上者たちは、従業員の士気を高めることに焦点を当てました。","type":"noun","meaning_category":"Elevators/Improvers"},{"sentence":"These economic policies act as upraisers for the country's standard of living.","translation":"これらの経済政策は、国の生活水準の向上者として機能します。","type":"noun","meaning_category":"Elevators/Improvers"}]}