{"word":"tenebroso","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(絵画様式などが)暗闇を強調した、陰影の強い","english_definition":"(of a painting style) characterized by strong contrasts of light and dark; dramatic and shadowy.","examples":[{"sentence":"The painting was done in the tenebroso style, with deep shadows and dramatic lighting.","translation":"その絵はテネブローソ様式で描かれており、深い影と劇的な照明が特徴です。"}],"collocations":["tenebroso style","tenebrist painting"],"synonyms":["chiaroscuro","shadowy","dark","dramatic"],"antonyms":["light","bright","illuminated"]},{"part_of_speech":"adjective","definition":"(文学作品などが)陰鬱な、暗い、恐ろしい","english_definition":"gloomy, dark, or frightening.","examples":[{"sentence":"The story had a tenebroso atmosphere, filled with suspense and dread.","translation":"その物語は陰鬱な雰囲気で、サスペンスと恐怖に満ちていました。"}],"collocations":["tenebroso atmosphere","tenebroso mood"],"synonyms":["gloomy","dark","somber","dreadful","frightening"],"antonyms":["cheerful","bright","pleasant"]}],"etymology":{"value":"Italian, from 'tenebre' meaning 'darkness, shadows,' from Latin 'tenebrae' (plural) 'darkness, shadows.'","priority":"★★★"},"pronunciation":{"ipa":"/ˌtɛnɪˈbroʊsoʊ/","syllables":"te-ne-bro-so"},"inflection":{"notes":"Adjective, so it can have comparative and superlative forms (more tenebroso, most tenebroso), although these are less common."},"usage_notes":{"explanation":"'Tenebroso' is primarily used in art history to describe a specific style of painting. It can also be used more broadly to describe a dark or gloomy atmosphere in literature or other art forms. The term emphasizes the use of strong contrasts between light and shadow to create a dramatic effect.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The weather was tenebroso.","correct":"The weather was gloomy.","note":"While 'tenebroso' can describe a gloomy atmosphere, it's more commonly used to describe a specific artistic style. 'Gloomy' is a more general term for dark weather."}],"priority":"★★☆"},"related_words":{"derivatives":["tenebrism (noun): the style or technique of painting with strong contrasts of light and dark."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in art history contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tenebroso' is a specialized term primarily used in the context of art history and criticism. It describes a painting style characterized by extreme contrasts of light and dark, creating a dramatic and often unsettling effect. While it can be used more broadly to describe a dark or gloomy atmosphere, this usage is less common. Understanding this word requires familiarity with art terminology and a higher level of vocabulary."},"example_sentences":[{"sentence":"Caravaggio was a master of the tenebroso style.","translation":"カラヴァッジョはテネブローソ様式の巨匠でした。","type":"adjective","meaning_category":"art style"},{"sentence":"The old castle had a tenebroso feel to it, with its dark corridors and hidden chambers.","translation":"その古い城は、暗い廊下と隠された部屋があり、陰鬱な雰囲気を醸し出していました。","type":"adjective","meaning_category":"atmosphere"}]}