{"word":"presacrifice","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(儀式などで)～を犠牲にする前に準備する、または予備的な犠牲を捧げる","english_definition":"To prepare or offer a preliminary sacrifice before another, usually more significant, sacrifice in a ritual context.","examples":[{"sentence":"The priest would presacrifice a small animal to appease the gods before the main offering.","translation":"司祭は主要な捧げ物の前に、神々をなだめるために小さな動物を予備的に犠牲にした。"},{"sentence":"In some cultures, they presacrifice certain items to ensure the success of the larger ritual.","translation":"いくつかの文化では、より大きな儀式の成功を確実にするために、特定の品物を犠牲にする前に準備をする。"}],"collocations":["presacrifice an animal","presacrifice an offering","presacrifice to the gods"],"synonyms":["prepare for sacrifice","pre-offer","preliminary offering"],"antonyms":["postsacrifice","desecrate","neglect sacrifice"]}],"etymology":{"value":"The word is formed by combining the prefix 'pre-' (meaning 'before') with the word 'sacrifice'. It literally means to sacrifice something beforehand.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːˈsækrɪfaɪs/","syllables":"pre-sac-ri-fice"},"inflection":{"verb_forms":{"present_simple":["presacrifice","presacrifices"],"past_simple":"presacrificed","past_participle":"presacrificed","present_participle":"presacrificing"}},"usage_notes":{"explanation":"'Presacrifice' is a relatively rare word, primarily used in anthropological or historical contexts when discussing religious rituals involving multiple stages of sacrifice. It implies a preparatory or lesser sacrifice made before a more important one.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They presacrificed the result of the experiment.","correct":"✓ They analyzed the data before drawing conclusions from the experiment.","note":"'Presacrifice' is specific to ritualistic sacrifice, not general preparation. Use 'analyze,' 'prepare,' or other contextually appropriate words for non-religious contexts."}],"priority":"★☆☆"},"related_words":{"derivatives":["sacrifice","presacrificial"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Very rare word)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Presacrifice' is a specialized term primarily encountered in academic or historical texts concerning religious practices. It denotes a preliminary act of sacrifice performed in anticipation of a more significant ritual offering. Due to its limited usage, it is not commonly found in general English discourse."},"example_sentences":[{"sentence":"Before the annual harvest festival, the villagers would presacrifice a portion of their crops to ensure a bountiful yield.","translation":"毎年恒例の収穫祭の前に、村人たちは豊かな収穫を確実にするために、収穫物の一部を犠牲にする前に準備をした。","type":"verb","meaning_category":"ritual preparation"},{"sentence":"Archaeological evidence suggests that the ancient civilization would presacrifice animals before constructing new temples.","translation":"考古学的証拠は、古代文明が新しい寺院を建設する前に動物を犠牲にする準備をしていたことを示唆している。","type":"verb","meaning_category":"religious practice"}]}