{"word":"apeek","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(古語) 準備万端の、用意のできた","english_definition":"(archaic) in a condition to be ready; in a state of expectation.","examples":[{"sentence":"The ship lay apeek, ready to sail with the morning tide.","translation":"その船は、朝の満潮とともに航海に出る準備万端の状態だった。"}],"collocations":[],"synonyms":["ready","prepared","expectant"],"antonyms":["unprepared","unready"]}],"etymology":{"value":"Middle English 'apeek', from 'a' (on) + 'peek' (a pointed end or position). Originally referred to the position of an anchor ready to be dropped.","priority":"★★★"},"pronunciation":{"ipa":"/əˈpiːk/","syllables":"a-peek"},"inflection":{},"usage_notes":{"explanation":"'Apeek' is an archaic term, primarily used in nautical contexts to describe the position of an anchor when it is directly below the bow of a ship, ready to be dropped. It can also generally mean 'in a state of readiness or expectation.' The term is rarely used in modern English outside of historical or nautical settings.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_terms":["peek (to look quickly or furtively)"],"nautical_terms":["anchor","bow"]},"level_frequency":{"CEFR":"N/A (archaic)","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Apeek' is a rarely used, archaic word, primarily found in historical or nautical literature. It means 'ready' or 'in a state of expectation,' often referring to an anchor positioned directly below a ship's bow, prepared to be dropped. Due to its limited usage, it is not part of common vocabulary. Understanding this word requires familiarity with historical language and nautical terminology."},"example_sentences":[{"sentence":"The captain ordered the anchor to be brought apeek.","translation":"船長は錨をapeekの状態にするよう命じた。","type":"adjective","meaning_category":"準備万端の"},{"sentence":"With sails furled and anchor apeek, the ship awaited the signal to depart.","translation":"帆を畳み、錨をapeekの状態にして、船は出発の合図を待っていた。","type":"adjective","meaning_category":"準備万端の"}]}