{"word":"dermography","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"皮膚描記症、皮膚に文字や図形を書いてもミミズ腫れのように跡が残る症状","english_definition":"A condition in which the skin becomes raised and inflamed when scratched or rubbed, creating a temporary welt or raised mark.","examples":[{"sentence":"She has dermography, so even a light scratch leaves a red mark on her skin.","translation":"彼女は皮膚描記症なので、軽く引っ掻いただけでも皮膚に赤い跡が残ります。"},{"sentence":"Dermography is usually harmless, but it can be itchy and uncomfortable.","translation":"皮膚描記症は通常無害ですが、かゆみを伴い不快に感じることがあります。"}],"collocations":["symptomatic dermography","artificial dermography"],"synonyms":["skin writing","dermatographic urticaria"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'derma' (skin) and 'grapho' (to write).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɜːrˈmɒɡrəfi/","syllables":"der-mo-gra-phy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Dermography is a skin condition characterized by the skin's hypersensitivity to physical pressure. When the skin is scratched, rubbed, or lightly pressured, it reacts by becoming raised and inflamed, forming a welt or raised mark that resembles a written inscription. This condition is also known as dermatographia or skin writing. It is generally harmless and temporary, but it can be itchy and uncomfortable.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has dermographism on his skin.","correct":"✓ He has dermography.","note":"Dermography is the correct term for the condition. Dermographism is an older, less common term."}],"priority":"★★☆"},"related_words":{"derivatives":["dermatographia","dermatographic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Dermography is a medical term referring to a skin condition where the skin reacts sensitively to pressure, causing raised marks when scratched. It's a relatively uncommon term, mainly used in medical contexts. Understanding the term requires some familiarity with medical terminology related to skin conditions."},"example_sentences":[{"sentence":"The doctor diagnosed her with dermography after observing the raised welts on her skin.","translation":"医師は彼女の皮膚にできたミミズ腫れを観察した後、皮膚描記症と診断しました。","type":"general","meaning_category":"medical condition"},{"sentence":"Dermography can sometimes be triggered by stress or allergies.","translation":"皮膚描記症は、ストレスやアレルギーによって引き起こされることがあります。","type":"general","meaning_category":"causes"}]}