{"word":"unbunched","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(束になっていない、まとめられていない) not formed into a bunch; separated from a bunch.","english_definition":"Not gathered or formed into a bunch or cluster; separated from a bunch.","examples":[{"sentence":"The flowers lay unbunched on the table.","translation":"花は束ねられずにテーブルの上に置かれていた。"},{"sentence":"She preferred the grapes unbunched, so she could eat them one at a time.","translation":"彼女はブドウが束になっていない方が、一つずつ食べられるので好きだった。"}],"collocations":["unbunched grapes","unbunched flowers","lie unbunched"],"synonyms":["separated","scattered","loose","detached"],"antonyms":["bunched","clustered","gathered","bundled"]}],"etymology":{"value":"The word 'unbunched' is formed by adding the prefix 'un-' (meaning 'not') to the word 'bunched'. 'Bunched' itself comes from the word 'bunch', which has origins in Middle English and possibly Old French.","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈbʌntʃt/","syllables":"un-buncht"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"'Unbunched' describes something that was previously, or could be, in a bunch, but is now loose or separated. It is often used to describe items like flowers, grapes, or other things that are typically sold or presented in bunches. The word emphasizes the lack of grouping or clustering.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unbunched of keys were scattered.","correct":"✓ The bunch of keys was scattered. / ✓ The keys were unbunched and scattered.","note":"'Unbunched' is an adjective, so it describes the state of being not bunched. It cannot be used as a noun like 'bunch'. If you want to refer to a group, use 'bunch'. If you want to describe the keys as not being in a bunch, use 'unbunched' as an adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["unbunch (verb): to separate from a bunch","bunch (noun): a group of things","bunched (adjective): formed into a bunch"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'unbunched' is a relatively uncommon adjective that means 'not formed into a bunch'. It is used to describe items that are usually found in clusters or groups but are now separated. Understanding the prefix 'un-' (meaning 'not') and the word 'bunched' is key to comprehending its meaning. It is most likely to be encountered in descriptive writing or contexts involving the arrangement of items like flowers or produce."},"example_sentences":[{"sentence":"The herbs were sold individually, completely unbunched.","translation":"ハーブは完全に束ねられずに、個別に販売されていた。","type":"adjective","meaning_category":"not in a bunch"},{"sentence":"She carefully removed the unbunched parsley from the bag.","translation":"彼女は袋から束になっていないパセリを注意深く取り出した。","type":"adjective","meaning_category":"not in a bunch"}]}