{"word":"interlocutory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(法律) 中間的な、訴訟手続きの途中の、本案判決に至る前の","english_definition":"(of a decree or judgment) given in an intermediate stage in a cause; provisional or temporary; not final.","examples":[{"sentence":"The court issued an interlocutory injunction to prevent the defendant from selling the property.","translation":"裁判所は、被告が財産を売却するのを防ぐため、中間的な差し止め命令を発行した。"},{"sentence":"An interlocutory appeal can be made during the course of a trial.","translation":"中間的な上訴は、裁判の過程で行うことができる。"},{"sentence":"The judge made an interlocutory ruling on the admissibility of evidence.","translation":"裁判官は、証拠の採用可能性について中間的な判決を下した。"}],"collocations":["interlocutory appeal (中間上訴)","interlocutory injunction (中間的差し止め命令)","interlocutory order (中間命令)","interlocutory judgment (中間判決)","interlocutory application (中間的申立て)"],"synonyms":["provisional","temporary","intermediate","preliminary","interim"],"antonyms":["final","definitive","conclusive"]}],"etymology":{"value":"ラテン語の\"interlocutorius\"（話の途中、会話の）に由来する。これは\"interloqui\"（話の間に挟む、会話する）から派生し、\"inter\"（間に）+ \"loqui\"（話す）から構成される。法律用語としては、訴訟手続きの「中間段階」で行われる決定や命令を指すようになった。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntərˈlɒkjətəri/","syllables":"in-ter-loc-u-to-ry"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"\"**interlocutory**\"は主に法律用語として使用され、訴訟や裁判手続きの途中で出される一時的な、または中間的な決定や命令を指します。これは、最終的な判決や決定が下される前に行われるものであり、手続きの進行を管理したり、一時的な措置を講じたりするために用いられます。日常会話ではほとんど使用されません。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The interlocutory decision was the final word on the matter.","correct":"✓ The final decision was the final word on the matter.","note":"Interlocutory decisions are by definition not final. They are intermediate rulings. Final decisions are the final word."},{"incorrect":"✗ He made an interlocutory comment during the meeting.","correct":"✓ He made an interrupting comment during the meeting.","note":"Interlocutory has a specific legal meaning. If you mean someone interrupted a meeting, use 'interrupting' or 'interjected'."}],"priority":"★★☆"},"related_words":{"derivatives":["interlocution (名詞: 会話、対話)","interlocutor (名詞: 対話者、話し相手)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (非常に専門的な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な法律文書以外ではほとんど見られない。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**interlocutory**」は、法律の分野で使われる専門的な言葉で、裁判や訴訟の手続きの途中で出される一時的な決定や命令のことを指します。これは、最終的な判決が出る前に行われるもので、手続きをスムーズに進めるためのものです。法律関係の文書や議論でしか使われない、難しい単語です。"},"example_sentences":[{"sentence":"The defendant filed an interlocutory appeal against the judge's ruling.","translation":"被告は、裁判官の判決に対して中間上訴を申し立てた。","type":"adjective","meaning_category":"法的"},{"sentence":"The court granted an interlocutory injunction to protect the plaintiff's interests.","translation":"裁判所は、原告の利益を保護するために中間的差し止め命令を出した。","type":"adjective","meaning_category":"法的"},{"sentence":"The interlocutory judgment addressed procedural matters rather than the merits of the case.","translation":"中間判決は、事件のメリットではなく、手続き上の問題に対処した。","type":"adjective","meaning_category":"法的"}]}