{"word":"de-domesticating","meanings":[{"part_of_speech":"verb (gerund or present participle)","definition":"家畜化を取りやめること、野生に戻すこと、または家庭的な環境から取り除くこと","english_definition":"The act of reversing domestication; returning something to a wild or non-domestic state; or removing something from a domestic or familiar environment.","examples":[{"sentence":"De-domesticating animals raised in captivity can be a complex process.","translation":"飼育下で育った動物を野生に戻すことは複雑なプロセスとなり得る。"},{"sentence":"The project focuses on de-domesticating urban spaces to promote biodiversity.","translation":"そのプロジェクトは、生物多様性を促進するために都市空間を非家庭的な空間に戻すことに焦点を当てている。"},{"sentence":"De-domesticating my routine involved breaking free from rigid schedules.","translation":"私のルーティンを非家庭的なものにすることは、厳格なスケジュールから解放されることを伴った。"}],"collocations":["de-domesticating animals","de-domesticating urban spaces","de-domesticating routines"],"synonyms":["rewilding","feralizing","un-domesticating","liberating","freeing"],"antonyms":["domesticating","taming","cultivating","confining"],"related_forms":["de-domesticate (verb)","de-domestication (noun)"]}],"etymology":{"value":"The word is formed by adding the prefix 'de-' (meaning 'reverse' or 'undo') to 'domesticating', which is the present participle of 'domesticate'. 'Domesticate' comes from the Latin word 'domesticus', meaning 'belonging to the house'.","priority":"medium"},"pronunciation":{"ipa":"/ˌdiːdəˈmɛstɪkeɪtɪŋ/","syllables":"de-do-mes-ti-cat-ing"},"inflection":{"notes":"This is the gerund or present participle form of the verb 'de-domesticate'."},"usage_notes":{"explanation":"'De-domesticating' can refer to a literal process of returning animals or plants to a wild state. It can also be used metaphorically to describe removing something from a familiar or comfortable environment. The term is often used in discussions about conservation, urban planning, and personal development.","priority":"high"},"common_mistakes":{"examples":[{"incorrect":"De-domesticating is easy.","correct":"De-domesticating animals is not always easy.","note":"'De-domesticating' as a gerund needs a clear subject or context. It's better to specify what is being de-domesticated."},{"incorrect":"The de-domesticating of the city.","correct":"The de-domestication of the city.","note":"The noun form is 'de-domestication', not 'de-domesticating'."}],"priority":"medium"},"related_words":{"derivatives":["de-domesticate","de-domestication"],"related_concepts":["rewilding","conservation","urban ecology","feral"],"priority":"high"},"level_frequency":{"level":"uncommon","note":"This term is not frequently used in general conversation but may appear in academic or specialized contexts related to ecology, animal behavior, or urban planning."},"readability_explanation":{"level":"C1","text":"'De-domesticating' is a complex term that refers to the process of reversing domestication, either literally with animals and plants or metaphorically with routines or spaces. It requires understanding the concept of domestication and the implications of undoing that process."},"example_sentences":[{"sentence":"De-domesticating previously farmed land can help restore native ecosystems.","translation":"以前に耕作されていた土地を野生に戻すことは、在来の生態系を回復させるのに役立つ。","type":"literal","context":"ecology"},{"sentence":"She's been de-domesticating her diet by incorporating more foraged foods.","translation":"彼女は、より多くの採取した食品を取り入れることで、食生活を非家庭的なものにしている。","type":"metaphorical","context":"lifestyle"},{"sentence":"De-domesticating the curriculum involves challenging traditional teaching methods.","translation":"カリキュラムを非家庭的なものにすることは、伝統的な教育方法に挑戦することを伴う。","type":"metaphorical","context":"education"}]}