{"word":"self-relation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自己関係、自己言及、自己参照","english_definition":"A relation between an entity and itself; the property of referring to oneself.","examples":[{"sentence":"The concept of self-relation is important in logic and computer science.","translation":"自己関係の概念は、論理学とコンピュータ科学において重要である。"},{"sentence":"Gödel's incompleteness theorems rely heavily on self-relation.","translation":"ゲーデルの不完全性定理は、自己関係に大きく依存している。"},{"sentence":"Self-relation can lead to paradoxes in formal systems.","translation":"自己関係は、形式体系においてパラドックスを引き起こす可能性がある。"}],"collocations":["self-relation in logic (論理学における自己関係)","self-relation in mathematics (数学における自己関係)","self-relation in computer science (コンピュータ科学における自己関係)","self-relation and paradox (自己関係とパラドックス)","the problem of self-relation (自己関係の問題)"],"synonyms":["self-reference","reflexivity","autorelationship"],"antonyms":["external relation","other-relation"]}],"etymology":{"value":"The term is formed by combining 'self' (referring to oneself) with 'relation' (a connection or association). It describes a relationship an entity has with itself.","priority":"★★★"},"pronunciation":{"ipa":"/ˌself rɪˈleɪʃən/","syllables":"self-re-la-tion"},"inflection":{"noun_plural":"self-relations"},"usage_notes":{"explanation":"'Self-relation' is a technical term primarily used in fields like logic, mathematics, computer science, and philosophy. It describes a situation where something relates to, refers to, or acts upon itself. This concept is often associated with paradoxes and is crucial for understanding certain theoretical limits in formal systems.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The self-relation of the object was obvious.","correct":"✓ The self-relation of the set was obvious.","note":"'Self-relation' is typically used in the context of sets, relations, functions, or statements, rather than physical objects. While not strictly incorrect, it's more common in abstract contexts."},{"incorrect":"✗ He had a good self-relation.","correct":"✓ He had a good self-image.","note":"'Self-relation' should not be confused with 'self-esteem' or 'self-image,' which refer to one's perception of oneself. 'Self-relation' is more about a formal, logical connection."}],"priority":"★★☆"},"related_words":{"derivatives":["self-referential (adjective: 自己言及的な)","self-referentially (adverb: 自己言及的に)","relation (noun: 関係)","relative (adjective: 相対的な)"],"phrasal_verbs":[],"related_concepts":["Gödel's incompleteness theorems","Russell's paradox","recursion","fixed-point combinator"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Technical vocabulary)","frequency_google_ngram":"Low frequency (専門用語)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Self-relation' is a specialized term primarily encountered in advanced academic contexts, particularly in logic, mathematics, computer science, and philosophy. It signifies a relationship an entity has with itself, often involving concepts like self-reference and recursion. Understanding this term requires familiarity with abstract reasoning and formal systems. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The liar paradox is a classic example of the problems that can arise from self-relation.","translation":"嘘つきのパラドックスは、自己関係から生じる可能性のある問題の典型的な例である。","type":"noun","meaning_category":"自己関係とパラドックス"},{"sentence":"In relational databases, self-relation can be used to model hierarchical data structures.","translation":"リレーショナルデータベースでは、自己関係を使用して階層的なデータ構造をモデル化できる。","type":"noun","meaning_category":"自己関係 in computer science"},{"sentence":"The function exhibits self-relation by calling itself recursively.","translation":"その関数は、それ自身を再帰的に呼び出すことによって自己関係を示す。","type":"noun","meaning_category":"自己関係 in mathematics"},{"sentence":"The concept of self-relation is crucial for understanding the limits of formal systems.","translation":"自己関係の概念は、形式体系の限界を理解するために不可欠である。","type":"noun","meaning_category":"自己関係 in logic"}]}