{"word":"clottable","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"凝固可能な、凝固しやすい","english_definition":"Capable of being clotted; able to coagulate.","examples":[{"sentence":"The patient's blood was clottable, which was a good sign after the surgery.","translation":"手術後、患者の血液が凝固可能であったことは良い兆候でした。"},{"sentence":"Clottable proteins are essential for wound healing.","translation":"凝固可能なタンパク質は創傷治癒に不可欠です。"}],"collocations":["clottable blood","clottable protein","clottable fibrinogen"],"synonyms":["coagulable","thickening","solidifying"],"antonyms":["unclottable","anticoagulant","thinning"]}],"etymology":{"value":"Derived from the verb 'clot' (to form a lump or mass) and the suffix '-able' (capable of being).","priority":"N/A"},"pronunciation":{"ipa":"/ˈklɒtəbəl/","syllables":"clot-ta-ble"},"inflection":{"adjective_forms":{"comparative":"more clottable","superlative":"most clottable"}},"usage_notes":{"explanation":"'Clottable' is primarily used in medical or scientific contexts to describe substances, especially blood or proteins, that have the ability to form clots. It indicates a characteristic or property rather than a state.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The clottable was applied to the wound.","correct":"✓ A clottable substance was applied to the wound.","note":"'Clottable' is an adjective, so it must modify a noun. Using it as a noun is incorrect."},{"incorrect":"✗ The blood is clotting, so it is clottable.","correct":"✓ The blood is clotting, demonstrating that it is clottable.","note":"'Clotting' is the process of forming a clot; 'clottable' describes the inherent ability to clot."}],"priority":"★★☆"},"related_words":{"derivatives":["clot (noun, verb)","clotted (adjective)","clotting (noun, verb)","clottability (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in specialized medical or scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Clottable' is a technical term primarily used in medical and scientific contexts. It means that a substance, such as blood, has the ability to form clots. Understanding this term requires knowledge of basic biological processes, particularly blood coagulation. It's not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The doctor checked if the patient's blood was sufficiently **clottable** before the surgery.","translation":"医師は手術前に患者の血液が十分に凝固可能かどうかを確認した。","type":"adjective","meaning_category":"medical"},{"sentence":"Fibrinogen is a **clottable** protein that plays a crucial role in blood coagulation.","translation":"フィブリノーゲンは血液凝固において重要な役割を果たす凝固可能なタンパク質である。","type":"adjective","meaning_category":"scientific"}]}