{"word":"cyclorama","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(劇場などの)背景幕、円形劇場","english_definition":"a large curtain or wall, often concave, positioned at the back of the stage in a theatre or studio, used to create the illusion of limitless space or a background. Also, a building with a continuous panoramic scene on the inner walls.","examples":[{"sentence":"The cyclorama was painted to resemble a distant landscape.","translation":"その背景幕は遠くの風景に似せて描かれていた。"},{"sentence":"The theatre's cyclorama provided a seamless backdrop for the play.","translation":"その劇場の背景幕は、劇に継ぎ目のない背景を提供した。"},{"sentence":"The museum featured a cyclorama depicting a famous battle.","translation":"その博物館は、有名な戦いを描いた円形劇場を展示していた。"}],"collocations":["theatre cyclorama","studio cyclorama","paint a cyclorama","install a cyclorama","panoramic cyclorama"],"synonyms":["backdrop","background","panorama","diorama"],"antonyms":[]},{"part_of_speech":"noun","definition":"(写真撮影で用いる)背景","english_definition":"a background used in photography or filmmaking, often seamless and curved to eliminate corners.","examples":[{"sentence":"The photographer used a white cyclorama to create a clean, minimalist portrait.","translation":"写真家は、白の背景を使って、クリーンでミニマリストなポートレートを作成した。"},{"sentence":"The seamless cyclorama allowed for easy keying in post-production.","translation":"継ぎ目のない背景は、ポストプロダクションでの簡単なキーイングを可能にした。"}],"collocations":["photography cyclorama","seamless cyclorama","studio cyclorama","white cyclorama","green screen cyclorama"],"synonyms":["background","backdrop"],"antonyms":[]}],"etymology":{"value":"From Greek kyklos (circle) + horama (view). Originally referred to a circular panorama.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsaɪkləˈrɑːmə/","syllables":"cy-clo-ra-ma"},"inflection":{"noun_plural":"cycloramas"},"usage_notes":{"explanation":"A **cyclorama** is primarily a theatrical term, referring to a large background curtain or wall used to create a sense of space. In photography and film, it refers to a seamless background, often curved, used to eliminate corners and create a clean, uniform look. The term can also refer to a building housing a panoramic painting.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a panorama in the cyclorama.","correct":"✓ I saw a panorama on the cyclorama.","note":"The cyclorama *is* the panoramic background, so you see a panorama *on* it, not *in* it."}],"priority":"★★☆"},"related_words":{"derivatives":["cycloramic (adjective)"],"phrasal_verbs":[],"related_terms":["panorama","diorama","backdrop","background","green screen"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"**cyclorama**\" refers to a large background used in theaters, photography, or film to create a sense of space or a clean backdrop. It can also refer to a building with a panoramic scene on the inner walls. It's a relatively specialized term, so you're more likely to encounter it in discussions about the arts, media production, or historical attractions."},"example_sentences":[{"sentence":"The stage was set with a vast cyclorama, depicting a stormy sky.","translation":"舞台には、嵐の空を描いた広大な背景幕が設置されていた。","type":"noun","meaning_category":"theatre backdrop"},{"sentence":"The photographer used a cyclorama to create a seamless white background for the portrait.","translation":"写真家は、ポートレートの継ぎ目のない白い背景を作成するために背景を使った。","type":"noun","meaning_category":"photography background"},{"sentence":"The museum's cyclorama offered a 360-degree view of the historical event.","translation":"博物館の円形劇場は、歴史的イベントの360度の眺めを提供した。","type":"noun","meaning_category":"circular building"}]}