{"word":"bidarkees","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(plural only) A type of loose-fitting, waterproof jacket traditionally worn by the Aleut people of Alaska.","english_definition":"A type of loose-fitting, waterproof jacket traditionally worn by the Aleut people of Alaska.","examples":[{"sentence":"The museum displayed several examples of intricately sewn bidarkees.","translation":"博物館には、複雑に縫われたビダルキーズのいくつかの例が展示されていました。"}],"collocations":[],"synonyms":["parka","anorak"],"antonyms":[]}],"etymology":{"value":"Derived from the Russian word \"байдара\" (baydara), referring to a type of skin boat used by the Aleut people, and the suffix \"-kee\" or \"-kes\" indicating something related to or used with the boat.","priority":"★★☆"},"pronunciation":{"ipa":"/bɪˈdɑːrkiːz/","syllables":"bi-dar-kees"},"inflection":{"noun_plural":"bidarkees (already plural)"},"usage_notes":{"explanation":"'Bidarkees' is a plural-only noun, referring to a specific type of traditional waterproof jacket. It is closely associated with the Aleut culture of Alaska and is often made from animal intestines or other waterproof materials.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Aleut","Alaska","kayak","waterproof clothing"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bidarkees' refers to a specific type of waterproof jacket worn by the Aleut people. It is a relatively uncommon word, primarily used in contexts related to Alaskan indigenous cultures or historical clothing. Understanding this word requires some familiarity with the Aleut people and their traditions."},"example_sentences":[{"sentence":"The Aleut hunters wore bidarkees to protect themselves from the harsh weather.","translation":"アリュートの猟師たちは、厳しい天候から身を守るためにビダルキーズを着用していました。","type":"noun","meaning_category":"waterproof jacket"}]}