{"word":"non-numerability","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"非可算性、数えられないこと","english_definition":"The state or property of being non-numerable; the inability to be put into one-to-one correspondence with the natural numbers.","examples":[{"sentence":"The non-numerability of the real numbers was proven by Cantor.","translation":"実数の非可算性はカントールによって証明された。"},{"sentence":"Understanding non-numerability is crucial in advanced mathematics.","translation":"非可算性を理解することは、高度な数学において重要である。"}],"collocations":["prove non-numerability","demonstrate non-numerability","establish non-numerability"],"synonyms":["uncountability","non-denumerability"],"antonyms":["numerability","countability","denumerability"]}],"etymology":{"value":"Formed from \"non-\" (prefix meaning 'not'), \"numerable\" (able to be counted), and \"-ability\" (suffix indicating a state or quality).","priority":"N/A"},"pronunciation":{"ipa":"/ˌnɒnˌnjuːmərəˈbɪləti/","syllables":"non-nu-mer-a-bil-i-ty"},"inflection":{"noun_plural":"non-numerabilities (rare)"},"usage_notes":{"explanation":"\"Non-numerability\" is a technical term primarily used in mathematics, specifically in set theory. It refers to sets that are 'too large' to be counted, meaning their elements cannot be put into a one-to-one correspondence with the set of natural numbers (1, 2, 3, ...). A classic example is the set of real numbers. The concept is closely related to the idea of infinity and different 'sizes' of infinity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-numerability is easy to understand.","correct":"✓ The concept of non-numerability is easy to understand.","note":"\"Non-numerability\" is an abstract property, not a concrete object. Therefore, it's better to refer to the \"concept of non-numerability\" or something similar."}],"priority":"★☆☆"},"related_words":{"derivatives":["numerable","numerable set","non-numerable set"],"related_concepts":["countability","uncountability","cardinality","set theory","Cantor's diagonal argument","infinity"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Very specialized vocabulary)","frequency_google_ngram":"Low frequency (specialized mathematical term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Non-numerability\" is a term used in advanced mathematics, particularly in set theory. It describes the property of a set that cannot be put into a one-to-one correspondence with the natural numbers. This means you can't count the elements of the set in a simple, sequential way. The concept is important for understanding different types of infinity and the sizes of infinite sets. It is typically encountered in university-level mathematics courses.","priority":"★★☆"},"example_sentences":[{"sentence":"The proof of the non-numerability of the continuum is a cornerstone of modern analysis.","translation":"連続体の非可算性の証明は、現代解析学の基礎である。","type":"noun","meaning_category":"非可算性"},{"sentence":"The concept of non-numerability challenges our intuitive understanding of counting.","translation":"非可算性の概念は、私たちの数えることに対する直感的な理解に挑戦する。","type":"noun","meaning_category":"非可算性"}]}