{"word":"monopod","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"一脚（いっきゃく）","english_definition":"A single supporting pole or leg, especially one used as a camera support.","examples":[{"sentence":"He used a monopod to stabilize his camera while shooting wildlife.","translation":"彼は野生動物を撮影する間、カメラを安定させるために一脚を使った。"},{"sentence":"A monopod is lighter and more portable than a tripod.","translation":"一脚は三脚よりも軽くて持ち運びが簡単だ。"}],"collocations":["camera monopod","walking monopod","extendable monopod"],"synonyms":["unipod"],"antonyms":["tripod","bipod"]},{"part_of_speech":"noun","definition":"（SFなどで）一本足の生物、一本足の乗り物","english_definition":"A hypothetical creature or vehicle with only one leg.","examples":[{"sentence":"The science fiction story featured bizarre monopod creatures hopping across the alien landscape.","translation":"そのSF小説には、異星の風景を飛び跳ねる奇妙な一本足の生物が登場した。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'mono-' (meaning 'one') + '-pod' (meaning 'foot').","priority":"★★★"},"pronunciation":{"ipa":"ˈmɒnəpɒd","syllables":"mo-no-pod"},"inflection":{"noun_plural":"monopods"},"usage_notes":{"explanation":"A monopod is primarily used as a lightweight and portable alternative to a tripod, especially for photography and videography. It provides stability while allowing for greater mobility than a tripod. The term can also refer to a hypothetical creature or vehicle with a single leg, though this usage is less common.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"I used a monopod to take a picture of my feet.","correct":"I used a monopod to take a picture with my camera.","note":"Monopods are used to support cameras, not to take pictures of feet."}],"priority":"★★☆"},"related_words":{"derivatives":["monopodal (adjective)"],"phrasal_verbs":[],"related_terms":["tripod","bipod","camera accessories"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word \"monopod\" is a technical term, primarily used in the context of photography and videography. It refers to a single-legged support used to stabilize cameras. While not a common word in everyday conversation, it is important to understand within specific technical contexts. It can also refer to a fictional one-legged creature, but this usage is rare."},"example_sentences":[{"sentence":"The photographer preferred a monopod because it was easier to carry on long hikes.","translation":"その写真家は、長時間のハイキングで持ち運びが簡単なため、一脚を好んだ。","type":"noun","meaning_category":"camera support"},{"sentence":"The documentary showed a time-lapse of the city, shot using a monopod for stability.","translation":"そのドキュメンタリーでは、安定性を保つために一脚を使って撮影された都市のタイムラプス映像が上映された。","type":"noun","meaning_category":"camera support"},{"sentence":"In the fantasy novel, the hero encountered a strange monopod creature that hopped across the plains.","translation":"そのファンタジー小説では、主人公は平原を飛び跳ねる奇妙な一本足の生物に出会った。","type":"noun","meaning_category":"one-legged creature"}]}