{"word":"sanctification","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"聖化、神聖化、清浄化","english_definition":"The act or process of being made holy or set apart for God; the state of being holy or sanctified.","examples":[{"sentence":"Sanctification is a lifelong process for Christians.","translation":"聖化はキリスト教徒にとって生涯にわたるプロセスです。"},{"sentence":"The sanctification of the temple was a solemn occasion.","translation":"神殿の聖化は厳粛な出来事でした。"},{"sentence":"Through faith in Christ, we experience justification and sanctification.","translation":"キリストへの信仰を通して、私たちは義認と聖化を経験します。"}],"collocations":["process of sanctification (聖化の過程)","lifelong sanctification (生涯にわたる聖化)","progressive sanctification (漸進的な聖化)","personal sanctification (個人の聖化)"],"synonyms":["holiness","consecration","purification","hallowing","blessing"],"antonyms":["desecration","profanation","defilement"]}],"etymology":{"value":"Late Middle English: from Old French, from Latin sanctificare ‘make holy’ (see sanctify).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsæŋktɪfɪˈkeɪʃən/","syllables":"sanc-ti-fi-ca-tion"},"inflection":{"noun_plural":"sanctifications"},"usage_notes":{"explanation":"Sanctification refers to the process by which a person becomes more and more like Christ, growing in holiness and righteousness. It is distinct from justification, which is the act by which God declares a person righteous in His sight. Sanctification is an ongoing work of the Holy Spirit in the believer's life. It involves both the putting off of sinful habits and the putting on of Christ-like virtues.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Sanctification is achieved instantly upon conversion.","correct":"Sanctification is a process that begins at conversion and continues throughout life.","note":"Sanctification is not a one-time event but a gradual process. Justification is immediate, but sanctification is progressive."},{"incorrect":"We can achieve complete sanctification in this life.","correct":"Complete sanctification will not be fully realized until we are glorified in heaven.","note":"While we strive for holiness, we will not be completely free from sin until we are in God's presence."}],"priority":"★★☆"},"related_words":{"derivatives":["sanctify (verb: 聖化する、神聖にする)","sanctified (adjective: 聖化された、神聖な)","sanctifying (adjective: 聖化する、神聖にする)","sanctifier (noun: 聖化する人、聖霊)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sanctification' is a theological term referring to the process of becoming holy or more like God. It's often used in religious contexts, particularly in Christianity, to describe the gradual transformation of a believer's character. It's a more advanced concept than simply being 'good' or 'moral,' as it implies a specific relationship with the divine and a deliberate effort to align oneself with God's will. You'll typically encounter this word in discussions about faith, spirituality, and ethics within a religious framework."},"example_sentences":[{"sentence":"The pastor emphasized the importance of sanctification in the daily lives of believers.","translation":"牧師は信者の日常生活における聖化の重要性を強調した。","type":"noun","meaning_category":"聖化"},{"sentence":"Through prayer and study of the scriptures, we can grow in sanctification.","translation":"祈りと聖書の学びを通して、私たちは聖化において成長することができる。","type":"noun","meaning_category":"聖化"},{"sentence":"The church encouraged its members to pursue sanctification through service to others.","translation":"教会は会員に対し、他者への奉仕を通して聖化を追求するよう奨励した。","type":"noun","meaning_category":"聖化"}]}