{"word":"Amphiboly","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"両義性、曖昧な文構造による誤謬","english_definition":"Ambiguity arising from faulty sentence structure, as opposed to ambiguity of a single word.","examples":[{"sentence":"The statement 'I saw the man on the hill with a telescope' suffers from amphiboly because it's unclear whether the man or I had the telescope.","translation":"「私は望遠鏡で丘の上の男を見た」という文は、男が望遠鏡を持っていたのか、私が見るために望遠鏡を使ったのかが不明確なため、両義性（文構造の曖昧さ）に苦しんでいる。"},{"sentence":"Amphiboly can lead to misunderstandings in legal documents if not carefully worded.","translation":"注意深く言葉を選ばないと、両義性は法的文書における誤解につながる可能性がある。"}],"collocations":["commit an amphiboly","avoid amphiboly","structural ambiguity","syntactic ambiguity"],"synonyms":["ambiguity","equivocation","double meaning","vagueness","uncertainty"],"antonyms":["clarity","precision","unambiguity","certainty"]}],"etymology":{"value":"Derived from the Greek word 'amphibolia', meaning 'ambiguity' or 'double meaning'. This comes from 'amphibolos', meaning 'throwing on both sides' or 'equivocal'.","priority":"★★☆"},"pronunciation":{"ipa":"/æmˈfɪbəli/","syllables":"am-phi-bo-ly"},"inflection":{"noun_plural":"amphibolies"},"usage_notes":{"explanation":"Amphiboly refers specifically to ambiguity that arises from the grammatical structure of a sentence, not from the multiple meanings of a single word (which would be equivocation). It's a type of logical fallacy that can occur when a sentence can be interpreted in more than one way due to its syntax.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The word 'bank' has amphiboly because it can mean a financial institution or the side of a river.","correct":"✓ The word 'bank' has equivocation because it can mean a financial institution or the side of a river.","note":"'Bank' illustrates equivocation (word-level ambiguity), not amphiboly (structural ambiguity)."},{"incorrect":"✗ Amphiboly is when you use big words to confuse people.","correct":"✓ Amphiboly is when the structure of a sentence allows for multiple interpretations.","note":"Amphiboly isn't about using complex vocabulary; it's about flawed sentence construction. "}],"priority":"★☆☆"},"related_words":{"derivatives":["amphibolic (adjective)"],"phrasal_verbs":[],"related_concepts":["equivocation","fallacy","logic","semantics","syntax"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Amphiboly' is a term used in logic and rhetoric to describe a situation where a sentence is ambiguous due to its grammatical structure, leading to multiple possible interpretations. It's different from simple word ambiguity (equivocation) because the problem lies in how the words are arranged, not in the words themselves. Understanding amphiboly helps in identifying and avoiding logical fallacies in arguments and communication."},"example_sentences":[{"sentence":"The fortune teller's prediction suffered from amphiboly, leaving us unsure of what she really meant.","translation":"占い師の予言は両義性があり、彼女が本当に何を意味していたのか私たちにはわからなかった。","type":"noun","meaning_category":"ambiguity"},{"sentence":"To avoid amphiboly, rewrite the sentence to make the meaning clear.","translation":"両義性を避けるために、意味が明確になるように文を書き換えてください。","type":"noun","meaning_category":"avoidance"},{"sentence":"The contract was challenged due to amphiboly in one of its key clauses.","translation":"契約書の主要条項の一つに両義性があったため、異議が申し立てられた。","type":"noun","meaning_category":"legal challenge"}]}