{"word":"paranormally","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"超常現象的に、超自然的に","english_definition":"In a way that is beyond the scope of normal scientific understanding; relating to events or abilities that cannot be explained by what is known about nature and science.","examples":[{"sentence":"The house was said to be paranormally active, with objects moving on their own.","translation":"その家は超常現象が活発だとされ、物が勝手に動いていた。"},{"sentence":"She claimed she could paranormally communicate with the deceased.","translation":"彼女は死者と超常現象的にコミュニケーションできると主張した。"}],"collocations":["paranormally active (超常現象的に活発な)","paranormally gifted (超常現象的な才能に恵まれた)"],"synonyms":["supernaturally","mysteriously","inexplicably","anomalously"],"antonyms":["naturally","normally","scientifically","rationally"]}],"etymology":{"value":"'Paranormal' (beyond the range of normal experience or scientific explanation) + '-ly' (suffix forming adverbs). 'Paranormal' itself comes from 'para-' (beside, beyond) + 'normal'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpærənɔːrˈmæli/","syllables":"par-a-nor-mal-ly"},"inflection":{"notes":"This is an adverb, so it does not inflect."},"usage_notes":{"explanation":"'Paranormally' describes actions or states that defy conventional scientific or natural explanations. It is often used in contexts related to ghosts, ESP, psychic abilities, and other phenomena that are considered outside the realm of ordinary experience. The word implies a belief in forces or abilities that are not recognized by mainstream science.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He paranormally felt happy.","correct":"✓ He felt inexplicably happy.","note":"'Paranormally' refers to events or abilities that are beyond scientific explanation, not just feelings. Use 'inexplicably' for feelings that can't be explained. "},{"incorrect":"✗ The weather was paranormally good.","correct":"✓ The weather was unusually good.","note":"'Paranormally' is not a substitute for 'unusually' or 'exceptionally'. It specifically refers to things that defy scientific understanding."}],"priority":"★★☆"},"related_words":{"derivatives":["paranormal (adjective, noun)","paranormalcy (noun)"],"phrasal_verbs":[],"related_concepts":["ESP (extrasensory perception)","telekinesis","ghost hunting","haunted houses","psychic phenomena","supernatural","occult"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'paranormally' is used to describe something happening in a way that goes beyond what science can explain. It's often used when talking about ghosts, psychic abilities, or other things that seem supernatural. It suggests that something is happening that isn't normal or natural. It's not a common word in everyday conversation, but you might hear it in discussions about unexplained mysteries or supernatural events."},"example_sentences":[{"sentence":"The door closed paranormally, even though no one was near it.","translation":"誰も近くにいなかったのに、ドアが超常現象的に閉まった。","type":"adverb","meaning_category":"supernatural event"},{"sentence":"She claimed that the information came to her paranormally, not through research.","translation":"彼女は、その情報は調査ではなく、超常現象的に得られたと主張した。","type":"adverb","meaning_category":"psychic ability"}]}