{"word":"Manualism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"手話主義：聴覚障害者の教育において、音声言語ではなく手話を用いることを重視する教育方法。","english_definition":"An educational philosophy and method advocating the use of sign language, rather than oral methods, in the education of deaf individuals.","examples":[{"sentence":"Manualism was a dominant approach in deaf education for a period.","translation":"手話主義は、ある時期において聴覚障害者教育の主流なアプローチでした。"},{"sentence":"The debate between manualism and oralism has a long history in deaf education.","translation":"手話主義と口話法の間の議論は、聴覚障害者教育において長い歴史を持っています。"}],"collocations":["deaf education (聴覚障害者教育)","sign language (手話)","oralism (口話法)","total communication (完全コミュニケーション)"],"synonyms":["sign language education","visual-gestural communication"],"antonyms":["oralism"]}],"etymology":{"value":"\"Manual\"（手の）+ \"-ism\"（主義）から構成される。手の動き、すなわち手話を用いることを中心とする主義を表す。","priority":"★★☆"},"pronunciation":{"ipa":"ˈmænjuəlɪzəm","syllables":"Man-u-al-ism"},"inflection":{"notes":"名詞のため、複数形は通常ありません。"},"usage_notes":{"explanation":"\"Manualism\"は、聴覚障害者の教育方法に関する専門用語です。対立する概念として、音声言語の習得を重視する\"Oralism\"（口話法）があります。近年では、手話と音声言語の両方を用いる\"Total Communication\"（完全コミュニケーション）というアプローチも一般的になっています。この用語は、教育学、言語学、社会学などの分野で用いられます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Manualism is about fixing things with your hands.","correct":"✓ Manualism is an educational approach that uses sign language for deaf education.","note":"\"Manualism\"は、手作業で何かを修理したり作ったりすることではありません。聴覚障害者教育における手話の使用を指します。"},{"incorrect":"✗ Manualism is the same as total communication.","correct":"✓ Manualism focuses primarily on sign language, while total communication uses both sign language and oral methods.","note":"\"Manualism\"は手話の使用に重点を置きますが、\"Total Communication\"は手話と口話の両方を使用します。"}],"priority":"★★☆"},"related_words":{"derivatives":["manualist (手話主義者)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Manualism\"は、聴覚障害者の教育において、手話を主要なコミュニケーション手段として用いる教育方法を指す専門用語です。このアプローチは、音声言語の習得を重視する\"oralism\"（口話法）とは対照的です。近年では、手話と音声言語の両方を用いる\"total communication\"（完全コミュニケーション）というアプローチも一般的になっています。この用語は、教育学、言語学、社会学などの分野で用いられます。専門的な文脈で使用されるため、一般的な会話ではあまり使われません。"},"example_sentences":[{"sentence":"The school adopted a manualism approach to support deaf students' language development.","translation":"その学校は、聴覚障害のある生徒の言語発達を支援するために、手話主義のアプローチを採用しました。","type":"noun","meaning_category":"手話主義"},{"sentence":"Critics of manualism argue that it can limit deaf individuals' integration into mainstream society.","translation":"手話主義の批判者たちは、それが聴覚障害のある人々の社会への統合を制限する可能性があると主張しています。","type":"noun","meaning_category":"手話主義"}]}