{"word":"mestee","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的) 白人とアフリカ系アメリカ人の混血の人。特に、外見上は主に白人に見える人。","english_definition":"(historical) A person of mixed white and African American ancestry, especially one appearing to be mostly of European ancestry.","examples":[{"sentence":"The term 'mestee' was used to describe individuals with one-quarter African ancestry.","translation":"「メスティー」という言葉は、アフリカ系の血を4分の1引いている人を指すのに使われていました。"},{"sentence":"In some historical contexts, mestees were treated differently from those with more visible African heritage.","translation":"歴史的な文脈によっては、メスティーは、より目に見えるアフリカ系の遺産を持つ人々とは異なる扱いを受けていました。"}],"collocations":[],"synonyms":["mulatto","quadroon","octoroon"],"antonyms":[]}],"etymology":{"value":"スペイン語の「mestizo」に由来する。これはラテン語の「mixticius」（混合された）から派生した「mixtus」（混合）に由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/mɛˈstiː/","syllables":"mes-tee"},"inflection":{"noun_plural":"mestees"},"usage_notes":{"explanation":"「**mestee**」という用語は、歴史的な文脈で使用され、現在では一般的に時代遅れで、場合によっては不快と見なされます。より現代的で尊重される用語は、文脈に応じて「mixed-race」または「biracial」です。この単語は、人種的分類の複雑さと、混血の人々に対する差別的な態度を反映しています。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He identified as a mestee, even though he had no African ancestry.","correct":"✓ He identified as mixed-race.","note":"「mestee」という用語は、白人とアフリカ系アメリカ人の血統の混合を指すため、アフリカ系の血統がない人には不適切です。"},{"incorrect":"✗ Mestee is a commonly used term in modern racial discussions.","correct":"✓ The term 'mestee' is considered outdated and can be offensive.","note":"「mestee」という用語は、現代の人種に関する議論では一般的ではなく、時代遅れと見なされる可能性があります。"}],"priority":"★★☆"},"related_words":{"derivatives":["mestizo"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度 (Low frequency) - 歴史的な文脈でのみ使用されることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**mestee**」という言葉は、白人とアフリカ系アメリカ人の血が混ざった人を指す歴史的な用語です。特に、外見上は主に白人に見える人を指します。この言葉は、現代では時代遅れで、場合によっては不快と見なされるため、使用は避けるべきです。代わりに、「mixed-race」や「biracial」などの、より現代的で尊重される用語を使用してください。この言葉の理解は、歴史的な文脈を理解する上で役立ちますが、現代の会話では使用を避けるべきです。"},"example_sentences":[{"sentence":"The historical records mentioned several mestees who were able to pass as white.","translation":"歴史的な記録には、白人として通ることができたメスティーが何人か言及されていた。","type":"noun","meaning_category":"混血の人 (歴史的)"}]}