{"word":"ametrometer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(まれ)韻律の規則に従わない詩、または韻律の規則に従わない詩を書く人","english_definition":"(rare) A poem which does not conform to metrical rules; or a writer of such poems.","examples":[{"sentence":"His poems were dismissed as ametrometer by the critics.","translation":"彼の詩は批評家によって韻律を無視した詩として退けられた。"},{"sentence":"He was known as an ametrometer, often breaking the established poetic forms.","translation":"彼は韻律を無視する詩人として知られ、確立された詩形をしばしば破った。"}],"collocations":["an example of ametrometer","be dismissed as ametrometer","known as an ametrometer"],"synonyms":["free verse","nonmetrical verse"],"antonyms":["metrical verse","strict meter"]},{"part_of_speech":"noun","definition":"(眼科)屈折計、視力測定器","english_definition":"(ophthalmology) An instrument for measuring errors of refraction in the eye.","examples":[{"sentence":"The optometrist used an ametrometer to determine the patient's prescription.","translation":"検眼医は、患者の処方を決定するためにアメトロメーターを使用した。"},{"sentence":"Ametrometer readings indicated a significant astigmatism.","translation":"アメトロメーターの測定値は、著しい乱視を示していた。"}],"collocations":["use an ametrometer","ametrometer readings","digital ametrometer"],"synonyms":["refractometer","optometer"],"antonyms":[]}],"etymology":{"value":"From a- (prefix meaning 'not') + meter + -o- + -meter (measuring instrument).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌæməˈtrɒmɪtər/","syllables":"a-me-trom-e-ter"},"inflection":{"noun_plural":"ametrometers"},"usage_notes":{"explanation":"The word \"ametrometer\" has two distinct meanings, one related to poetry and the other to ophthalmology. The poetic sense is rare, while the ophthalmological sense is more common within that specific field.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ametrometer was used to write the poem.","correct":"✓ The poet was an ametrometer, writing poems without regular meter.","note":"The ametrometer is not used to write a poem, but describes a poem or poet that does not follow metrical rules."},{"incorrect":"✗ The ametrometer measured the length of the poem.","correct":"✓ The ametrometer measured the refractive error of the eye.","note":"The ametrometer in ophthalmology measures refractive errors, not the length of a poem."}],"priority":"★★☆"},"related_words":{"derivatives":["ametria (noun: lack of metrical structure in verse)","meter (noun: a unit of rhythm in poetry; a measuring instrument)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word \"ametrometer\" is a technical term with two distinct meanings, one in poetry and one in ophthalmology. Understanding this word requires a strong vocabulary and familiarity with both literary and medical terminology. The poetic sense is rare, while the ophthalmological sense is more common within the field of eye care."},"example_sentences":[{"sentence":"The poet's work was described as ametrometer due to its lack of consistent rhythm.","translation":"その詩人の作品は、一貫したリズムの欠如から、韻律を無視した詩であると評された。","type":"noun","meaning_category":"poetry"},{"sentence":"The optometrist used an ametrometer to assess the patient's vision.","translation":"検眼医は、患者の視力を評価するためにアメトロメーターを使用した。","type":"noun","meaning_category":"ophthalmology"}]}