{"word":"Israelophile","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"イスラエル愛好家、イスラエル支持者","english_definition":"A person who admires Israel, its culture, and/or its policies.","examples":[{"sentence":"He is a self-proclaimed Israelophile and often defends the country's actions.","translation":"彼は自称イスラエル愛好家であり、しばしばその国の行動を擁護する。"},{"sentence":"The conference attracted many Israelophiles from around the world.","translation":"その会議には世界中から多くのイスラエル愛好家が集まった。"}],"collocations":["strong Israelophile","ardent Israelophile","outspoken Israelophile"],"synonyms":["Pro-Israel advocate","Supporter of Israel"],"antonyms":["Anti-Zionist","Israelophobe"],"related_words":["Zionist","Israelophilia"]}],"etymology":{"value":"Formed from \"Israel\" and the suffix \"-phile\", meaning \"lover of\".","priority":"Medium"},"pronunciation":{"ipa":"/ɪzˈreɪ.ə.fʌɪl/","syllables":"Iz-ra-el-o-phile"},"inflection":{"noun_plural":"Israelophiles"},"usage_notes":{"explanation":"The term \"Israelophile\" is generally used to describe someone with a strong positive affinity for Israel. It can sometimes be seen as a loaded term, particularly in discussions about the Israeli-Palestinian conflict, where it may imply a bias.","priority":"Medium"},"level_frequency":{"frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The word 'Israelophile' is a relatively uncommon term referring to someone who is fond of or admires Israel. Due to its association with political views, it is often used in specific contexts, such as discussions about international relations or cultural exchanges. Understanding the term requires some familiarity with the history and politics of the Middle East."},"example_sentences":[{"sentence":"As an Israelophile, she has visited the country many times and studied its history extensively.","translation":"イスラエル愛好家として、彼女は何度もその国を訪れ、その歴史を広範囲に研究してきた。","type":"general","meaning_category":"admirer"},{"sentence":"The organization aims to connect Israelophiles from different backgrounds to promote cultural exchange.","translation":"その組織は、異なった背景を持つイスラエル愛好家を結びつけ、文化交流を促進することを目指している。","type":"general","meaning_category":"supporter"}]}