{"word":"anticompetitive","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"反競争的な、競争を阻害する","english_definition":"designed to prevent or reduce competition in a market.","examples":[{"sentence":"The merger was deemed anticompetitive by regulators.","translation":"その合併は規制当局によって反競争的であると判断された。"},{"sentence":"Anticompetitive practices can harm consumers.","translation":"反競争的な行為は消費者に損害を与える可能性がある。"},{"sentence":"The company was accused of engaging in anticompetitive behavior.","translation":"その会社は反競争的な行動に関与していると告発された。"}],"collocations":["anticompetitive behavior","anticompetitive practices","anticompetitive effects","anticompetitive agreements","anticompetitive conduct"],"synonyms":["monopolistic","restrictive","unfair","predatory"],"antonyms":["competitive","pro-competitive","fair","open"],"related_terms":["antitrust","monopoly","oligopoly","cartel","price fixing","market manipulation"]}],"etymology":{"value":"'Anti-' (反対) + 'competitive' (競争的な).  Indicates actions or strategies that work against free and fair competition.","priority":"★★★"},"pronunciation":{"ipa":"/ˌænti.kəmˈpetətɪv/","syllables":"an-ti-com-pet-i-tive"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"'Anticompetitive' describes actions, strategies, or agreements that aim to reduce or eliminate competition in a market.  These practices are often illegal under antitrust laws because they can lead to higher prices, reduced innovation, and less choice for consumers.  It is frequently used in legal and business contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is very anticompetitive, so they have low prices.","correct":"✓ The company is very anticompetitive, so they can raise prices.","note":"Anticompetitive practices usually lead to higher prices, not lower prices, because competition is reduced."},{"incorrect":"✗ This is anticompetitive for our company.","correct":"✓ This is anticompetitive to the market.","note":"Anticompetitive actions affect the entire market, not just one company."}],"priority":"★★☆"},"related_words":{"derivatives":["anticompetitively (adverb)"],"related_terms":["competition","monopoly","antitrust","cartel","collusion","price fixing"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, used in specialized contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Anticompetitive' is a specialized term used in economics, law, and business. It describes actions that reduce or prevent competition in a market, often leading to negative consequences for consumers and the economy. Understanding this term requires familiarity with basic economic concepts and legal frameworks related to competition. It is not commonly used in everyday conversation.","priority":"★★★"},"example_sentences":[{"sentence":"The proposed acquisition raised concerns about its potential anticompetitive effects.","translation":"提案された買収は、その潜在的な反競争的影響について懸念を引き起こした。","type":"general","meaning_category":"general"},{"sentence":"The company was fined for engaging in anticompetitive pricing practices.","translation":"その会社は反競争的な価格設定慣行に関与したとして罰金を科せられた。","type":"business","meaning_category":"business"},{"sentence":"Antitrust laws are designed to prevent anticompetitive behavior.","translation":"独占禁止法は、反競争的な行動を防止するように設計されている。","type":"legal","meaning_category":"legal"}]}