{"word":"nigritude","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"黒人性、黒人であること、黒人の特質","english_definition":"the state or quality of being Black; Blackness.","examples":[{"sentence":"The poet explored themes of nigritude in his work.","translation":"その詩人は作品の中で黒人性というテーマを探求した。"},{"sentence":"The conference focused on the cultural significance of nigritude.","translation":"その会議は黒人性の文化的意義に焦点を当てた。"}],"collocations":["cultural nigritude","explore nigritude","essence of nigritude"],"synonyms":["Blackness","Black identity","Africanity","Africanness"],"antonyms":["Whiteness"]},{"part_of_speech":"noun","definition":"(文学・哲学) 黒人としてのアイデンティティや経験を強調する思想や運動","english_definition":"(literature, philosophy) a philosophical and literary movement that emphasizes and celebrates Black identity and experience.","examples":[{"sentence":"Négritude was a major influence on post-colonial literature.","translation":"ネグリチュードは植民地後の文学に大きな影響を与えた。"},{"sentence":"The Harlem Renaissance contributed to the development of nigritude.","translation":"ハーレム・ルネサンスはニグリチュードの発展に貢献した。"}],"collocations":["Négritude movement","literary nigritude","philosophical nigritude"],"synonyms":["Négritude","Black consciousness","Black cultural movement"],"antonyms":[]}],"etymology":{"value":"Derived from the French word \"négritude,\" coined in the 1930s by Aimé Césaire, Léopold Sédar Senghor, and Léon-Gontran Damas. It combines \"nègre\" (a derogatory term for a Black person, now largely considered offensive) with the suffix \"-itude\" (denoting a state or quality). The term was reclaimed and transformed into a positive assertion of Black identity and culture.","priority":"★★☆"},"pronunciation":{"ipa":"ˈnɪɡrɪtjuːd","syllables":"ni-gri-tude"},"inflection":{"noun_plural":"nigritudes (rarely used)"},"usage_notes":{"explanation":"\"Nigritude\" is a term with a complex history. While it originally derives from a French word that included a derogatory term for Black people, it was reclaimed by intellectuals and artists to represent a positive affirmation of Black identity, culture, and heritage. The term is often associated with the Négritude movement, a literary and philosophical movement that emerged in the 1930s among French-speaking African and Caribbean intellectuals in Paris as a protest against French colonial racism and assimilation. It is important to be aware of the term's historical context and potential for offense when using it.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used nigritude as a derogatory term.","correct":"✓ He studied the concept of nigritude in literature.","note":"It is important to use \"nigritude\" in its proper context, understanding its historical and cultural significance, and avoiding using it in a derogatory manner."}],"priority":"★★☆"},"related_words":{"derivatives":["Négritude (French spelling, often used to refer to the movement)"],"phrases":["Black is beautiful"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nigritude\" is a relatively rare and complex term, primarily used in academic and literary contexts. It refers to the state or quality of being Black, or to the philosophical and literary movement known as Négritude, which celebrates Black identity and culture. Understanding its historical origins and the context in which it is used is crucial. It is not a term commonly used in everyday conversation.","note":"Due to the term's origin, it is important to use it with sensitivity and awareness of its historical context."},"example_sentences":[{"sentence":"The exhibition explored the diverse expressions of nigritude in contemporary art.","translation":"その展覧会は、現代アートにおけるニグリチュードの多様な表現を探求した。","type":"noun","meaning_category":"黒人性"},{"sentence":"Senghor's writings are central to understanding the philosophy of nigritude.","translation":"サンゴールの著作は、ニグリチュードの哲学を理解する上で中心的な役割を果たす。","type":"noun","meaning_category":"黒人としてのアイデンティティや経験を強調する思想や運動"}]}