{"word":"dakhma","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ゾロアスター教の信者が遺体を置くための、鳥葬を行うための円形の塔。沈黙の塔とも呼ばれる。","english_definition":"A circular, raised structure built by Zoroastrians for excarnation – that is, for dead bodies to be exposed to the elements and especially to scavenging birds. Also known as a Tower of Silence.","examples":[{"sentence":"The dakhma stood on a hill overlooking the city.","translation":"そのダフマは街を見下ろす丘の上に立っていた。"},{"sentence":"Zoroastrians traditionally leave their dead on a dakhma.","translation":"ゾロアスター教徒は伝統的に遺体をダフマに置く。"}],"collocations":["Tower of Silence","Zoroastrian funeral","sky burial"],"synonyms":["Tower of Silence"],"antonyms":[]}],"etymology":{"value":"ペルシア語の دخمه (dakhme) から来ており、「墓」または「埋葬の場所」を意味する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɑːkmə/","syllables":"dakh-ma"},"inflection":{"noun_plural":"dakmas or dakhmas"},"usage_notes":{"explanation":"Dakhmas are specifically associated with Zoroastrianism and the practice of sky burial, where bodies are left to be consumed by vultures. This practice is rooted in the Zoroastrian belief that a dead body is impure and should not pollute the earth or fire.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["excarnation","Zoroastrianism"],"related_concepts":["sky burial","funeral rites"]},"level_frequency":{"frequency_google_ngram":"非常に低い (Very low frequency). 専門的な用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**dakhma**」は、ゾロアスター教の葬儀の慣習に関連する専門用語です。一般的にはあまり知られていない言葉であり、宗教や文化人類学の文脈で登場することがあります。この単語は、ゾロアスター教徒が遺体を鳥に食べさせるために使用する、特別な塔または場所を指します。この慣習は、死体を不浄なものとみなし、土や火を汚染することを避けるという信仰に基づいています。そのため、この単語を理解するには、ゾロアスター教の独特な葬儀の慣習についての知識が必要です。"},"example_sentences":[{"sentence":"The ancient dakhma was a testament to the enduring traditions of Zoroastrianism.","translation":"古代のダフマは、ゾロアスター教の不朽の伝統の証だった。","type":"noun","meaning_category":"葬儀の塔"},{"sentence":"Visiting the site of a former dakhma provided insight into the unique funerary practices of the community.","translation":"かつてのダフマの跡地を訪れることで、そのコミュニティの独特な葬儀の慣習についての洞察が得られた。","type":"noun","meaning_category":"葬儀の場所"}]}