{"word":"Digamist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"重婚者、二重結婚者","english_definition":"A person who has contracted a second marriage while a prior marriage is still legally valid.","examples":[{"sentence":"He was labeled a digamist after marrying again without divorcing his first wife.","translation":"彼は最初の妻と離婚せずに再婚したため、重婚者と見なされた。"},{"sentence":"The legal implications for a digamist can be severe.","translation":"重婚者に対する法的影響は深刻になる可能性がある。"}],"collocations":["become a digamist","labeled as a digamist","prosecute a digamist"],"synonyms":["bigamist","polygamist"],"antonyms":["monogamist"]},{"part_of_speech":"adjective","definition":"重婚の、二重結婚の","english_definition":"Relating to or characterized by digamy (the state of being married to two people at the same time).","examples":[{"sentence":"The digamist relationship was discovered after years of secrecy.","translation":"その重婚関係は長年の秘密の後についに発覚した。"},{"sentence":"Digamist practices are illegal in many countries.","translation":"重婚行為は多くの国で違法である。"}],"collocations":["digamist marriage","digamist relationship","digamist practice"],"synonyms":["bigamous","polygamous"],"antonyms":["monogamous"]}],"etymology":{"value":"From the Greek 'di-' (two) + 'gamos' (marriage) + '-ist' (one who practices or believes in).","priority":"★★★"},"pronunciation":{"ipa":"ˈdɪɡəmɪst","syllables":"di-ga-mist"},"inflection":{"noun_plural":"digamists"},"usage_notes":{"explanation":"'Digamist' refers specifically to someone who has entered a second marriage while still legally married to another person. It is often used in legal contexts. It is similar to 'bigamist', but 'digamist' emphasizes the act of entering a second marriage, while 'bigamist' focuses on the state of having two spouses simultaneously.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a digamist because he remarried after his wife died.","correct":"He remarried after his wife died.","note":"'Digamist' implies marrying again while still legally married to a previous spouse. Remarrying after the death of a spouse is not digamy."},{"incorrect":"She is a digamist, living with multiple partners.","correct":"She is a polygamist, living with multiple partners.","note":"'Digamist' refers to two marriages, one after the other, while still legally bound to the first. 'Polygamist' refers to having multiple spouses at the same time."}],"priority":"★★☆"},"related_words":{"derivatives":["digamy"],"phrasal_verbs":[],"related_terms":["bigamy","polygamy","monogamy","marriage"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Digamist' is a relatively rare and formal term referring to someone who has entered a second marriage while still legally married to another person. It is primarily used in legal or academic contexts when discussing marriage laws and practices. Understanding the term requires a grasp of legal and marital concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The court ruled that he was a digamist and annulled his second marriage.","translation":"裁判所は彼が重婚者であると判断し、彼の二度目の結婚を無効にした。","type":"noun","meaning_category":"重婚者"},{"sentence":"The digamist nature of the relationship led to complex legal challenges.","translation":"その重婚関係の性質が複雑な法的課題を引き起こした。","type":"adjective","meaning_category":"重婚の"}]}