{"word":"hemocyte","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"血球細胞、血球（特に無脊椎動物の）","english_definition":"A blood cell, especially of an invertebrate.","examples":[{"sentence":"Hemocytes play a crucial role in the immune response of insects.","translation":"血球細胞は昆虫の免疫反応において重要な役割を果たします。"},{"sentence":"Different types of hemocytes perform various functions, such as phagocytosis and encapsulation.","translation":"異なる種類の血球細胞は、食作用や被包化などの様々な機能を果たします。"}],"collocations":["circulating hemocytes","hemocyte count","hemocyte classification","hemocyte morphology","hemocyte function"],"synonyms":["blood cell","blood corpuscle"],"antonyms":[]}],"etymology":{"value":"From Greek haima (αἷμα) meaning 'blood' + kytos (κύτος) meaning 'cell'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈhiːməˌsaɪt","syllables":"he-mo-cyte"},"inflection":{"noun_plural":"hemocytes"},"usage_notes":{"explanation":"'Hemocyte' is a technical term primarily used in the context of invertebrate zoology and immunology. It refers to the blood cells found in invertebrates, which are analogous to leukocytes (white blood cells) in vertebrates. These cells are involved in various immune functions, such as phagocytosis (engulfing and destroying pathogens), encapsulation (surrounding and isolating foreign objects), and the production of antimicrobial substances. The types and functions of hemocytes can vary significantly among different invertebrate species.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Hemocytes are only found in mammals.","correct":"✓ Hemocytes are primarily found in invertebrates.","note":"Hemocytes are the blood cells of invertebrates; vertebrates have leukocytes (white blood cells)."},{"incorrect":"✗ Hemocytes are red blood cells.","correct":"✓ Hemocytes are analogous to white blood cells (leukocytes) in vertebrates.","note":"Hemocytes are immune cells, similar in function to white blood cells, not red blood cells."}],"priority":"★★☆"},"related_words":{"derivatives":["hemocytic (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily found in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hemocyte' is a specialized term used in biology, specifically in the study of invertebrates. It refers to the blood cells of these animals, which perform immune functions similar to white blood cells in vertebrates. Understanding this term requires knowledge of basic biology and immunology. It is not commonly used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The number of circulating **hemocytes** increased significantly after the bacterial infection.","translation":"細菌感染後、循環している血球細胞の数が著しく増加した。","type":"general","meaning_category":"definition"},{"sentence":"Researchers are studying the different types of **hemocytes** in shrimp to understand their immune mechanisms.","translation":"研究者たちは、エビの免疫機構を理解するために、さまざまな種類の血球細胞を研究している。","type":"research","meaning_category":"function"}]}