{"word":"law-merchant","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"商法、商人法","english_definition":"A body of commercial law based on the usages and customs of merchants and traders, formerly administered by special courts but now forming part of the common law.","examples":[{"sentence":"The law-merchant governed transactions between merchants in medieval Europe.","translation":"中世ヨーロッパでは、商法が商人間の取引を支配していた。"},{"sentence":"Many principles of modern commercial law are derived from the law-merchant.","translation":"現代商法の多くの原則は、商人法に由来する。"}],"collocations":["international law-merchant (国際商法)"],"synonyms":["commercial law","lex mercatoria"],"antonyms":[]}],"etymology":{"value":"「law」と「merchant」の組み合わせ。中世に商人間で発展した慣習法に由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlɔː ˈmɜːrtʃənt/","syllables":"law-mer-chant"},"inflection":{"noun_plural":"(通常は不可算名詞)"},"usage_notes":{"explanation":"「**law-merchant**」は、歴史的な用語であり、現代の商法（commercial law）のルーツを指します。中世の商人間で自然発生的に形成された取引慣習やルールを基盤としており、特定の国や地域の法律に縛られない国際的な性格を持っていました。現代では、多くの国で商法が成文化されていますが、その根底にはlaw-merchantの精神が息づいています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The law-merchant is a law passed by the government.","correct":"✓ The law-merchant is a body of customary law developed by merchants.","note":"law-merchantは政府によって制定された法律ではなく、商人によって発展した慣習法です。"},{"incorrect":"✗ The law-merchant only applies to domestic trade.","correct":"✓ The law-merchant historically applied to international trade as well.","note":"law-merchantは、国内取引だけでなく、国際取引にも適用されていました。"}],"priority":"★★☆"},"related_words":{"derivatives":["lex mercatoria (ラテン語: 商法)","commercial law (商法)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**law-merchant**」は、歴史的な文脈で使われる専門用語で、現代の商法の源流となった、中世の商人たちが作り上げた取引のルールや慣習を指します。現代の法律を学ぶ上では、その背景知識として知っておくと役立ちますが、日常会話で使うことはほとんどありません。法律や経済の専門的な文章で目にすることがあります。"},"example_sentences":[{"sentence":"The law-merchant provided a framework for resolving disputes between traders across national borders.","translation":"商法は、国境を越えた貿易業者間の紛争を解決するための枠組みを提供した。","type":"noun","meaning_category":"商法"},{"sentence":"The principles of good faith and fair dealing, central to modern contract law, have their roots in the law-merchant.","translation":"現代の契約法の中核である誠実義務と公正な取引の原則は、商法にそのルーツを持つ。","type":"noun","meaning_category":"商法"}]}