{"word":"pastiling","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of Filipino rice cake from Maguindanao, Philippines. It consists of steamed rice wrapped in banana leaves with a savory filling, usually shredded chicken, beef, or fish.","english_definition":"A Filipino rice cake from Maguindanao, Philippines, consisting of steamed rice wrapped in banana leaves with a savory filling, usually shredded chicken, beef, or fish.","examples":[{"sentence":"I bought a pastiling from the street vendor for my lunch.","translation":"昼食に屋台でパスティリングを買いました。"},{"sentence":"Pastiling is a popular snack in Maguindanao.","translation":"パスティリングはマギンダナオで人気のある軽食です。"}],"collocations":["eat pastiling","buy pastiling","make pastiling"],"synonyms":["patil","pastel (though this can also refer to a different dish)"],"antonyms":[]}],"etymology":{"value":"Likely derived from 'pastel', influenced by local languages.","priority":"★★☆"},"pronunciation":{"ipa":"/pɑːˈstiːlɪŋ/","syllables":"pas-ti-ling"},"inflection":{"noun_plural":"pastilings"},"usage_notes":{"explanation":"Pastiling is a specific type of Filipino rice cake, distinct from other rice cakes due to its savory filling and banana leaf wrapping. It's primarily associated with the Maguindanao region.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate a pastel for lunch (when referring to pastiling).","correct":"✓ I ate a pastiling for lunch.","note":"'Pastel' can refer to a different dish or a color, so use 'pastiling' to specifically refer to the Filipino rice cake."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_dishes":["kakanin (general term for Filipino rice cakes)","suman","biko","puto"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Pastiling' is a specific cultural food item. Understanding requires knowledge of Filipino cuisine and regional specialties. The term is not commonly used outside of the Philippines or among those familiar with Filipino food.","priority":"★★★"},"example_sentences":[{"sentence":"She learned how to make authentic pastiling from her grandmother.","translation":"彼女は祖母から本格的なパスティリングの作り方を教わった。","type":"noun","meaning_category":"Filipino rice cake"},{"sentence":"The pastiling was filled with flavorful shredded chicken.","translation":"そのパスティリングには風味豊かな鶏肉のほぐし身が詰められていた。","type":"noun","meaning_category":"Filipino rice cake"}]}