{"word":"nonseditious","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"扇動的でない、反乱を企てない","english_definition":"not involving or inciting sedition.","examples":[{"sentence":"The article was critical of the government but nonseditious.","translation":"その記事は政府を批判していたが、扇動的ではなかった。"},{"sentence":"The group promotes peaceful change through nonseditious means.","translation":"そのグループは、扇動的でない手段を通じて平和的な変革を推進している。"}],"collocations":["nonseditious speech","nonseditious writing","nonseditious activity"],"synonyms":["noninflammatory","nonrebellious","noninsurrectionary"],"antonyms":["seditious","inflammatory","rebellious","insurrectionary"]}],"etymology":{"value":"\"non-\" (not) + \"seditious\" (反乱的な).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn.sɪˈdɪʃ.əs/","syllables":"non-se-di-tious"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"\"Nonseditious\" is the opposite of \"seditious.\" It describes something that does not promote or incite rebellion against a government or authority. It is often used in legal or political contexts to distinguish between legitimate criticism and illegal incitement.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The protest was nonseditious because it was loud.","correct":"✓ The protest was nonseditious because it did not advocate violence or overthrowing the government.","note":"Loudness is not the defining factor of whether something is seditious. Seditious acts involve inciting rebellion or violence."}],"priority":"★★★"},"related_words":{"derivatives":["sedition (名詞: 扇動)","seditiously (副詞: 扇動的に)"],"antonyms":["seditious (形容詞: 扇動的な)"],"related_concepts":["freedom of speech","political dissent","insurrection","rebellion"]},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonseditious\" is a relatively uncommon and formal word. It is used to describe something that is not seditious, meaning it does not incite or promote rebellion against the government. Understanding this word requires knowledge of the more common word \"seditious\" and the prefix \"non-\", which indicates negation. It is most likely to be encountered in legal, political, or academic contexts."},"example_sentences":[{"sentence":"The book contained strong criticisms of the regime but was ultimately deemed nonseditious by the court.","translation":"その本には政権に対する強い批判が含まれていたが、最終的には裁判所によって扇動的ではないと判断された。","type":"adjective","meaning_category":"not inciting sedition"},{"sentence":"The organization is committed to promoting social change through nonseditious means, such as peaceful protests and advocacy.","translation":"その組織は、平和的な抗議活動や提唱など、扇動的でない手段を通じて社会変革を推進することに尽力している。","type":"adjective","meaning_category":"not inciting sedition"}]}