{"word":"unpennoned","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"旗のない、旗飾りのない","english_definition":"Without a pennon or pennons; without a flag or flags.","examples":[{"sentence":"The unpennoned masts stood stark against the grey sky.","translation":"旗飾りのないマストが、灰色の空を背景にむき出しに立っていた。"},{"sentence":"An unpennoned lance is a sad sight for a knight.","translation":"旗のない槍は騎士にとって悲しい光景だ。"}],"collocations":["unpennoned lance","unpennoned mast"],"synonyms":["flagless","bannerless"],"antonyms":["pennoned","flagged"]}],"etymology":{"value":"'Un-' (not) + 'pennoned' (having a pennon). 'Pennon' comes from Old French 'penon', meaning a small flag or streamer.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈpɛnənd/","syllables":"un-pen-noned"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It can also be used in comparative and superlative forms (more unpennoned, most unpennoned), although this is rare."},"usage_notes":{"explanation":"'Unpennoned' is a relatively rare word, primarily used in descriptive or literary contexts to emphasize the absence of flags or pennons, often implying a lack of festivity, decoration, or identification. It is most commonly found in descriptions of ships, masts, lances, or similar objects that would typically bear a flag.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unpennoned feeling of sadness overwhelmed him.","correct":"✓ The feeling of sadness overwhelmed him.","note":"'Unpennoned' should be used to describe something that lacks a pennon, not a feeling or abstract concept."}],"priority":"★★☆"},"related_words":{"derivatives":["pennon","pennoned"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'unpennoned' is a relatively rare and specialized word. It is most likely to be encountered in historical or literary contexts where the absence of flags or pennons is significant. Understanding the word requires familiarity with the word 'pennon' itself, which is not a common word in modern English. Therefore, this word is best suited for advanced learners of English with an interest in history or literature."},"example_sentences":[{"sentence":"The unpennoned ship sailed silently into the harbor.","translation":"旗飾りのない船が静かに港に入港した。","type":"descriptive","meaning_category":"absence of flags"},{"sentence":"The knight's unpennoned lance was a sign of mourning.","translation":"騎士の旗飾りのない槍は喪のしるしだった。","type":"symbolic","meaning_category":"lack of display"}]}