{"word":"agitated-eyed","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"Having eyes that reflect a state of agitation, anxiety, or restlessness.","english_definition":"Describing someone whose eyes show signs of agitation, anxiety, or restlessness.","examples":[{"sentence":"The agitated-eyed child clung to his mother's leg during the thunderstorm.","translation":"落ち着かない目をした子供は、雷雨の間、母親の足にしがみついていた。"},{"sentence":"The agitated-eyed suspect nervously glanced around the interrogation room.","translation":"不安げな目をした容疑者は、取り調べ室を落ち着きなく見回した。"},{"sentence":"Her agitated-eyed expression betrayed her inner turmoil.","translation":"彼女の落ち着かない目は、彼女の内面の混乱を物語っていた。"}],"collocations":["agitated-eyed expression","agitated-eyed look","agitated-eyed gaze","agitated-eyed person"],"synonyms":["anxious-eyed","restless-eyed","worried-eyed","uneasy-eyed","disturbed-eyed"],"antonyms":["calm-eyed","peaceful-eyed","serene-eyed","tranquil-eyed","composed-eyed"]}],"etymology":{"value":"A compound adjective formed by combining 'agitated' (showing or feeling anxiety or restlessness) with 'eyed' (having eyes of a specified kind).","priority":"Low"},"pronunciation":{"ipa":"/ˈædʒɪˌteɪtɪd aɪd/","syllables":"a-gi-ta-ted-eyed"},"inflection":{"notes":"Adjective, does not inflect"},"usage_notes":{"explanation":"'Agitated-eyed' is a descriptive adjective used to convey a specific emotional state through the appearance of someone's eyes. It is not a commonly used word, but it can be effective in creating a vivid image in writing.","priority":"Low"},"common_mistakes":{"examples":[{"incorrect":"The agitated eyed man paced back and forth.","correct":"The agitated-eyed man paced back and forth.","note":"Hyphenate 'agitated-eyed' when used as a compound adjective before a noun."}],"priority":"Low"},"related_words":{"derivatives":["agitatedly (adverb)","agitation (noun)"],"related_terms":["wide-eyed","bloodshot-eyed","tearful-eyed"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Agitated-eyed' is a relatively uncommon compound adjective that combines the concept of agitation with the physical characteristic of the eyes. It is used to describe someone whose eyes reflect their inner anxiety or restlessness. Due to its specificity and relatively low frequency, it is more likely to be encountered in advanced texts or creative writing where precise and evocative language is employed."},"example_sentences":[{"sentence":"The soldier, agitated-eyed and weary, recounted the horrors of the battlefield.","translation":"兵士は、落ち着かない目をし、疲れ果てて、戦場の恐怖を語った。","type":"descriptive","meaning_category":"anxiety"},{"sentence":"Even the usually calm professor appeared agitated-eyed before the important presentation.","translation":"普段は冷静な教授でさえ、重要なプレゼンテーションの前には落ち着かない目をしていた。","type":"descriptive","meaning_category":"nervousness"}]}