{"word":"Messalian","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"メッサリアン派 (4世紀から5世紀にかけてシリアやメソポタミアで活動したキリスト教異端の一派)","english_definition":"A member of a Christian ascetic sect, originating in Mesopotamia in the 4th century, who believed that prayer was the only means of resisting the indwelling demon that possessed every human being.","examples":[{"sentence":"The Messalians were condemned as heretics by the mainstream Church.","translation":"メッサリアン派は主流教会から異端者として非難された。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"adjective","definition":"メッサリアン派の","english_definition":"Relating to or characteristic of the Messalians.","examples":[{"sentence":"Messalian doctrines emphasized constant prayer and rejection of worldly possessions.","translation":"メッサリアン派の教義は、絶え間ない祈りと世俗的な所有物の拒否を強調した。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from Syriac mṣallyānā (ܡܨܠܝܢܐ), meaning 'those who pray'.","priority":"★★★"},"pronunciation":{"ipa":"/mɛˈseɪliən/","syllables":"Me-ssa-li-an"},"inflection":{},"usage_notes":{"explanation":"The term 'Messalian' is primarily historical, referring to a specific group considered heretical by the early Church. Usage is typically limited to theological or historical contexts.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Messalianism (メッサリアン主義)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Messalian' is highly specialized and rarely encountered outside of academic or theological discussions of early Christian history and heresy. Understanding requires familiarity with early church history and theological terminology."},"example_sentences":[{"sentence":"Historical accounts describe the Messalians as rejecting sacraments and organized church structure.","translation":"歴史的記述では、メッサリアン派は秘跡と組織化された教会構造を拒否したとされている。","type":"noun","meaning_category":"メッサリアン派"},{"sentence":"Messalian asceticism involved extreme forms of self-denial and reliance on divine intervention.","translation":"メッサリアン派の禁欲主義は、極端な自己否定と神の介入への依存を伴った。","type":"adjective","meaning_category":"メッサリアン派の"}]}