{"word":"pasty-footed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Having pale or whitish feet.","english_definition":"Having feet that are pale or whitish in color.","examples":[{"sentence":"The lifeguard's pasty-footed appearance was a stark contrast to his tanned body.","translation":"ライフガードの血色の悪い足は、日焼けした体と著しい対照をなしていた。"},{"sentence":"After a long winter indoors, her pasty-footed children were eager to run barefoot in the grass.","translation":"長い冬を室内で過ごした後、彼女の足の色の悪い子供たちは、裸足で草むらを走り回るのを心待ちにしていた。"}],"collocations":["pasty-footed children","pasty-footed appearance","pasty-footed legs"],"synonyms":["pale-footed","white-footed","fair-footed"],"antonyms":["tanned-footed","dark-footed","bronzed-footed"]}],"etymology":{"value":"Combination of 'pasty' (pale, resembling paste in color) and 'footed' (having feet).","priority":"★★★"},"pronunciation":{"ipa":"/ˈpeɪsti ˈfʊtɪd/","syllables":"pasty-foot-ed"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Pasty-footed' is a descriptive adjective, often used to describe someone who has been indoors for an extended period, resulting in a lack of sun exposure on their feet. It can also be used to describe someone whose natural skin tone is very pale. The term is generally neutral in tone, but can sometimes be used humorously or critically.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was pasty-footed because he worked out a lot.","correct":"✓ He was pasty-footed because he stayed inside all winter.","note":"Pasty-footedness is usually associated with lack of sun exposure, not physical activity."}],"priority":"★☆☆"},"related_words":{"derivatives":["pasty (adjective: pale, like paste)","footed (adjective: having feet)"],"phrasal_verbs":[],"related_adjectives":["pale","white","fair"]},"level_frequency":{"CEFR":"N/A (Very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'pasty-footed' is a relatively uncommon descriptive adjective. It combines the adjective 'pasty,' meaning pale or lacking color, with 'footed,' indicating having feet. The term is used to describe someone whose feet are noticeably pale, often due to a lack of sun exposure. Because it is not a common word, understanding the meaning of its component parts is helpful in deciphering its meaning. It's more likely to be found in descriptive writing than in everyday conversation."},"example_sentences":[{"sentence":"The contrast between his tanned arms and pasty-footed legs was quite comical.","translation":"彼の日焼けした腕と血色の悪い足のコントラストは、とても滑稽だった。","type":"descriptive","meaning_category":"appearance"},{"sentence":"After months of working from home, she emerged into the sunlight, a pasty-footed testament to her indoor lifestyle.","translation":"数ヶ月の在宅勤務の後、彼女は血色の悪い足で、屋内のライフスタイルを証明するかのように日光の中に現れた。","type":"descriptive","meaning_category":"lifestyle"}]}