{"word":"lognormal","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"対数正規の","english_definition":"Relating to or following a log-normal distribution.","examples":[{"sentence":"The data exhibited a lognormal distribution.","translation":"そのデータは対数正規分布を示した。"},{"sentence":"Lognormal distributions are often used to model asset prices.","translation":"対数正規分布は、資産価格をモデル化するためによく使用されます。"}],"collocations":["lognormal distribution","lognormal data","lognormal model"],"synonyms":["log-normally distributed"],"antonyms":[]}],"etymology":{"value":"The term 'lognormal' is derived from 'logarithmic normal', indicating that the logarithm of the variable has a normal distribution.","priority":"★★★"},"pronunciation":{"ipa":"/ˌlɒɡˈnɔːrməl/","syllables":"log-nor-mal"},"inflection":{"notes":"This word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"A lognormal distribution is a probability distribution of a random variable whose logarithm is normally distributed. It is often used in statistics and probability theory to model phenomena where values cannot be negative, such as asset prices, survival times, and sizes of objects.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The data is log normal.","correct":"✓ The data is lognormal.","note":"'Lognormal' is one word, not two. It's a common spelling mistake to separate 'log' and 'normal'."}],"priority":"★★☆"},"related_words":{"derivatives":["lognormality (noun)"],"related_terms":["normal distribution","logarithm","probability distribution","statistics"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in technical and statistical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'lognormal' refers to a specific type of probability distribution used in statistics. It describes data where the logarithm of the values follows a normal distribution. This concept is typically encountered in advanced statistical analysis, particularly when dealing with data that cannot be negative and has a skewed distribution. Understanding 'lognormal' requires familiarity with both logarithmic and normal distributions, making it a more technical term."},"example_sentences":[{"sentence":"The income distribution in the country is often modeled using a lognormal distribution.","translation":"その国の所得分布は、対数正規分布を用いてモデル化されることが多い。","type":"general","meaning_category":"distribution modeling"},{"sentence":"The survival times of patients after a certain treatment followed a lognormal pattern.","translation":"特定の治療後の患者の生存時間は、対数正規パターンに従った。","type":"medical","meaning_category":"survival analysis"},{"sentence":"Stock prices are sometimes assumed to follow a lognormal process.","translation":"株価は、対数正規過程に従うと仮定されることがある。","type":"finance","meaning_category":"financial modeling"}]}