{"word":"Erythrol","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"エリスリトール (糖アルコールの一種)","english_definition":"A sugar alcohol (polyol) used as a food additive and sugar substitute.","examples":[{"sentence":"Erythrol is often used in sugar-free candies and beverages.","translation":"エリスリトールは、砂糖不使用のキャンディーや飲料によく使用されます。"}],"collocations":["sugar alcohol","food additive","sugar substitute"],"synonyms":["erythrite","tetrahydroxybutane"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'erythros' meaning 'red', due to its initial preparation involving a reddish color.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈrɪθrɒl/","syllables":"e-ryth-rol"},"inflection":{"noun_plural":"Erythrols (rarely used)"},"usage_notes":{"explanation":"Erythrol is a sugar alcohol that is about 60–80% as sweet as sucrose (table sugar) but contains almost no calories. It's often used in food products marketed towards people with diabetes or those looking to reduce their sugar intake. It is generally well-tolerated, but excessive consumption can lead to digestive issues in some individuals.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Erythrol is a artificial sweetener.","correct":"✓ Erythrol is a sugar alcohol.","note":"Erythrol is a type of sugar alcohol, not an artificial sweetener, although it is used as a sugar substitute."}],"priority":"★★☆"},"related_words":{"derivatives":["erythrite"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Erythrol is a technical term referring to a specific type of sugar alcohol used as a sugar substitute. Understanding its properties and applications requires some knowledge of food science and nutrition. It is not a common word in everyday conversation but may appear in discussions about diet, health, and food additives."},"example_sentences":[{"sentence":"The label indicates that the product is sweetened with erythrol.","translation":"ラベルには、製品がエリスリトールで甘くされていると記載されています。","type":"noun","meaning_category":"sugar substitute"},{"sentence":"Unlike some other sugar alcohols, erythrol is mostly absorbed by the body and excreted unchanged in urine.","translation":"他の糖アルコールとは異なり、エリスリトールは主に体内で吸収され、尿中に変化せずに排泄されます。","type":"noun","meaning_category":"sugar alcohol"}]}