{"word":"whalish","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"クジラのような、クジラに似た","english_definition":"Resembling or characteristic of a whale.","examples":[{"sentence":"The creature had a distinctly whalish appearance, with a large, rounded body and a powerful tail.","translation":"その生き物は、大きく丸みを帯びた体と力強い尾を持ち、明らかにクジラのような外観をしていた。"},{"sentence":"The ship's sonar picked up a whalish sound, suggesting the presence of marine mammals nearby.","translation":"船のソナーはクジラのような音を拾い、近くに海洋哺乳類がいることを示唆していた。"}],"collocations":["whalish body","whalish sound","whalish features","whalish shape"],"synonyms":["cetacean","whale-like","whale-shaped"],"antonyms":[]}],"etymology":{"value":"'Whale' + '-ish'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈweɪlɪʃ/","syllables":"whal-ish"},"inflection":{"notes":"Adjective, comparative and superlative forms are 'more whalish' and 'most whalish' respectively."},"usage_notes":{"explanation":"'Whalish' is used to describe something that has characteristics similar to a whale, whether in appearance, sound, or behavior. It is not a commonly used word, but it is useful for describing something that is not a whale but has whale-like qualities.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The whalish is swimming in the ocean.","correct":"✓ A whale is swimming in the ocean.","note":"'Whalish' is an adjective, not a noun. Use 'whale' as a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["whale (noun)","whaler (noun)","whaling (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'whalish' is a relatively uncommon adjective used to describe something resembling or characteristic of a whale. Due to its infrequent usage, it is more likely to be encountered in specialized or technical contexts, such as marine biology or descriptive writing. Understanding the word requires a familiarity with the characteristics of whales and the function of the '-ish' suffix, which indicates resemblance or approximation."},"example_sentences":[{"sentence":"The submarine's design incorporated several whalish elements to improve its hydrodynamics.","translation":"その潜水艦のデザインには、流体力学を改善するためにいくつかのクジラのような要素が組み込まれていた。","type":"adjective","meaning_category":"クジラに似た"},{"sentence":"The deep, resonant tone of the foghorn had a strangely whalish quality.","translation":"その霧笛の深く響く音色は、奇妙なほどクジラのような性質を持っていた。","type":"adjective","meaning_category":"クジラに似た"}]}