{"word":"Ascosporous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"子嚢果の中に子嚢胞子を持つ、または子嚢胞子を生成する","english_definition":"Bearing or producing ascospores within an ascus.","examples":[{"sentence":"Ascosporous fungi are a diverse group of organisms.","translation":"子嚢胞子を持つ菌類は多様な生物群です。"},{"sentence":"The ascosporous state is important for the identification of many fungi.","translation":"子嚢胞子の状態は、多くの菌類の同定に重要です。"}],"collocations":["ascosporous fungi","ascosporous yeast","ascosporous state"],"synonyms":["ascogenous"],"antonyms":[]}],"etymology":{"value":"Derived from 'ascospore' (a spore contained in an ascus) + '-ous' (having, possessing).","priority":"★★☆"},"pronunciation":{"ipa":"/æˌskɒsˈpɔːrəs/","syllables":"as-co-spo-rous"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Ascosporous' is a technical term used in mycology (the study of fungi) to describe organisms that produce ascospores. Ascospores are a type of spore contained within a sac-like structure called an ascus. This term is often used in scientific literature and descriptions of fungal species.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bacteria was ascosporous.","correct":"✓ The fungus was ascosporous.","note":"Ascosporous is specific to fungi, not bacteria."}],"priority":"★☆☆"},"related_words":{"derivatives":["ascospore","ascus","ascocarp"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'ascosporous' is a highly specialized term used within the field of mycology. It describes fungi that produce ascospores, which are spores contained in a sac-like structure called an ascus. Understanding this term requires a background in biology, specifically fungal biology. It is unlikely to be encountered outside of scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The identification of the fungus relied on observing its ascosporous characteristics under a microscope.","translation":"その菌類の同定は、顕微鏡下でその子嚢胞子の特徴を観察することに依存していた。","type":"adjective","meaning_category":"子嚢胞子を持つ"}]}