{"word":"overempired","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(rare, nonstandard) excessively empowered; having been given too much power or authority.","english_definition":"(rare, nonstandard) Having been given or having assumed excessive power or authority; excessively empowered.","examples":[{"sentence":"Some critics argue that the regulatory agencies have become overempired, leading to bureaucratic overreach.","translation":"一部の批評家は、規制機関が過剰に権限を与えられ、官僚的な越権行為につながっていると主張している。"},{"sentence":"The CEO was accused of creating an overempired executive team that stifled innovation.","translation":"CEOは、イノベーションを阻害する過剰に権限を与えられた経営陣を作り出したとして非難された。"}],"collocations":["overempired executive","overempired agency","become overempired"],"synonyms":["overpowered","overbearing","domineering"],"antonyms":["underpowered","disenfranchised","powerless"]}],"etymology":{"value":"Formed by prefixing \"over-\" to \"empired\", which is a rare and somewhat nonstandard past participle of \"empire\" used to mean \"given power or authority over.\" The construction is relatively recent and not widely accepted.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊvərɪmˈpaɪərd/","syllables":"o-ver-im-pired"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more overempired' and 'most overempired', respectively, though these are rarely used."},"usage_notes":{"explanation":"The term \"overempired\" is not a standard or widely recognized word in English. It is a relatively new and somewhat informal construction used to describe something or someone that has been given too much power or authority. Its usage is often critical, suggesting that the excessive empowerment has led to negative consequences such as abuse of power or inefficiency. Because it is nonstandard, it should be used with caution and awareness of its potential to be misunderstood.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The overempired flower bloomed beautifully.","correct":"✓ The vibrant flower bloomed beautifully.","note":"\"Overempired\" is typically used to describe entities with authority or control, not natural objects like flowers. A more appropriate adjective would describe its appearance or health."},{"incorrect":"✗ The company overempired their employees with new tools.","correct":"✓ The company empowered their employees with new tools.","note":"The verb form should be \"empowered,\" not \"overempired,\" when describing the act of giving power. \"Overempired\" is generally used as an adjective to describe the state of having too much power."}],"priority":"★★☆"},"related_words":{"derivatives":["overempowerment (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (not a standard word)","frequency_google_ngram":"Very low frequency (not a commonly used word)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Overempired\" is a rare and nonstandard term, meaning it's not typically found in common usage. It describes something or someone that has been given too much power or authority, often leading to negative outcomes. Because it's not a standard word, its meaning might not be immediately clear, and it's best used in contexts where the meaning can be inferred or explained. It's more likely to be encountered in academic or critical discussions about power structures and authority. Due to its nonstandard nature, it's advisable to use it cautiously and be prepared to clarify its meaning. "},"example_sentences":[{"sentence":"The committee became overempired, making decisions without consulting the wider community.","translation":"委員会は過剰に権限を与えられ、より広いコミュニティに相談することなく意思決定を行った。","type":"adjective","meaning_category":"excessively empowered"},{"sentence":"Critics argued that the new legislation would create an overempired surveillance state.","translation":"批評家たちは、新しい法律が過剰に権限を与えられた監視国家を作り出すだろうと主張した。","type":"adjective","meaning_category":"excessively empowered"}]}