{"word":"telecinematography","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"映画フィルムをテレビ信号に変換する技術、またはそのプロセス","english_definition":"The process or technology of converting motion picture film into video signals.","examples":[{"sentence":"Telecinematography is essential for broadcasting movies on television.","translation":"テレシネマトグラフィーは、映画をテレビで放送するために不可欠です。"},{"sentence":"The quality of telecinematography has improved significantly with digital technology.","translation":"デジタル技術の進歩により、テレシネマトグラフィーの品質は大幅に向上しました。"}],"collocations":["digital telecinematography","high-definition telecinematography"],"synonyms":["film-to-video transfer","film scanning"],"antonyms":[]}],"etymology":{"value":"\"tele-\" (遠隔、テレビ) + \"cinematography\" (映画撮影) の組み合わせ。テレビで映画を上映するために開発された技術であることから。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌtɛlɪˌsɪnəməˈtɒɡrəfi/","syllables":"te-le-ci-ne-ma-tog-ra-phy"},"inflection":{"noun_plural":"telecinematographies"},"usage_notes":{"explanation":"\"Telecinematography\" は、映画フィルムをビデオ信号に変換するプロセスを指す専門用語です。主に放送業界や映画のデジタル化の文脈で使用されます。近年では、デジタル技術の進歩により、フィルムスキャニングの品質が向上し、より高画質なテレシネマトグラフィーが可能になっています。","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ telecinematography is used to record movies.","correct":"✓ telecinematography is used to transfer movies to video.","note":"テレシネマトグラフィーは映画を記録するのではなく、既存の映画フィルムをビデオ形式に変換するために使用されます。"},{"incorrect":"✗ telecinematography is the same as cinematography.","correct":"✓ telecinematography is a process that follows cinematography.","note":"シネマトグラフィーは映画を撮影する技術であり、テレシネマトグラフィーはそのフィルムをビデオに変換する技術です。"}],"priority":"★☆☆"},"related_words":{"derivatives":["telecine (名詞: テレシネ機器、テレシネプロセス)","cinematography (名詞: 映画撮影)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Telecinematography\" is a technical term referring to the process of converting motion picture film into a video signal. This is essential for broadcasting movies on television or for creating digital versions of films. The term is primarily used in professional contexts within the film and television industries. Understanding this term requires familiarity with both film and video technology.","priority":"★☆☆"},"example_sentences":[{"sentence":"The telecinematography process ensured the film's original quality was preserved for television broadcast.","translation":"テレシネマトグラフィーのプロセスにより、映画のオリジナルの品質がテレビ放送のために維持されました。","type":"noun","meaning_category":"映画フィルムからビデオ信号への変換"},{"sentence":"Advances in telecinematography have made it possible to create high-definition digital versions of classic films.","translation":"テレシネマトグラフィーの進歩により、古典映画の高解像度デジタル版を作成することが可能になりました。","type":"noun","meaning_category":"映画フィルムからビデオ信号への変換"}]}