{"word":"Trispast","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical) A type of pulley system or crane used in ancient Greece, consisting of three pulleys.","english_definition":"(historical) A type of pulley system or crane used in ancient Greece, consisting of three pulleys.","examples":[{"sentence":"The trispast allowed them to lift heavy stones for the temple construction.","translation":"トリスパストのおかげで、彼らは寺院建設のために重い石を持ち上げることができました。"}],"collocations":["use a trispast","operate a trispast"],"synonyms":["pulley system","crane"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek τρισπάστος (trispástos), from τρι- (tri-, “three”) + σπάω (spáō, “I draw, pull”).","priority":"★★★"},"pronunciation":{"ipa":"/ˈtrɪspæst/","syllables":"tris-past"},"inflection":{"noun_plural":"Trispasts"},"usage_notes":{"explanation":"The term 'trispast' refers specifically to a three-pulley system used in ancient times. It is primarily of historical interest.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a trispast to lift the car engine today.","correct":"✓ I used a modern crane/pulley system to lift the car engine today.","note":"The term 'trispast' is specific to ancient Greek technology. Modern pulley systems should be referred to as cranes or pulley systems."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["pulley","crane","lever","mechanics"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. Primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'trispast' is a technical term related to ancient Greek engineering. It is unlikely to be encountered outside of historical or academic texts. Understanding requires knowledge of classical history and basic mechanical principles."},"example_sentences":[{"sentence":"Archaeological evidence suggests the widespread use of the trispast in the construction of monumental structures.","translation":"考古学的証拠は、記念碑的な建造物の建設におけるトリスパストの広範な使用を示唆しています。","type":"noun","meaning_category":"historical pulley system"},{"sentence":"The efficiency of the trispast allowed for the movement of large blocks of stone with relatively little manpower.","translation":"トリスパストの効率性により、比較的少ない人員で大きな石材の移動が可能になりました。","type":"noun","meaning_category":"historical pulley system"}]}