{"word":"library-dependent","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ライブラリに依存する、ライブラリに依存関係がある","english_definition":"Relying on or requiring external libraries to function.","examples":[{"sentence":"This software is library-dependent; it won't run without the necessary libraries installed.","translation":"このソフトウェアはライブラリに依存しています。必要なライブラリがインストールされていないと実行できません。"},{"sentence":"The project's library-dependent nature makes it difficult to distribute as a single executable.","translation":"プロジェクトがライブラリに依存しているため、単一の実行可能ファイルとして配布するのが困難になっています。"}],"collocations":["highly library-dependent (非常にライブラリ依存性が高い)","library-dependent software (ライブラリ依存型のソフトウェア)","library-dependent application (ライブラリ依存型のアプリケーション)"],"synonyms":["dependency-based","reliant on libraries"],"antonyms":["self-contained","standalone","library-independent"]},{"part_of_speech":"adjective","definition":"(比喩的に) 他者に頼る、自立していない","english_definition":"(Figuratively) Relying on others for support or assistance; not self-sufficient.","examples":[{"sentence":"His success was library-dependent; he couldn't have achieved it without the help of his mentors.","translation":"彼の成功は他者への依存によるものでした。指導者の助けなしには達成できなかったでしょう。"}],"collocations":[],"synonyms":["dependent","reliant","needy"],"antonyms":["independent","self-sufficient"]}],"etymology":{"value":"The term is formed by combining \"library\" (referring to a collection of code or resources) and \"dependent\" (meaning relying on something).","priority":"☆☆☆"},"pronunciation":{"ipa":null,"syllables":"li-bra-ry-de-pen-dent"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"The term \"library-dependent\" is commonly used in software development to describe applications or programs that require external libraries to function correctly. These libraries provide pre-written code and functions that the program utilizes, reducing the amount of code that needs to be written from scratch. While using libraries can speed up development and provide access to specialized functionality, it also introduces dependencies that must be managed. The figurative meaning extends this concept to describe situations where someone or something relies heavily on external support or resources.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The program is depend on library.","correct":"✓ The program is library-dependent. / ✓ The program depends on a library.","note":"Ensure correct grammatical structure. Use the adjective form 'library-dependent' or the verb form 'depends on a library'."}],"priority":"☆☆☆"},"related_words":{"derivatives":["dependency","library","independent"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":null,"priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'library-dependent' is a technical term primarily used in software development to describe software that relies on external libraries to function. It implies that the software cannot operate without these libraries being present and correctly configured. Understanding this term requires familiarity with software development concepts such as libraries, dependencies, and software architecture. The figurative use of the term is less common and requires an understanding of the analogy between software dependencies and reliance on external support in other contexts."},"example_sentences":[{"sentence":"The application is highly **library-dependent**, requiring several specific versions of system libraries.","translation":"そのアプリケーションは非常にライブラリ依存性が高く、システムライブラリの特定のバージョンがいくつか必要です。","type":"adjective","meaning_category":"ライブラリに依存する"},{"sentence":"Due to its **library-dependent** nature, deploying the software requires careful management of dependencies.","translation":"ライブラリ依存型であるため、ソフトウェアをデプロイするには、依存関係を慎重に管理する必要があります。","type":"adjective","meaning_category":"ライブラリに依存する"}]}