{"word":"casuist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"詭弁家、こじつけ論者、ケースワーカー（特に倫理問題について）","english_definition":"a person who uses clever but unsound reasoning, especially in relation to moral questions; a person who resolves moral problems by applying theoretical rules to particular instances.","examples":[{"sentence":"He was accused of being a casuist, twisting the facts to suit his argument.","translation":"彼は詭弁家だと非難され、自分の議論に合うように事実をねじ曲げていると言われた。"},{"sentence":"The casuist argued that lying was permissible in certain extreme circumstances.","translation":"その詭弁家は、特定の極端な状況においては嘘をつくことが許されると主張した。"},{"sentence":"As a social worker, she acted as a casuist, applying ethical principles to complex cases.","translation":"ソーシャルワーカーとして、彼女はケースワーカーとして行動し、倫理原則を複雑な事例に適用した。"}],"collocations":["moral casuist (道徳的詭弁家)","ethical casuist (倫理的詭弁家)","legal casuist (法律的詭弁家)","a skilled casuist (熟練した詭弁家)","a subtle casuist (巧妙な詭弁家)"],"synonyms":["sophist","quibbler","hair-splitter","subtle reasoner","moralist","ethicist"],"antonyms":["straightforward thinker","honest arguer","truth-seeker"]},{"part_of_speech":"adjective","definition":"詭弁的な、こじつけの","english_definition":"characterized by or involving casuistry; sophistical.","examples":[{"sentence":"His argument was casuist and unconvincing.","translation":"彼の議論は詭弁的で説得力がなかった。"},{"sentence":"The casuist approach to the problem only complicated matters further.","translation":"その問題に対する詭弁的なアプローチは、事態をさらに複雑にしただけだった。"}],"collocations":["casuist argument (詭弁的な議論)","casuist reasoning (詭弁的な推論)","casuist approach (詭弁的なアプローチ)"],"synonyms":["sophistical","quibbling","specious","deceptive","fallacious"],"antonyms":["straightforward","honest","truthful"]}],"etymology":{"value":"16th century: from French casuiste, from Italian casista, from caso ‘case’ (from Latin casus, from cadere ‘to fall’).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkæʒuɪst/","syllables":"cas-u-ist"},"inflection":{"noun_plural":"casuists","adjective_form":"casuistic"},"usage_notes":{"explanation":"The term \"casuist\" can have both neutral and negative connotations. In a neutral sense, it refers to someone who applies general principles to specific cases, especially in ethics or law. However, more often, it carries a negative meaning, describing someone who uses clever but deceptive reasoning to justify questionable actions or beliefs. The adjective form, \"casuistic,\" usually has a negative connotation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a casualist in his approach to ethics.","correct":"✓ He is a casuist in his approach to ethics.","note":"The word is \"casuist,\" not \"casualist.\" They have very different meanings."},{"incorrect":"✗ Her argument was very casuistic, so everyone agreed with her.","correct":"✓ Her argument was very casuistic, so no one was convinced.","note":"\"Casuistic\" arguments are typically unconvincing because they rely on flawed reasoning."}],"priority":"★★☆"},"related_words":{"derivatives":["casuistry (名詞: 詭弁術、ケースワーク)","casuistical (形容詞: 詭弁的な)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"casuist\" refers to someone who is skilled at using clever but often misleading reasoning, especially when dealing with moral or ethical issues. It often implies that the person is twisting the rules or facts to suit their own purposes. The word has a negative connotation, suggesting that the person is not being honest or straightforward. The related term \"casuistry\" refers to the practice of using this type of reasoning. This word is not commonly used in everyday conversation and is more likely to be found in academic or philosophical discussions."},"example_sentences":[{"sentence":"The politician was criticized for being a **casuist**, always finding ways to justify his actions.","translation":"その政治家は、常に自分の行動を正当化する方法を見つける詭弁家だと批判された。","type":"noun","meaning_category":"詭弁家"},{"sentence":"The lawyer used **casuist** arguments to defend his client.","translation":"弁護士は、クライアントを弁護するために詭弁的な議論を用いた。","type":"adjective","meaning_category":"詭弁的な"},{"sentence":"The professor warned against relying on **casuistry** to solve ethical dilemmas.","translation":"教授は、倫理的なジレンマを解決するために詭弁術に頼ることを戒めた。","type":"related word (casuistry)","meaning_category":"詭弁術"}]}