{"word":"sidespins","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(卓球、テニスなどで)横回転","english_definition":"A spin given to a ball that causes it to rotate on a vertical axis, making it curve sideways in flight.","examples":[{"sentence":"He used sidespins to curve the ball away from his opponent.","translation":"彼は横回転を使ってボールを相手から遠ざけた。"},{"sentence":"The player's signature move was a powerful serve with heavy sidespins.","translation":"その選手の得意技は、強い横回転のかかった強力なサーブだった。"}],"collocations":["apply sidespins","generate sidespins","heavy sidespins","reverse sidespins"],"synonyms":["curve","spin","hook"],"antonyms":[]}],"etymology":{"value":"The word 'sidespins' is derived from the combination of 'side' and 'spin', indicating a spin applied to the side of the ball.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsaɪdˌspɪnz/","syllables":"side-spins"},"inflection":{"noun_plural":"sidespins"},"usage_notes":{"explanation":"'Sidespins' is primarily used in the context of sports like table tennis (ping-pong) and tennis, where imparting a spin on the ball is a crucial technique. The effect of sidespins is to make the ball curve in flight, making it more difficult for the opponent to predict and return.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a sidespin.","correct":"✓ He used sidespins.","note":"'Sidespins' is often used in the plural form, even when referring to a single instance of applying the spin."}],"priority":"★★☆"},"related_words":{"derivatives":["spin","topspin","backspin"],"sports":["table tennis","tennis","golf"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sidespins' refers to a specific type of spin applied to a ball, primarily in sports like tennis and table tennis. It involves imparting a rotation on a vertical axis, causing the ball to curve sideways during its trajectory. Understanding and using sidespins effectively requires a good grasp of the physics involved in ball spin and trajectory. The term is more commonly encountered in discussions about sports techniques and strategies.","priority":"★★☆"},"example_sentences":[{"sentence":"The table tennis player skillfully used sidespins to deceive his opponent.","translation":"その卓球選手は巧みに横回転を使って相手を欺いた。","type":"example","meaning_category":"technique"},{"sentence":"The tennis coach explained how to generate more sidespins on the serve.","translation":"テニスのコーチはサーブでより多くの横回転をかける方法を説明した。","type":"example","meaning_category":"instruction"},{"sentence":"The effect of sidespins is to make the ball curve in an unpredictable way.","translation":"横回転の効果は、ボールを予測不可能な方向に曲げることだ。","type":"example","meaning_category":"effect"}]}