{"word":"Paedobaptism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"幼児洗礼：幼児に洗礼を授けるキリスト教の習慣","english_definition":"The Christian practice of baptizing infants or young children.","examples":[{"sentence":"Paedobaptism is a common practice in many denominations of Christianity.","translation":"幼児洗礼はキリスト教の多くの宗派で一般的な習慣です。"},{"sentence":"The theology of paedobaptism differs significantly from that of credobaptism.","translation":"幼児洗礼の神学は、信仰告白洗礼の神学とは大きく異なります。"}],"collocations":["practice paedobaptism","believe in paedobaptism","oppose paedobaptism"],"synonyms":["infant baptism"],"antonyms":["credobaptism (信仰告白洗礼)"],"notes":"Paedobaptism is contrasted with credobaptism, which is the practice of baptizing only individuals who profess faith in Christ."}],"etymology":{"value":"From the Greek words 'paidos' (child) and 'baptismos' (baptism).","priority":"★★★"},"pronunciation":{"ipa":"ˌpiːdəʊˈbæptɪzəm","syllables":"pee-doh-bap-ti-zem"},"inflection":{"noun_plural":"paedobaptisms"},"usage_notes":{"explanation":"Paedobaptism is a theological issue that divides many Christian denominations. Proponents argue that it is a continuation of the Old Testament practice of circumcision, while opponents argue that baptism should only be administered to those who can consciously profess faith.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Paedobaptism is when you baptise when you are a baby.","correct":"✓ Paedobaptism is the practice of baptizing infants.","note":"The first sentence is grammatically awkward. The second is a more concise and accurate definition."}],"priority":"★☆☆"},"related_words":{"derivatives":["paedobaptist (noun: 幼児洗礼を支持する人)"],"related_terms":["baptism","credobaptism","infant baptism"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - specialized religious term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Paedobaptism' is a term used in Christian theology to refer to the practice of baptizing infants or young children. It's a complex topic with significant theological implications, often discussed in the context of comparing it to 'credobaptism,' which is the baptism of believers who can profess their faith. Understanding this term requires familiarity with Christian theological concepts.","notes":"This explanation is intended for someone with a good understanding of religious terminology."},"example_sentences":[{"sentence":"The pastor explained the church's stance on paedobaptism during the service.","translation":"牧師は礼拝中に教会における幼児洗礼の立場を説明しました。","type":"example","meaning_category":"general"},{"sentence":"Some argue that paedobaptism symbolizes the covenant community's inclusion of children.","translation":"幼児洗礼は、契約共同体が子供たちを含むことを象徴すると主張する人もいます。","type":"example","meaning_category":"theological argument"}]}