{"word":"nonmodally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"様相的にではなく、様相性なしに","english_definition":"In a way that is not modal; without modality.","examples":[{"sentence":"The information was presented nonmodally, without any indication of possibility or necessity.","translation":"その情報は、可能性や必要性を示すことなく、様相性なしに提示された。"},{"sentence":"We need to analyze the data nonmodally before applying any modal logic.","translation":"様相論理を適用する前に、データを様相性なしに分析する必要がある。"}],"collocations":["present nonmodally","analyze nonmodally"],"synonyms":["directly","literally","factually"],"antonyms":["modally"],"notes":"Primarily used in philosophical, logical, and linguistic contexts."}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the adverb 'modally'.","priority":"★★★"},"pronunciation":{"ipa":"/nɒnˈmoʊdəli/","syllables":"non-mo-dal-ly"},"inflection":{"notes":"As an adverb, it does not inflect."},"usage_notes":{"explanation":"'Nonmodally' is a term primarily used in academic fields such as philosophy, logic, and linguistics. It describes something that is presented or analyzed without considering modal aspects, such as possibility, necessity, or obligation. It is the opposite of 'modally', which involves these considerations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The data was nonmodally and accurately presented.","correct":"✓ The data was presented nonmodally and accurately.","note":"'Nonmodally' is an adverb and should modify the verb (e.g., 'presented'). It should not be used as an adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["nonmodal (adjective)","modally (adverb)","modality (noun)"],"related_terms":["modal logic","modal analysis","alethic modality","epistemic modality","deontic modality"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily found in academic texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'nonmodally' is highly specialized and primarily encountered in academic and technical contexts, particularly in philosophy, logic, and linguistics. It signifies the absence of modal considerations, such as possibility, necessity, or obligation, in the presentation or analysis of information. Due to its specific and technical nature, it is not typically used in general conversation or writing."},"example_sentences":[{"sentence":"The argument was structured nonmodally, focusing solely on factual claims.","translation":"その議論は、事実の主張のみに焦点を当てて、様相性なしに構成された。","type":"adverb","meaning_category":"Without modality"},{"sentence":"We examined the sentence nonmodally to identify its core propositional content.","translation":"文の核となる命題の内容を特定するために、その文を様相性なしに調べた。","type":"adverb","meaning_category":"Without modality"}]}