{"word":"cosmesis","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(医学)整容、美容整形、外観の改善","english_definition":"The surgical or medical correction or improvement of a defect, especially one that is disfiguring. Also, the overall aesthetic result of a surgical procedure.","examples":[{"sentence":"The goal of the surgery was cosmesis and function.","translation":"手術の目的は整容と機能の回復だった。"},{"sentence":"Good cosmesis is an important consideration in reconstructive surgery.","translation":"良好な整容外科手術は、再建手術において重要な考慮事項である。"},{"sentence":"The cosmesis of the scar was excellent.","translation":"傷跡の整容状態は非常に良好だった。"}],"collocations":["achieve cosmesis (整容を達成する)","improve cosmesis (整容を改善する)","surgical cosmesis (外科的整容)","facial cosmesis (顔面整容)","poor cosmesis (不良な整容)","good cosmesis (良好な整容)"],"synonyms":["aesthetic outcome","cosmetic result","appearance","physical appearance","reconstruction"],"antonyms":["disfigurement","deformity"]},{"part_of_speech":"noun","definition":"(一般)外観、見た目、美観","english_definition":"The overall appearance or aesthetic quality of something.","examples":[{"sentence":"The cosmesis of the building was enhanced by the new landscaping.","translation":"新しい景観によって、建物の美観が向上した。"},{"sentence":"The artist focused on the cosmesis of the sculpture.","translation":"アーティストは彫刻の美観に焦点を当てた。"}],"collocations":["enhance cosmesis (美観を高める)","improve cosmesis (美観を改善する)","overall cosmesis (全体的な美観)"],"synonyms":["aesthetics","appearance","visual appeal","look","beauty"],"antonyms":["ugliness","unsightliness"]}],"etymology":{"value":"Derived from the Greek word 'kosmesis' (κόσμησις), meaning 'arrangement, order, adornment', from 'kosmeō' (κοσμέω) meaning 'to adorn, arrange, decorate'.","priority":"★★★"},"pronunciation":{"ipa":"/kɒzˈmiːsɪs/","syllables":"cos-me-sis"},"inflection":{"noun_plural":"cosmeses"},"usage_notes":{"explanation":"'Cosmesis' refers to the improvement of appearance, particularly after a medical procedure or injury. It emphasizes the aesthetic outcome and is often used in the context of surgery, dermatology, and reconstructive medicine. While it can refer to general appearance, it is most commonly associated with medical or surgical enhancements.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The cosmesis of the treatment was pain relief.","correct":"✓ The primary benefit of the treatment was pain relief. The cosmesis was an added benefit.","note":"'Cosmesis' refers to appearance, not function or other benefits. Pain relief is a functional outcome, not a cosmetic one."},{"incorrect":"✗ She used cosmesis to clean her face.","correct":"✓ She used cosmetics to clean her face.","note":"'Cosmesis' is not a product; it is a result or a field of medicine. 'Cosmetics' are products used to enhance appearance."}],"priority":"★★☆"},"related_words":{"derivatives":["cosmetic (adjective: relating to beautifying; noun: a product used for beautifying)","cosmetically (adverb: in a way that improves appearance)","cosmetician (noun: a person who gives cosmetic treatments)","cosmetology (noun: the study and application of beauty treatments)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in medical and aesthetic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'cosmesis' is primarily used in medical and aesthetic contexts to describe the improvement or enhancement of appearance, especially after a surgical or medical procedure. It is not a commonly used word in everyday conversation. Understanding its meaning is important in fields such as plastic surgery, dermatology, and reconstructive medicine, where aesthetic outcomes are a significant consideration."},"example_sentences":[{"sentence":"The surgeon was pleased with the excellent **cosmesis** achieved after the breast reconstruction.","translation":"外科医は、乳房再建手術後に達成された優れた整容に満足していた。","type":"noun","meaning_category":"整容"},{"sentence":"The new landscaping significantly improved the **cosmesis** of the hospital grounds.","translation":"新しい景観は、病院の敷地の美観を大幅に改善した。","type":"noun","meaning_category":"美観"},{"sentence":"The doctor explained that the **cosmesis** of the scar would continue to improve over time.","translation":"医師は、傷跡の整容状態は時間の経過とともに改善し続けるだろうと説明した。","type":"noun","meaning_category":"整容"}]}