{"word":"angiohemophilia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"血管性血友病","english_definition":"A hereditary bleeding disorder characterized by a deficiency of von Willebrand factor, a protein needed for normal blood clotting.","examples":[{"sentence":"Angiohemophilia can cause prolonged bleeding after injuries or surgery.","translation":"血管性血友病は、怪我や手術後に長引く出血を引き起こす可能性があります。"}],"collocations":["von Willebrand disease","bleeding disorder","blood clotting"],"synonyms":["von Willebrand disease"],"antonyms":[]}],"etymology":{"value":"From angio- (referring to blood vessels), hemo- (referring to blood), and -philia (affinity or tendency).","priority":"★★★"},"pronunciation":{"ipa":"/ˌændʒioʊˌhiːməˈfɪliə/","syllables":"an-gi-o-he-mo-phil-i-a"},"inflection":{"noun_plural":"angiohemophilias"},"usage_notes":{"explanation":"Angiohemophilia is a synonym for von Willebrand disease. It is a genetic disorder affecting blood clotting.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["angiohemophiliac (noun, adjective)"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"Angiohemophilia, also known as von Willebrand disease, is a rare genetic condition that affects the blood's ability to clot properly, leading to prolonged or excessive bleeding. It's caused by a deficiency or dysfunction of von Willebrand factor, a protein crucial for blood clotting. Symptoms can vary widely, from mild nosebleeds to severe bleeding after surgery or injury. Diagnosis involves blood tests to measure von Willebrand factor levels and function. Treatment options range from medications to prevent bleeding to replacement therapy with von Willebrand factor concentrate."},"example_sentences":[{"sentence":"The patient was diagnosed with angiohemophilia after experiencing prolonged bleeding following a minor surgery.","translation":"患者は、軽微な手術後の長引く出血を経験した後、血管性血友病と診断されました。","type":"medical","meaning_category":"diagnosis"},{"sentence":"Management of angiohemophilia often involves desmopressin to increase von Willebrand factor levels.","translation":"血管性血友病の管理には、しばしばフォン・ヴィレブランド因子のレベルを上げるためにデスモプレシンが用いられます。","type":"medical","meaning_category":"treatment"}]}