{"word":"asymmetrically","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"非対称的に、不均衡に","english_definition":"in an asymmetrical manner; without symmetry or balance.","examples":[{"sentence":"The artist arranged the flowers asymmetrically in the vase.","translation":"芸術家は花瓶に花を非対称的に配置した。"},{"sentence":"Her face was beautiful, even though her features were asymmetrically placed.","translation":"彼女の顔立ちは非対称に配置されていたが、それでも美しかった。"},{"sentence":"The design of the building was intentionally asymmetrical.","translation":"その建物のデザインは意図的に非対称だった。"}],"collocations":["arranged asymmetrically","placed asymmetrically","designed asymmetrically","grown asymmetrically"],"synonyms":["unevenly","irregularly","disproportionately","unbalancedly"],"antonyms":["symmetrically","evenly","regularly","proportionately","balancedly"]}],"etymology":{"value":"\"Asymmetrical\" + \"-ly\". Asymmetrical comes from the prefix \"a-\" (meaning \"not\") + \"symmetrical\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌeɪsɪˈmetrɪkli/","syllables":"a-sym-met-ri-cal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"\"Asymmetrically\" describes how something is done or arranged in a way that lacks symmetry. Symmetry implies a mirror-like correspondence between two halves, while asymmetry suggests a lack of this correspondence. The adverb is often used in contexts of art, design, biology, and physics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The picture was asymmetrically, so I fixed it.","correct":"✓ The picture was asymmetrical, so I fixed it.","note":"\"Asymmetrically\" is an adverb, used to describe *how* something is done. \"Asymmetrical\" is an adjective, used to describe the *state* of something. This sentence requires the adjective."},{"incorrect":"✗ He arranged the books asymmetry.","correct":"✓ He arranged the books asymmetrically.","note":"\"Asymmetry\" is a noun. The sentence requires an adverb."}],"priority":"★★☆"},"related_words":{"derivatives":["asymmetry (noun)","asymmetrical (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"asymmetrically\" describes something done in a way that lacks symmetry. It's used when things are not balanced or mirrored. It's more common in technical or descriptive contexts, such as art, design, or science, where precise language is important. It's not an everyday word, but it's useful for describing uneven arrangements or designs.","priority":"★★☆"},"example_sentences":[{"sentence":"The branches of the tree grew asymmetrically due to the prevailing winds.","translation":"その木の枝は卓越風のために非対称に成長した。","type":"adverb","meaning_category":"非対称に"},{"sentence":"The artist intentionally placed the eyes asymmetrically to create a sense of unease.","translation":"芸術家は不安感を出すために、意図的に目を非対称に配置した。","type":"adverb","meaning_category":"非対称に"},{"sentence":"The pattern on the fabric was asymmetrically designed, giving it a modern look.","translation":"生地の模様は非対称にデザインされており、モダンな外観になっている。","type":"adverb","meaning_category":"非対称に"}]}