{"word":"Dacus","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ミバエ属","english_definition":"A genus of fruit flies in the family Tephritidae.","examples":[{"sentence":"The Dacus genus includes many economically important fruit fly pests.","translation":"ミバエ属には、経済的に重要な害虫であるミバエが多数含まれています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the Ancient Greek word 'δάκος' (dákos) meaning 'biting insect, especially a worm in olives'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdeɪkəs/","syllables":"Da-cus"},"inflection":{"noun_plural":"Dacus (taxonomic names are often treated as singular even when referring to multiple species)"},"usage_notes":{"explanation":"'Dacus' is a scientific term used in entomology and agriculture. It refers specifically to a genus of fruit flies, many of which are considered pests due to the damage they cause to fruit crops.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Dacini (a tribe within Tephritidae that includes Dacus)"],"related_terms":["Tephritidae (the fruit fly family)","Bactrocera (another genus of fruit flies, sometimes considered a subgenus of Dacus)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dacus' is a technical term used in the field of entomology (the study of insects) and agriculture. It refers to a specific genus of fruit flies. Understanding this term requires familiarity with scientific nomenclature and the classification of organisms."},"example_sentences":[{"sentence":"Dacus species are known to infest a wide range of fruits.","translation":"ミバエ属の種は、広範囲の果実に寄生することが知られています。","type":"scientific","meaning_category":"entomology"},{"sentence":"Control measures are often necessary to prevent Dacus infestations in orchards.","translation":"果樹園でのミバエの蔓延を防ぐためには、防除対策が必要となることが多いです。","type":"agricultural","meaning_category":"agriculture"}]}