{"word":"heterochromosome","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"性染色体 (異型染色体)","english_definition":"A sex chromosome, especially one that is different in morphology or behavior from the other sex chromosome in a heterogametic sex.","examples":[{"sentence":"In humans, the X and Y chromosomes are heterochromosomes.","translation":"ヒトでは、X染色体とY染色体が性染色体です。"},{"sentence":"The heterochromosomes determine the sex of the offspring.","translation":"性染色体は子孫の性を決定します。"}],"collocations":["sex chromosome","X chromosome","Y chromosome","heterogametic sex"],"synonyms":["sex chromosome","gonosome"],"antonyms":["autosome"]}],"etymology":{"value":"Derived from the Greek words 'hetero' (different), 'chromo' (color), and 'chromosome'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɛtərəˈkroʊməˌsoʊm/","syllables":"het-er-o-chro-mo-some"},"inflection":{"noun_plural":"heterochromosomes"},"usage_notes":{"explanation":"'Heterochromosome' is primarily used in genetics and biology to refer to sex chromosomes, particularly when discussing differences in their structure or behavior. The term emphasizes the dissimilar nature of these chromosomes within a species, especially in species with heterogametic sex determination (e.g., mammals with XY sex determination).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Heterochromosomes are the same in males and females.","correct":"✓ Heterochromosomes are different in males and females in species with heterogametic sex determination.","note":"Heterochromosomes, by definition, are different in heterogametic sexes (e.g., XY males and XX females)."},{"incorrect":"✗ Autosomes are heterochromosomes.","correct":"✓ Autosomes are not heterochromosomes; they are non-sex chromosomes.","note":"Autosomes are non-sex chromosomes, while heterochromosomes are sex chromosomes."}],"priority":"★★☆"},"related_words":{"derivatives":["heterochromatin","chromosome","sex chromosome","autosome","homologous chromosome"],"phrases":["sex determination","genetic inheritance"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'heterochromosome' is a technical term used in genetics to describe sex chromosomes, particularly when they differ in size, shape, or behavior between the sexes. It's most often used in the context of explaining sex determination and genetic inheritance patterns. Understanding this term requires a background in basic genetics.","priority":"★★☆"},"example_sentences":[{"sentence":"The Y chromosome is a heterochromosome that is only present in males.","translation":"Y染色体は男性にのみ存在する性染色体です。","type":"noun","meaning_category":"sex chromosome"},{"sentence":"Analysis of heterochromosomes can reveal information about sex-linked genetic disorders.","translation":"性染色体の分析は、性別に関連する遺伝性疾患に関する情報を明らかにすることができます。","type":"noun","meaning_category":"sex chromosome"},{"sentence":"The size and structure of heterochromosomes can vary significantly between species.","translation":"性染色体のサイズと構造は、種間で大きく異なる場合があります。","type":"noun","meaning_category":"sex chromosome"}]}