{"word":"ketekunan","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"Kegigihan, kesabaran, dan keteguhan hati dalam melakukan sesuatu meskipun menghadapi kesulitan atau tantangan.","english_definition":"Persistence, patience, and determination in doing something despite difficulties or challenges.","examples":[{"sentence":"Ketekunan adalah kunci untuk mencapai kesuksesan.","translation":"Persistence is the key to achieving success.","note":"Menunjukkan bahwa ketekunan merupakan faktor penting dalam meraih keberhasilan."},{"sentence":"Dia mencapai tujuannya berkat ketekunannya dalam belajar.","translation":"He achieved his goal thanks to his persistence in studying.","note":"Menjelaskan bagaimana ketekunan membantu seseorang mencapai tujuan."},{"sentence":"Ketekunan dalam menghadapi masalah akan membawa solusi.","translation":"Persistence in facing problems will bring solutions.","note":"Menekankan bahwa ketekunan dapat membantu menemukan solusi atas masalah."}],"collocations":["Ketekunan dalam belajar (persistence in studying)","Ketekunan dalam bekerja (persistence in working)","Ketekunan menghadapi tantangan (persistence in facing challenges)","Memiliki ketekunan (to have persistence)","Menunjukkan ketekunan (to show persistence)"],"synonyms":["kegigihan","kesabaran","keuletan","ketabahan","determinasi"],"antonyms":["kemalasan","ketidakpedulian","kecerobohan"]},{"part_of_speech":"noun","definition":"Kemampuan untuk terus berusaha dan tidak mudah menyerah.","english_definition":"The ability to keep trying and not give up easily.","examples":[{"sentence":"Seorang atlet membutuhkan ketekunan untuk berlatih setiap hari.","translation":"An athlete needs persistence to train every day.","note":"Menunjukkan bahwa ketekunan diperlukan untuk latihan rutin."},{"sentence":"Ketekunan adalah sifat yang sangat dihargai dalam dunia kerja.","translation":"Persistence is a highly valued trait in the working world.","note":"Menekankan pentingnya ketekunan di tempat kerja."},{"sentence":"Tanpa ketekunan, sulit untuk menyelesaikan proyek yang kompleks.","translation":"Without persistence, it is difficult to complete a complex project.","note":"Menjelaskan bahwa ketekunan penting untuk menyelesaikan tugas yang rumit."}],"collocations":["Memupuk ketekunan (to cultivate persistence)","Membangun ketekunan (to build persistence)","Menguji ketekunan (to test persistence)","Ketekunan diri (self-persistence)"],"synonyms":["daya tahan","semangat juang","keberanian","optimisme"],"antonyms":["keputusasaan","pesimisme"]}],"etymology":{"value":"Kata 'ketekunan' berasal dari kata dasar 'tekun' yang berarti rajin, sungguh-sungguh, atau giat. Penambahan awalan 'ke-' dan akhiran '-an' membentuk kata benda abstrak yang merujuk pada sifat atau keadaan tekun.","priority":"★★☆"},"pronunciation":{"ipa":"/kə.t̪e.ku.nan/","syllables":"ke-te-ku-nan"},"inflection":{"notes":"Sebagai kata benda (noun), 'ketekunan' tidak mengalami perubahan bentuk jamak atau tunggal. Bentuknya tetap sama dalam berbagai konteks."},"usage_notes":{"explanation":"'Ketekunan' menekankan pada kualitas seseorang yang tidak mudah menyerah dan terus berusaha meskipun menghadapi rintangan. Kata ini sering dikaitkan dengan kesuksesan, pencapaian tujuan, dan kemampuan untuk mengatasi kesulitan. 'Ketekunan' lebih dari sekadar usaha keras; ini juga mencakup kesabaran, keteguhan hati, dan kemampuan untuk tetap fokus pada tujuan jangka panjang.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Dia memiliki ketekunan yang tinggi dalam belajar, tetapi dia tidak pintar.","correct":"Dia memiliki ketekunan yang tinggi dalam belajar, meskipun dia tidak terlalu pintar.","note":"Kalimat awal mengimplikasikan kontradiksi. 'Ketekunan' dan 'kepintaran' tidak saling eksklusif. Penggunaan 'meskipun' (although) lebih tepat."},{"incorrect":"Ketekunan adalah satu-satunya hal yang dibutuhkan untuk sukses.","correct":"Ketekunan adalah salah satu hal yang dibutuhkan untuk sukses.","note":"Kalimat awal terlalu absolut. Selain ketekunan, faktor lain seperti keterampilan, pengetahuan, dan kesempatan juga penting untuk sukses."},{"incorrect":"Dia menunjukkan ketekunan dengan menyerah setelah mencoba sekali.","correct":"Dia tidak menunjukkan ketekunan karena menyerah setelah mencoba sekali.","note":"Kalimat awal kontradiktif. Menyerah setelah satu kali percobaan bertentangan dengan konsep 'ketekunan'."}],"priority":"★★☆"},"related_words":{"derivatives":["tekun (adjective: diligent, persistent)","bertekun (verb: to be diligent, to persist)","menekuni (verb: to pursue diligently)"],"idioms_phrases":["Ketekunan membuahkan hasil (persistence pays off)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Cukup sering digunakan (Moderately frequent). Kata ini umum dalam konteks pendidikan, pekerjaan, dan pengembangan diri.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'Ketekunan' adalah kata yang menggambarkan sifat seseorang yang terus berusaha dan tidak mudah menyerah, meskipun ada banyak kesulitan. Ini adalah kualitas yang penting untuk mencapai tujuan dan mengatasi masalah. Kata ini sering digunakan dalam konteks belajar, bekerja, dan mencapai impian. Memahami arti 'ketekunan' dapat membantu Anda menghargai pentingnya usaha dan kegigihan dalam hidup.","priority":"★★☆"},"example_sentences":[{"sentence":"Dengan **ketekunan**, dia akhirnya berhasil menyelesaikan studinya.","translation":"With persistence, he finally managed to complete his studies.","type":"general","meaning_category":"Kegigihan dalam menyelesaikan sesuatu."},{"sentence":"**Ketekunan** adalah kunci utama untuk mencapai impianmu.","translation":"Persistence is the main key to achieving your dreams.","type":"general","meaning_category":"Pentingnya ketekunan dalam meraih impian."},{"sentence":"Dia menunjukkan **ketekunan** yang luar biasa dalam menghadapi penyakitnya.","translation":"He showed extraordinary persistence in facing his illness.","type":"personal","meaning_category":"Ketabahan dalam menghadapi kesulitan pribadi."},{"sentence":"Proyek ini membutuhkan **ketekunan** dan kesabaran yang tinggi.","translation":"This project requires high persistence and patience.","type":"professional","meaning_category":"Ketekunan dalam pekerjaan."}]}