{"word":"Lamarckian","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ラマルク説の、獲得形質遺伝の","english_definition":"Relating to or characteristic of Lamarckism, the theory of inheritance of acquired characteristics.","examples":[{"sentence":"Lamarckian inheritance is now largely discredited.","translation":"ラマルク説の遺伝は現在、ほぼ否定されている。"},{"sentence":"Some epigenetic phenomena show Lamarckian aspects.","translation":"いくつかのエピジェネティクス現象は、ラマルク説的な側面を示す。"}],"collocations":["Lamarckian inheritance","Lamarckian evolution","Lamarckian theory"],"synonyms":["inheritance of acquired characteristics"],"antonyms":["Darwinian","Mendelian"]},{"part_of_speech":"noun","definition":"ラマルク説支持者","english_definition":"A proponent of Lamarckism.","examples":[{"sentence":"Lamarckians believed that organisms could pass on traits acquired during their lifetime.","translation":"ラマルク説支持者たちは、生物は生涯に獲得した形質を子孫に伝えることができると信じていた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after French naturalist Jean-Baptiste Lamarck (1744-1829), who proposed the theory of inheritance of acquired characteristics.","priority":"★★★"},"pronunciation":{"ipa":"/ləˈmɑːrkiən/","syllables":"La-mar-ki-an"},"inflection":{"noun_plural":"Lamarckians"},"usage_notes":{"explanation":"'Lamarckian' refers to the theory of inheritance of acquired characteristics, proposed by Jean-Baptiste Lamarck. This theory suggests that organisms can pass on traits acquired during their lifetime to their offspring. While largely discredited in favor of Darwinian evolution, some epigenetic phenomena have renewed interest in certain aspects of Lamarckian inheritance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Lamarckian evolution is the same as Darwinian evolution.","correct":"✓ Lamarckian evolution is different from Darwinian evolution.","note":"Lamarckian evolution and Darwinian evolution are distinct theories. Lamarckian evolution proposes inheritance of acquired characteristics, while Darwinian evolution focuses on natural selection of inherited traits."}],"priority":"★★☆"},"related_words":{"derivatives":["Lamarckism"],"related_terms":["epigenetics","Darwinism","Mendelian genetics"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Lamarckian' is related to the theory of inheritance of acquired characteristics, proposed by Jean-Baptiste Lamarck. It is a scientific term used in the context of evolutionary biology and genetics. Understanding requires knowledge of basic evolutionary theories and genetics. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The concept of Lamarckian inheritance was influential in the early development of evolutionary thought.","translation":"ラマルク説の遺伝の概念は、進化論の初期の発展に影響を与えた。","type":"adjective","meaning_category":"ラマルク説の"},{"sentence":"Some modern studies explore epigenetic mechanisms that resemble Lamarckian inheritance.","translation":"いくつかの現代の研究は、ラマルク説の遺伝に似たエピジェネティックなメカニズムを探求している。","type":"adjective","meaning_category":"ラマルク説の"},{"sentence":"Lamarckians argued that giraffes developed long necks through generations of stretching to reach high branches.","translation":"ラマルク説支持者たちは、キリンが高い枝に届くために世代を超えて首を伸ばした結果、長い首を発達させたと主張した。","type":"noun","meaning_category":"ラマルク説支持者"}]}