{"word":"relevance-oriented","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"関連性を重視した、関連性指向の","english_definition":"Focused on or prioritizing relevance; designed or evaluated based on its pertinence or applicability to a specific context or purpose.","examples":[{"sentence":"The search engine uses a relevance-oriented algorithm to provide the most useful results.","translation":"その検索エンジンは、最も役立つ結果を提供するために、関連性指向のアルゴリズムを使用しています。"},{"sentence":"The course curriculum is relevance-oriented, ensuring that students learn skills applicable to their future careers.","translation":"そのコースのカリキュラムは関連性指向であり、学生が将来のキャリアに役立つスキルを確実に習得できるようにしています。"},{"sentence":"The company adopted a relevance-oriented marketing strategy to better target its key demographics.","translation":"その会社は、主要な顧客層をより適切にターゲットとするために、関連性指向のマーケティング戦略を採用しました。"}],"collocations":["relevance-oriented algorithm","relevance-oriented curriculum","relevance-oriented marketing","relevance-oriented approach","relevance-oriented design"],"synonyms":["pertinence-focused","context-driven","application-centered","purpose-driven"],"antonyms":["irrelevant","tangential","unrelated"]}],"etymology":{"value":"\"Relevance\" + \"oriented\". \"Relevance\" from Middle French, from Medieval Latin \"relevantia\". \"Oriented\" from \"orient\", meaning to face east or to align. Combined, it means aligned or focused on relevance.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɛləvəns ˌɔːriɛn.tɪd/","syllables":"rel-e-vance-o-ri-en-ted"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"\"Relevance-oriented\" is primarily used in technical or academic contexts. It emphasizes that something is specifically designed or chosen to be relevant to a particular situation or goal. It is often used in discussions of information retrieval, education, and marketing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The relevance oriented information.","correct":"✓ The relevance-oriented information.","note":"Hyphenate the compound adjective."}],"priority":"★☆☆"},"related_words":{"derivatives":["relevance","oriented","orientation"],"related_terms":["contextual","pertinent","applicable"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Relevance-oriented\" is a compound adjective describing something designed or chosen for its relevance to a specific purpose or context. It's often used in academic or technical fields to emphasize the importance of pertinence and applicability."},"example_sentences":[{"sentence":"The library's new system is designed to be highly relevance-oriented, ensuring users find the information they need quickly.","translation":"その図書館の新しいシステムは、高度に関連性指向になるように設計されており、ユーザーが必要な情報を迅速に見つけられるようにしています。","type":"adjective","meaning_category":"関連性を重視した"},{"sentence":"A relevance-oriented approach to education focuses on teaching students skills that are directly applicable to real-world problems.","translation":"教育への関連性指向のアプローチは、学生に現実世界の問題に直接適用できるスキルを教えることに焦点を当てています。","type":"adjective","meaning_category":"関連性を重視した"}]}