{"word":"Marginoplasty","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A surgical procedure to reshape or reconstruct the margins (edges) of a structure, often used in the context of eyelids or other facial features.","english_definition":"Surgical reshaping or reconstruction of a margin, especially of the eyelid.","examples":[{"sentence":"The patient underwent marginoplasty to correct the drooping eyelid.","translation":"患者は、垂れ下がったまぶたを矯正するために縁形成術を受けた。"},{"sentence":"Marginoplasty can improve both the function and appearance of the eyelid.","translation":"縁形成術は、まぶたの機能と外観の両方を改善することができる。"}],"collocations":["eyelid marginoplasty","surgical marginoplasty"],"synonyms":["edge reconstruction","margin repair"],"antonyms":[]}],"etymology":{"value":"Derived from 'margin' (edge or border) + '-o-' (linking vowel) + '-plasty' (surgical repair or reconstruction).","priority":"★★★"},"pronunciation":{"ipa":"/mɑːrˌdʒɪn.oʊˈplæsti/","syllables":"mar-gin-o-plas-ty"},"inflection":{"noun_plural":"marginoplasties"},"usage_notes":{"explanation":"Marginoplasty is typically used in medical contexts to describe surgical procedures aimed at improving the appearance or function of a margin or edge of a structure, most commonly the eyelid.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor performed a marginoplasty of the heart.","correct":"✓ The doctor performed a procedure to repair the heart valve.","note":"Marginoplasty is typically used for edges of structures, especially eyelids, not internal organs like the heart."}],"priority":"★★☆"},"related_words":{"derivatives":["-plasty","blepharoplasty"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Marginoplasty is a specialized medical term referring to the surgical reconstruction or reshaping of a margin, most often the eyelid. Understanding this term requires familiarity with medical terminology and surgical procedures. It is not commonly used outside of medical contexts."},"example_sentences":[{"sentence":"Eyelid marginoplasty is performed to address issues such as ectropion or entropion.","translation":"眼瞼縁形成術は、眼瞼外反または眼瞼内反などの問題に対処するために行われる。","type":"general","meaning_category":"surgical procedure"},{"sentence":"The surgeon used advanced techniques during the marginoplasty to minimize scarring.","translation":"外科医は、瘢痕を最小限に抑えるために、縁形成術中に高度な技術を使用した。","type":"technical","meaning_category":"surgical technique"}]}