{"word":"lotic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(生態学)流水性の、流れのある水域に生息する","english_definition":"(ecology) relating to or living in actively moving water.","examples":[{"sentence":"Lotic ecosystems are characterized by flowing water.","translation":"流水生態系は、流れる水によって特徴づけられる。"},{"sentence":"Many species of fish are adapted to lotic environments.","translation":"多くの魚種は、流水環境に適応している。"}],"collocations":["lotic ecosystem","lotic environment","lotic habitat","lotic organisms"],"synonyms":["flowing","running","rheophilic"],"antonyms":["lentic","standing","still"],"notes":"Lotic is often contrasted with lentic, which refers to standing water habitats like lakes and ponds."}],"etymology":{"value":"From Ancient Greek 'lotos' (λωτός) meaning 'washed', 'bathed'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈloʊtɪk/","syllables":"lo-tic"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"The term 'lotic' is primarily used in ecology and limnology (the study of inland waters) to describe aquatic habitats characterized by flowing water. It is often used in contrast to 'lentic', which describes still water habitats. The term is used to describe both the physical environment (e.g., lotic environment) and the organisms that live in it (e.g., lotic organisms).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The lotic is a type of lake.","correct":"✓ A lotic environment is a type of flowing water ecosystem.","note":"'Lotic' is an adjective, not a noun. It describes something related to flowing water, not a type of water body itself."}],"priority":"★★☆"},"related_words":{"derivatives":["limnology (湖沼学)","ecology (生態学)"],"related_terms":["lentic (静水性の)","riparian (河岸の)","fluvial (河川の)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'lotic' is a specialized term used in the field of ecology to describe environments with flowing water, such as rivers and streams. It is contrasted with 'lentic', which describes still water environments like lakes and ponds. Understanding this term is important for advanced discussions about aquatic ecosystems."},"example_sentences":[{"sentence":"The river provides a **lotic** habitat for a variety of aquatic insects.","translation":"その川は、多様な水生昆虫のための流水性生息地を提供している。","type":"adjective","meaning_category":"流水性の"},{"sentence":"**Lotic** ecosystems are more susceptible to pollution from upstream sources.","translation":"流水生態系は、上流からの汚染源の影響を受けやすい。","type":"adjective","meaning_category":"流水性の"}]}