{"word":"direction-dependent","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"方向依存性のある、方向によって性質や挙動が異なる","english_definition":"Having properties or behavior that vary depending on the direction.","examples":[{"sentence":"The friction force is direction-dependent; it's easier to slide the object one way than the other.","translation":"摩擦力は方向依存性があり、ある方向に物体を滑らせる方が別の方向よりも簡単です。"},{"sentence":"The antenna's signal strength is direction-dependent, providing better reception in certain areas.","translation":"アンテナの信号強度は方向依存性があり、特定のエリアでより良好な受信を提供します。"},{"sentence":"The material's conductivity is direction-dependent due to its anisotropic structure.","translation":"その材料の伝導率は、異方性構造のために方向依存性があります。"}],"collocations":["direction-dependent force (方向依存性のある力)","direction-dependent property (方向依存性のある特性)","direction-dependent behavior (方向依存性のある挙動)","highly direction-dependent (高度に方向依存性のある)","slightly direction-dependent (わずかに方向依存性のある)"],"synonyms":["anisotropic","orientation-dependent","directionally sensitive"],"antonyms":["isotropic","direction-independent"],"related_terms":["anisotropy","isotropy"]}],"etymology":{"value":"Formed by combining \"direction\" + \"dependent\".","priority":"☆☆☆"},"pronunciation":{"ipa":"/dəˈrɛkʃən dɪˈpɛndənt/","syllables":"di-rec-tion-de-pen-dent"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Direction-dependent' is often used in scientific and engineering contexts to describe phenomena where the outcome or characteristics change based on the direction of measurement or application. It implies a lack of symmetry in the properties being observed.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"The result is depend on direction.","correct":"The result is direction-dependent.","note":"'Direction-dependent' is an adjective, so it describes the noun. 'Depend on direction' is a verb phrase."}],"priority":"☆☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Technical term.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Direction-dependent' is a technical term used to describe something whose properties or behavior changes depending on the direction from which it is observed or measured. It is frequently used in physics, engineering, and materials science. Understanding this term requires a good grasp of scientific concepts and vocabulary."},"example_sentences":[{"sentence":"The solar panel's efficiency is direction-dependent; it generates the most power when facing the sun directly.","translation":"ソーラーパネルの効率は方向依存性があり、太陽に直接向いているときに最大の電力を生成します。","type":"general","meaning_category":"general"},{"sentence":"In crystal structures, the refractive index can be direction-dependent, leading to birefringence.","translation":"結晶構造では、屈折率は方向依存性を持つことがあり、複屈折につながります。","type":"technical","meaning_category":"physics"}]}