{"word":"deflocculator","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"分散剤、解膠剤：凝集した粒子を分散させる物質","english_definition":"A substance that promotes the dispersion of aggregated particles in a suspension; a dispersing agent.","examples":[{"sentence":"The deflocculator helped to keep the clay particles evenly distributed in the solution.","translation":"分散剤は、溶液中の粘土粒子を均等に分散させるのに役立った。"},{"sentence":"Adding a deflocculator to the paint prevented it from clumping.","translation":"塗料に分散剤を加えることで、塗料が凝集するのを防いだ。"}],"collocations":["add deflocculator","use deflocculator","clay deflocculator","paint deflocculator"],"synonyms":["dispersant","dispersing agent","peptizing agent"],"antonyms":["flocculant","coagulant"]},{"part_of_speech":"noun","definition":"（特にセラミックス製造における）解膠剤","english_definition":"A substance used to break up or prevent the formation of flocs, especially in the production of ceramics.","examples":[{"sentence":"The potter added a deflocculator to the slip to improve its workability.","translation":"陶芸家は、スリップの作業性を向上させるために解膠剤を加えた。"}],"collocations":["ceramic deflocculator","slip deflocculator"],"synonyms":["dispersant","peptizer"],"antonyms":["flocculant"]}],"etymology":{"value":"Derived from 'de-' (removal, reversal) + 'flocculate' (to aggregate into flocs) + '-or' (agent). Basically, something that reverses flocculation.","priority":"★★☆"},"pronunciation":{"ipa":"/diːˈflɒkjʊleɪtər/","syllables":"de-floc-cu-la-tor"},"inflection":{"noun_plural":"deflocculators"},"usage_notes":{"explanation":"A deflocculator is used to prevent or reverse the clumping together of particles in a liquid suspension. This is important in various industries, including ceramics, paints, and wastewater treatment. The opposite of a deflocculator is a flocculant, which causes particles to clump together.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a flocculator to disperse the particles.","correct":"✓ He used a deflocculator to disperse the particles.","note":"Flocculators cause particles to clump; deflocculators disperse them."}],"priority":"★☆☆"},"related_words":{"derivatives":["deflocculate (verb)","deflocculation (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'deflocculator' refers to a chemical substance that prevents or reverses the aggregation (flocculation) of particles in a suspension. It is used in technical contexts, such as materials science, ceramics, and chemical engineering, where controlling the dispersion of particles is crucial. Understanding the term requires familiarity with concepts like suspensions, colloids, and particle interactions.","priority":"★☆☆"},"example_sentences":[{"sentence":"The addition of a deflocculator reduced the viscosity of the slurry.","translation":"分散剤の添加により、スラリーの粘度が低下した。","type":"noun","meaning_category":"dispersing agent"},{"sentence":"Sodium silicate is commonly used as a deflocculator in clay suspensions.","translation":"ケイ酸ナトリウムは、粘土懸濁液の分散剤として一般的に使用されている。","type":"noun","meaning_category":"dispersing agent"}]}