{"word":"Gilford","priority":"☆☆☆","meanings":[{"part_of_speech":"proper noun","definition":"ギルフォード (英語圏の地名、姓)","english_definition":"A surname and place name, most notably a town in Surrey, England.","examples":[{"sentence":"We visited Gilford last summer.","translation":"私たちは昨年の夏にギルフォードを訪れました。"},{"sentence":"Mr. Gilford is our new teacher.","translation":"ギルフォード先生が私たちの新しい先生です。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The place name Gilford is derived from the Old English 'gylde ford', meaning 'golden ford' or 'ford where golden flowers grow'. The surname likely originated from someone who lived near this place.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡɪlfərd/","syllables":"Gil-ford"},"inflection":{},"usage_notes":{"explanation":"Gilford is primarily used as a surname and a place name. The most well-known location is the town of Gilford in Surrey, England. As a surname, it is relatively uncommon.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_places":["Guildford (alternative spelling of the town in Surrey, England)"],"related_people":[]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'Gilford' is a proper noun, specifically a surname and a place name. It's not a common word, and its usage is generally limited to contexts involving genealogy, geography, or personal names. Understanding its origin and the context in which it's used is key to comprehending its meaning. The alternative spelling 'Guildford' for the town in Surrey is more common."},"example_sentences":[{"sentence":"She traced her family history back to a Gilford who lived in the 18th century.","translation":"彼女は家族の歴史を18世紀に生きていたギルフォードという人物まで遡った。","type":"proper noun","meaning_category":"surname"},{"sentence":"The university town of Gilford is known for its historic buildings.","translation":"大学の街ギルフォードは、その歴史的建造物で知られています。","type":"proper noun","meaning_category":"place name"}]}