{"word":"covenantal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"契約の、契約に基づく","english_definition":"relating to or based on a covenant (a formal agreement or promise).","examples":[{"sentence":"Covenantal theology emphasizes the importance of God's covenants with humanity.","translation":"契約神学は、神と人類との間の契約の重要性を強調する。"},{"sentence":"The church's covenantal relationship with its members is based on mutual trust and commitment.","translation":"教会とそのメンバーとの契約関係は、相互の信頼と献身に基づいている。"}],"collocations":["covenantal theology","covenantal relationship","covenantal community","covenantal ethics"],"synonyms":["contractual","agreed","promised","stipulated"],"antonyms":["unilateral","unconditional","non-contractual"]}],"etymology":{"value":"The word 'covenantal' is derived from 'covenant,' which comes from the Old French word 'covenant,' meaning 'agreement, contract.' This, in turn, comes from the Latin word 'convenire,' meaning 'to come together, agree.' The suffix '-al' is added to form an adjective.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkʌvəˈnentl/","syllables":"cov-e-nan-tal"},"inflection":{"notes":"This is an adjective, so it doesn't have plural forms or verb conjugations. Comparative and superlative forms are possible (more covenantal, most covenantal), but are not commonly used."},"usage_notes":{"explanation":"'Covenantal' is most often used in theological or legal contexts to describe something that is related to or based on a covenant. A covenant is a formal agreement or promise, often between God and humanity in religious contexts, or between parties in legal or political contexts. The term implies a binding agreement with mutual obligations and responsibilities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The covenantal was broken.","correct":"✓ The covenant was broken.","note":"'Covenantal' is an adjective and needs to modify a noun. 'Covenant' is the noun form."},{"incorrect":"✗ They have a covenantal.","correct":"✓ They have a covenant.","note":"Same as above, 'covenantal' is an adjective, not a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["covenant (noun)","covenant (verb)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'covenantal' is a relatively uncommon adjective that is primarily used in theological and legal discussions. It means 'relating to or based on a covenant,' where a covenant is a formal agreement or promise. Understanding this word requires familiarity with the concept of covenants, which are often central to religious and legal frameworks. Because of its specialized usage, it is considered a more advanced vocabulary word."},"example_sentences":[{"sentence":"The Puritan settlers in America sought to establish a covenantal society based on biblical principles.","translation":"アメリカのピューリタン入植者たちは、聖書の原則に基づいた契約社会を確立しようとした。","type":"adjective","meaning_category":"契約に基づく"},{"sentence":"Covenantal nomism is a theological concept that emphasizes obedience to God's law as a response to his grace within the framework of a covenant.","translation":"契約律法主義は、契約の枠組みの中で、神の恵みへの応答として神の律法に従うことを強調する神学的概念である。","type":"adjective","meaning_category":"契約の"}]}