{"word":"GPSI","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"General Practitioner with Special Interest (特定の専門分野に特に関心を持つ一般開業医)","english_definition":"A General Practitioner with Special Interest is a GP who has undertaken additional training and has a special interest in a particular clinical area, enabling them to provide services beyond the usual scope of general practice.","examples":[{"sentence":"The patient was referred to a GPSI in dermatology for further assessment.","translation":"患者はさらなる評価のために皮膚科のGPSIに紹介された。"},{"sentence":"GPSIs play a vital role in bridging the gap between primary and secondary care.","translation":"GPSIは、プライマリケアとセカンダリケアの間のギャップを埋める上で重要な役割を果たしている。"}],"collocations":["GPSI in dermatology (皮膚科のGPSI)","GPSI in cardiology (循環器科のGPSI)","referral to a GPSI (GPSIへの紹介)","GPSI service (GPSIサービス)"],"synonyms":["GP with extended role","GP with special expertise"],"antonyms":[]}],"etymology":{"value":"Acronym of General Practitioner with Special Interest.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdʒiː.piː.esˈaɪ/","syllables":"gee-pee-es-eye"},"inflection":{"notes":"Plural: GPSIs"},"usage_notes":{"explanation":"GPSI (General Practitioner with Special Interest) は、特定の臨床分野 (例: 皮膚科、心臓病学、婦人科など) において追加のトレーニングを受け、特別な関心を持つ一般開業医を指します。通常の一般診療の範囲を超えたサービスを提供することができ、プライマリケアとセカンダリケアの間のギャップを埋める役割を果たします。患者は、特定の症状や状態について、専門医に紹介される前に、まずGPSIに紹介されることがあります。GPSI制度は、専門医への紹介数を減らし、患者がより迅速に適切なケアを受けられるようにすることを目的としています。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a specialist, not a GPSI.","correct":"✓ He is a consultant, not a GPSI.","note":"GPSIは専門医（consultantまたはspecialist）ではありません。専門医に準ずる特別な関心とスキルを持つ一般開業医です。"},{"incorrect":"✗ GPSI is only for emergency cases.","correct":"✓ GPSI can handle a range of conditions within their area of special interest.","note":"GPSIは緊急症例だけでなく、専門分野内の幅広い症状や状態を扱います。"}],"priority":"★★☆"},"related_words":{"derivatives":["general practitioner (GP)","primary care","secondary care","specialist","consultant"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - 医療専門分野の用語であるため、一般的なテキストにはあまり出現しません。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**GPSI**」は、医療分野で使われる専門用語で、一般開業医（GP）が特定の分野（例えば皮膚科や心臓病など）について特別な訓練を受け、より専門的な知識やスキルを持っていることを意味します。これは、患者さんが専門医にかかる前に、まずGPSIに相談することで、適切な治療をより早く受けられるようにするための仕組みです。GPSIは専門医ではありませんが、専門医レベルの知識を持つGPというイメージです。医療関係の記事や論文で目にすることがあります。"},"example_sentences":[{"sentence":"The local NHS trust is promoting the use of GPSIs to improve access to specialist services.","translation":"地元のNHSトラストは、専門サービスへのアクセスを改善するためにGPSIの利用を促進している。","type":"noun","meaning_category":"医療制度"},{"sentence":"A GPSI in diabetes can provide more in-depth advice and management for diabetic patients.","translation":"糖尿病のGPSIは、糖尿病患者に対してより詳細なアドバイスと管理を提供することができる。","type":"noun","meaning_category":"医療専門分野"},{"sentence":"The training program for GPSIs is designed to equip them with advanced clinical skills.","translation":"GPSIのトレーニングプログラムは、高度な臨床スキルを身につけられるように設計されている。","type":"noun","meaning_category":"医療教育"}]}