{"word":"Gesticulator","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"身振り手振りをよくする人","english_definition":"A person who gesticulates, or uses gestures, especially dramatic ones, when speaking.","examples":[{"sentence":"He was a natural gesticulator, his hands flying as he told the story.","translation":"彼は生まれつき身振り手振りが豊かな人で、話をしている間、手が忙しなく動いていた。"},{"sentence":"The professor was a passionate gesticulator, emphasizing every point with a sweep of his arm.","translation":"その教授は情熱的に身振り手振りをする人で、腕を大きく振ってあらゆる点を強調していた。"}],"collocations":["passionate gesticulator","natural gesticulator","enthusiastic gesticulator"],"synonyms":["mime","actor","gesturer"],"antonyms":["stoic","taciturn person"]},{"part_of_speech":"noun","definition":"（ロボット工学）身振り手振りを生成する装置、またはアルゴリズム","english_definition":"(Robotics) A device or algorithm that generates gestures.","examples":[{"sentence":"The robot's gesticulator was programmed to mimic human expressions.","translation":"そのロボットの身振り手振り生成装置は、人間の表情を真似るようにプログラムされていた。"},{"sentence":"Research is being conducted to improve the realism of robotic gesticulators.","translation":"ロボットの身振り手振り生成装置のリアリズムを向上させるための研究が行われている。"}],"collocations":["robotic gesticulator","virtual gesticulator"],"synonyms":["gesture generator"],"antonyms":[]}],"etymology":{"value":"From 'gesticulate' + '-or'. 'Gesticulate' comes from Latin 'gesticulari', meaning 'to make gestures'.","priority":"★★★"},"pronunciation":{"ipa":"/dʒɛˈstɪkjʊˌleɪtər/","syllables":"ges-tic-u-la-tor"},"inflection":{"noun_plural":"gesticulators"},"usage_notes":{"explanation":"The word 'gesticulator' refers to someone who uses a lot of gestures while speaking. It can also refer to a device or algorithm that generates gestures, especially in the field of robotics. The term is not very common in everyday conversation, but it is used in more formal or technical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a good gesticulation.","correct":"✓ He is a good gesticulator.","note":"'Gesticulation' is the act of gesturing, while 'gesticulator' is the person who gestures."}],"priority":"★★☆"},"related_words":{"derivatives":["gesticulate (verb)","gesticulation (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"gesticulator\" is a relatively uncommon word that refers to someone who uses gestures frequently and dramatically, especially while speaking. It is more likely to be encountered in formal writing or specialized contexts, such as discussions about communication styles or robotics. The word is formed by adding the suffix \"-or\" to the verb \"gesticulate,\" which means to use gestures. Understanding the meaning of \"gesticulate\" can help in deciphering the meaning of \"gesticulator.\""},"example_sentences":[{"sentence":"The Italian politician was a flamboyant gesticulator, captivating the audience with his expressive movements.","translation":"そのイタリア人政治家は派手な身振り手振りの使い手で、表現力豊かな動きで聴衆を魅了した。","type":"noun","meaning_category":"Person who gestures"},{"sentence":"Engineers are developing a sophisticated gesticulator for humanoid robots to improve their nonverbal communication skills.","translation":"エンジニアたちは、ヒューマノイドロボットの非言語コミュニケーションスキルを向上させるために、高度な身振り手振り生成装置を開発している。","type":"noun","meaning_category":"Robotics device"}]}