{"word":"pluckage","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に家禽の)羽毛をむしること、羽毛","english_definition":"The act of plucking feathers from a bird; feathers that have been plucked.","examples":[{"sentence":"The pluckage of chickens is a messy job.","translation":"鶏の羽毛をむしる作業は汚れる。"},{"sentence":"The farmer collected the pluckage for use in stuffing pillows.","translation":"農家は羽毛をむしったものを集めて枕の詰め物にした。"}],"collocations":["chicken pluckage","duck pluckage"],"synonyms":["plucking","feathers","down"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'pluck' (to pull something quickly in order to remove it) and the suffix '-age' (denoting an action, process, or result).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈplʌkɪdʒ/","syllables":"pluck-age"},"inflection":{"noun_plural":"pluckages"},"usage_notes":{"explanation":"'Pluckage' is a relatively uncommon noun, primarily used in agricultural or culinary contexts when discussing the removal of feathers from poultry or the collected feathers themselves.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pluckage was very pain for the bird.","correct":"✓ The plucking was very painful for the bird.","note":"'Pluckage' refers to the feathers or the act, not the feeling. Use 'plucking' to describe the action that causes pain."}],"priority":"★☆☆"},"related_words":{"derivatives":["pluck (verb)","plucked (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pluckage' is a niche term referring to the act of removing feathers from poultry or the feathers themselves. It's not commonly used in everyday conversation and is more likely to appear in specific contexts related to farming, cooking, or historical practices. Understanding its meaning requires a relatively advanced vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The factory specialized in the automated pluckage of turkeys.","translation":"その工場は七面鳥の羽毛を自動でむしることに特化していた。","type":"noun","meaning_category":"羽毛をむしること"},{"sentence":"The collected duck pluckage was sold to a bedding company.","translation":"集められたカモの羽毛は寝具会社に売られた。","type":"noun","meaning_category":"羽毛"}]}