{"word":"oligosaccharide","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"オリゴ糖","english_definition":"A carbohydrate whose molecules are composed of a relatively small number of monosaccharide units linked together (typically 3-10).","examples":[{"sentence":"Oligosaccharides are often found in beans, vegetables, and fruits.","translation":"オリゴ糖は豆類、野菜、果物によく含まれています。"},{"sentence":"Some oligosaccharides are used as prebiotics to promote gut health.","translation":"オリゴ糖の中には、腸の健康を促進するプレバイオティクスとして使用されるものもあります。"}],"collocations":["prebiotic oligosaccharide (プレバイオティクスオリゴ糖)","dietary oligosaccharide (食物オリゴ糖)","galacto-oligosaccharide (ガラクトオリゴ糖)","fructo-oligosaccharide (フラクトオリゴ糖)"],"synonyms":["complex carbohydrate"],"antonyms":["monosaccharide","polysaccharide"]}],"etymology":{"value":"The word 'oligosaccharide' comes from the Greek words 'oligos' meaning 'few' or 'small' and 'saccharide' meaning 'sugar'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɒlɪɡoʊˈsækəraɪd/","syllables":"ol-i-go-sac-cha-ride"},"inflection":{"noun_plural":"oligosaccharides"},"usage_notes":{"explanation":"Oligosaccharides are carbohydrates composed of a few (typically 3-10) monosaccharides (simple sugars) linked together. They are intermediate in size between monosaccharides (like glucose and fructose) and polysaccharides (like starch and cellulose). Some oligosaccharides are digestible, while others are not and function as dietary fiber or prebiotics, promoting the growth of beneficial bacteria in the gut. Common examples include fructo-oligosaccharides (FOS) and galacto-oligosaccharides (GOS).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Oligosaccharides are simple sugars.","correct":"✓ Oligosaccharides are complex carbohydrates made of a few simple sugars.","note":"Oligosaccharides are not simple sugars (monosaccharides), but are composed of a few simple sugars linked together."}],"priority":"★★☆"},"related_words":{"derivatives":["oligo- (prefix meaning 'few' or 'small')","saccharide (related to sugars and carbohydrates)"],"related_terms":["monosaccharide","disaccharide","polysaccharide","carbohydrate","prebiotic","fiber"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency - Primarily used in scientific or nutritional contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Oligosaccharide' is a scientific term referring to a type of carbohydrate that is more complex than simple sugars (monosaccharides) but less complex than large polysaccharides like starch. It's often discussed in the context of nutrition and gut health, as some oligosaccharides act as prebiotics, feeding beneficial bacteria in the digestive system. Understanding this term requires some background knowledge of biochemistry and nutrition.","priority":"★★★"},"example_sentences":[{"sentence":"The formula milk is supplemented with galacto-oligosaccharides to support the infant's gut microbiome.","translation":"その粉ミルクには、乳児の腸内マイクロバイオームをサポートするためにガラクトオリゴ糖が添加されています。","type":"general","meaning_category":"definition"},{"sentence":"Research suggests that certain oligosaccharides can improve calcium absorption.","translation":"研究によると、特定のオリゴ糖はカルシウムの吸収を改善する可能性があることが示唆されています。","type":"scientific","meaning_category":"health benefits"},{"sentence":"The sweetness of oligosaccharides is generally lower than that of sucrose.","translation":"オリゴ糖の甘味は、一般的にスクロースよりも低い。","type":"scientific","meaning_category":"properties"}]}