{"word":"marmink","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Zoology) A type of mink, specifically the European mink (Mustela lutreola).","english_definition":"A now rare or extinct European mink (Mustela lutreola).","examples":[{"sentence":"The marmink used to be common in Europe.","translation":"かつて、マーミンクはヨーロッパで一般的でした。"},{"sentence":"Conservation efforts are being made to protect the marmink.","translation":"マーミンクを保護するための保全活動が行われています。"}],"collocations":["European marmink","protect the marmink","marmink habitat"],"synonyms":["European mink","Mustela lutreola"],"antonyms":[]}],"etymology":{"value":"Likely a regional or dialectal term for the European mink, possibly of Germanic origin. The exact etymology is not widely documented.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈmɑːrmɪŋk/","syllables":"mar-mink"},"inflection":{"noun_plural":"marminks"},"usage_notes":{"explanation":"The term 'marmink' is not as commonly used as 'European mink' or its scientific name, 'Mustela lutreola.' It may be more prevalent in specific regions where the animal was historically found.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a marmink in North America.","correct":"✓ I saw an American mink in North America.","note":"Marminks (European mink) are native to Europe, not North America. American mink are a different species."}],"priority":"★☆☆"},"related_words":{"derivatives":["mink"],"related_terms":["Mustela (genus)","Mustela lutreola (scientific name)"]},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Marmink' is a relatively uncommon term for the European mink, *Mustela lutreola*. It is primarily used in zoological or conservation contexts when specifically referring to this species, distinguishing it from other mink species such as the American mink. Due to its specialized usage, it is not part of general vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The **marmink** population has drastically declined due to habitat loss and competition with the American mink.","translation":"マーミンクの個体数は、生息地の喪失とアメリカミンクとの競争により激減しました。","type":"noun","meaning_category":"Zoology"}]}