{"word":"superselection","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(物理学)超選択: 量子力学において、ある物理系のヒルベルト空間が、互いにコヒーレントな重ね合わせ状態にない部分空間に分割される現象。これらの部分空間間の物理量の重ね合わせは、選択規則によって禁止される。","english_definition":"(physics) A phenomenon in quantum mechanics where the Hilbert space of a physical system is divided into subspaces that are not coherently superposed with each other. Superpositions of physical quantities between these subspaces are forbidden by selection rules.","examples":[{"sentence":"The superselection rule forbids the superposition of states with different electric charges.","translation":"超選択則は、異なる電荷を持つ状態の重ね合わせを禁止する。"},{"sentence":"Superselection sectors can arise from various conserved quantities, such as baryon number or electric charge.","translation":"超選択セクターは、バリオン数や電荷のような様々な保存量から生じることがある。"}],"collocations":["superselection rule (超選択則)","superselection sector (超選択セクター)","conserved quantity (保存量)","Hilbert space (ヒルベルト空間)","coherent superposition (コヒーレントな重ね合わせ)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'super-' (超) + 'selection' (選択) からなる造語。量子力学における特定の選択規則が、通常の選択規則よりも強い制約を課すことから。","priority":"★★★"},"pronunciation":{"ipa":"/ˌsuːpər.sɪˈlek.ʃən/","syllables":"su-per-se-lec-tion"},"inflection":{"noun_plural":"superselections"},"usage_notes":{"explanation":"超選択は、量子力学の基本的な概念の一つであり、特定の物理量（電荷、バリオン数など）が明確に定義された状態の重ね合わせが存在しないことを意味します。これは、古典的な物理学との大きな違いを示す現象です。超選択則は、このような重ね合わせを禁止する規則であり、超選択セクターは、超選択則によって分離されたヒルベルト空間の部分空間を指します。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Superselection allows superposition of states with different charges.","correct":"✓ Superselection forbids superposition of states with different charges.","note":"超選択は、異なる電荷を持つ状態の重ね合わせを許可するのではなく、禁止します。"},{"incorrect":"✗ Superselection sectors are coherently superposed.","correct":"✓ Superselection sectors are not coherently superposed.","note":"超選択セクターは、互いにコヒーレントな重ね合わせ状態にありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["superselection rule","superselection sector"],"related_concepts":["quantum mechanics","Hilbert space","selection rule","coherent state","decoherence"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な物理学の文脈)","frequency_google_ngram":"低頻度 (Low frequency) - 物理学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**superselection**」は、量子力学における専門用語で、ある物理系の状態空間が、互いに重ね合わせることができない部分空間に分割される現象を指します。この現象は、特定の物理量（例えば、電荷）が明確に定義された状態の間での重ね合わせが、物理的に許されない場合に生じます。超選択則は、このような重ね合わせを禁止する規則であり、超選択セクターは、これらの分離された部分空間を指します。この概念を理解するには、量子力学の基本的な知識（ヒルベルト空間、重ね合わせ、選択規則など）が必要です。"},"example_sentences":[{"sentence":"The existence of superselection rules implies that certain quantum states cannot be prepared in the laboratory.","translation":"超選択則の存在は、特定の量子状態が実験室で準備できないことを意味する。","type":"noun","meaning_category":"超選択"},{"sentence":"Superselection is a fundamental concept in the interpretation of quantum measurement.","translation":"超選択は、量子測定の解釈における基本的な概念である。","type":"noun","meaning_category":"超選択"},{"sentence":"The superselection rule for electric charge prevents the observation of interference between states with different charges.","translation":"電荷に関する超選択則は、異なる電荷を持つ状態間の干渉の観測を妨げる。","type":"noun","meaning_category":"超選択"}]}