{"word":"recapitulations","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"要約、概括、反復","english_definition":"the act of summarizing and restating the main points of something; a summary or concise review.","examples":[{"sentence":"The professor provided recapitulations at the end of each lecture.","translation":"教授は各講義の終わりに要約を提供した。"},{"sentence":"These recapitulations of the previous arguments are necessary for clarity.","translation":"以前の議論のこれらの要約は、明確さのために必要である。"},{"sentence":"His speech was filled with recapitulations of well-known facts.","translation":"彼のスピーチは、よく知られた事実の反復で満たされていた。"}],"collocations":["provide recapitulations","offer recapitulations","brief recapitulations","detailed recapitulations"],"synonyms":["summary","review","recap","resume","abstract","overview"],"antonyms":["elaboration","expansion","detailed explanation"]},{"part_of_speech":"noun","definition":"(生物学)反復説、個体発生反復説","english_definition":"(in biology) the repetition of ancestral stages in the development of an individual organism; the theory that ontogeny recapitulates phylogeny.","examples":[{"sentence":"The theory of recapitulations has been largely discredited in its original form.","translation":"反復説は、その元の形ではほとんど信用を失っている。"},{"sentence":"Early embryonic development shows some recapitulations of evolutionary history.","translation":"初期の胚発生は、進化の歴史のいくつかの反復を示している。"},{"sentence":"Recapitulations in development can provide insights into evolutionary relationships.","translation":"発生における反復は、進化的関係への洞察を提供することができる。"}],"collocations":["theory of recapitulations","developmental recapitulations","evolutionary recapitulations","ontogenetic recapitulations"],"synonyms":["ontogeny recapitulates phylogeny"],"antonyms":[]}],"etymology":{"value":"From the Latin word 'recapitulatio', meaning 'a summing up, a brief repetition', from 're-' (again) + 'capitulare' (to draw up under heads or chapters), from 'capitulum' (chapter, heading), diminutive of 'caput' (head).","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˌkæpɪtjuˈleɪʃənz/","syllables":"re-ca-pit-u-la-tions"},"inflection":{"noun_plural":"recapitulations"},"usage_notes":{"explanation":"'Recapitulations' refers to multiple instances of summarizing or restating key points. In a biological context, it refers to instances of the repetition of ancestral stages during development. The term is relatively formal.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The recapitulation was helpful to understand the story.","correct":"✓ The recapitulation was helpful in understanding the story.","note":"Use 'in' before the gerund form of the verb to indicate the purpose or result of the recapitulation."},{"incorrect":"✗ He made many recapitulation of the main points.","correct":"✓ He made many recapitulations of the main points.","note":"'Recapitulation' is a countable noun, so use the plural form 'recapitulations' when referring to multiple instances."}],"priority":"★★☆"},"related_words":{"derivatives":["recapitulate (verb)","recapitulative (adjective)","recapitulator (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'recapitulations' is a formal term that refers to summaries or restatements of key points, or to the biological concept of repeating ancestral stages during development. It is most often used in academic or technical contexts. Understanding the word requires a strong vocabulary and familiarity with abstract concepts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The final chapter provides recapitulations of the main themes discussed throughout the book.","translation":"最終章では、本全体を通して議論された主なテーマの要約が提供されている。","type":"noun","meaning_category":"summary"},{"sentence":"These recapitulations help students to remember the key concepts.","translation":"これらの要約は、学生が主要な概念を覚えるのに役立つ。","type":"noun","meaning_category":"summary"},{"sentence":"Some scientists argue that there are still some recapitulations of evolutionary history in human development.","translation":"一部の科学者は、人間の発達には依然として進化の歴史のいくつかの反復があると考えている。","type":"noun","meaning_category":"biology"}]}