{"word":"Proto-Teutonic","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ゲルマン祖語、原始ゲルマン語","english_definition":"The reconstructed common ancestor of the Germanic languages.","examples":[{"sentence":"Proto-Teutonic is not directly attested in any written sources.","translation":"ゲルマン祖語は、書かれた資料では直接的に証明されていません。"},{"sentence":"Linguistic reconstruction allows us to infer features of Proto-Teutonic.","translation":"言語再構築によって、ゲルマン祖語の特徴を推測することができます。"}],"collocations":["Proto-Germanic","Germanic proto-language","reconstructed language"],"synonyms":["Proto-Germanic"],"antonyms":[]}],"etymology":{"value":"Composed of \"proto-\" (prefix meaning 'original' or 'earliest form of') and \"Teutonic\" (an archaic term for Germanic).","priority":"★★★"},"pronunciation":{"ipa":"/ˌproʊtoʊ tuːˈtɒnɪk/","syllables":"Pro-to-Teu-ton-ic"},"inflection":{"noun_plural":"None"},"usage_notes":{"explanation":"\"Proto-Teutonic\" is largely synonymous with \"Proto-Germanic.\" It refers to the hypothetical ancestor language from which all Germanic languages (such as English, German, Dutch, Swedish, etc.) are derived. Because it is a reconstructed language, no texts written in Proto-Teutonic exist. Linguists use the comparative method to reconstruct it by comparing features of the daughter languages.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Proto-Teutonic is the same as Old English.","correct":"✓ Proto-Teutonic is an ancestor of Old English.","note":"Proto-Teutonic is an earlier stage of the language family, not the same as any specific later language."}],"priority":"★★☆"},"related_words":{"derivatives":["Germanic","Proto-Indo-European","Old English","Gothic","Proto-Norse"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized linguistic vocabulary)","frequency_google_ngram":"Low frequency (専門的な言語学の用語)","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term \"Proto-Teutonic\" refers to the reconstructed ancestor language of the Germanic languages. It's a concept used in historical linguistics and is not commonly encountered outside of academic contexts. Understanding it requires familiarity with language families and the comparative method of linguistic reconstruction."},"example_sentences":[{"sentence":"The Great Vowel Shift is a sound change that occurred after the Proto-Teutonic period.","translation":"大母音推移は、ゲルマン祖語の時代以降に起こった音韻変化です。","type":"noun","meaning_category":"language history"},{"sentence":"Some linguists debate the precise features of Proto-Teutonic phonology.","translation":"一部の言語学者は、ゲルマン祖語の音韻論の正確な特徴について議論しています。","type":"noun","meaning_category":"linguistics"}]}