{"word":"homoracial","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"同じ人種内の、同人種間の","english_definition":"Relating to or involving people of the same race.","examples":[{"sentence":"Homoracial friendships are common in many communities.","translation":"同人種間の友情は多くのコミュニティで一般的です。"},{"sentence":"The study focused on homoracial relationships within the African American community.","translation":"その研究は、アフリカ系アメリカ人コミュニティ内の同人種間の関係に焦点を当てました。"},{"sentence":"There is a need for more research on homoracial dynamics in the workplace.","translation":"職場における同人種間の力学について、より多くの研究が必要とされています。"}],"collocations":["homoracial friendship","homoracial relationship","homoracial group","homoracial community","homoracial interaction"],"synonyms":["intra-racial"],"antonyms":["interracial","multiracial"]},{"part_of_speech":"adjective","definition":"（特に、養子縁組について）養親と養子が同じ人種であること","english_definition":"(Especially of adoption) having adoptive parents and child of the same race.","examples":[{"sentence":"The agency prioritizes homoracial adoptions whenever possible.","translation":"その機関は、可能な限り同人種間の養子縁組を優先しています。"},{"sentence":"There is debate about the benefits and drawbacks of homoracial versus transracial adoption.","translation":"同人種間の養子縁組と異人種間の養子縁組の利点と欠点については議論があります。"},{"sentence":"Homoracial adoption ensures the child shares a cultural background with their family.","translation":"同人種間の養子縁組は、子供が家族と文化的背景を共有することを保証します。"}],"collocations":["homoracial adoption","homoracial placement"],"synonyms":[],"antonyms":["transracial"]}],"etymology":{"value":"Derived from the combination of 'homo-' (meaning 'same') and 'racial' (relating to race).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhoʊmoʊˈreɪʃəl/","syllables":"ho-mo-ra-cial"},"inflection":{"notes":"Adjective, no specific inflectional forms."},"usage_notes":{"explanation":"The term 'homoracial' is used to describe situations, relationships, or groups composed of individuals of the same race. It is often used in contrast to 'interracial' or 'multiracial' to highlight similarities or differences in experiences and dynamics. In the context of adoption, it refers to the practice of placing children with adoptive parents of the same race, which is sometimes prioritized to maintain cultural continuity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The homoracial group consisted of people from different ethnicities.","correct":"✓ The homoracial group consisted of people from the same ethnicity.","note":"'Homoracial' refers to the same race, while 'ethnicity' refers to cultural heritage. While often related, they are not interchangeable. If referring to different cultural backgrounds within the same race, use 'ethnicities' instead of 'races'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Homoracial' is a term used to describe something that involves only people of the same race. It's often used in discussions about race, ethnicity, and adoption. For example, a 'homoracial friendship' means a friendship between people of the same race. The word helps to specify that the situation or relationship being discussed involves people who share a racial background, as opposed to people from different races."},"example_sentences":[{"sentence":"The study examined the effects of homoracial schooling on academic achievement.","translation":"その研究は、同人種間の学校教育が学業成績に与える影響を調査しました。","type":"adjective","meaning_category":"General"},{"sentence":"The debate over homoracial adoption continues to be a complex and sensitive issue.","translation":"同人種間の養子縁組に関する議論は、依然として複雑でデリケートな問題です。","type":"adjective","meaning_category":"Adoption"},{"sentence":"Homoracial neighborhoods can foster a strong sense of community and belonging.","translation":"同人種間の近隣地域は、強いコミュニティ意識と帰属意識を育むことができます。","type":"adjective","meaning_category":"Community"}]}