{"word":"estoque","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(闘牛で使う)剣、刺剣","english_definition":"A type of sword used in bullfighting, specifically the sword used to deliver the final blow.","examples":[{"sentence":"El estoque es una herramienta esencial en la tauromaquia.","translation":"The estoque is an essential tool in bullfighting."}],"collocations":["usar el estoque (to use the estoque)","manejar el estoque (to handle the estoque)","clavar el estoque (to thrust the estoque)"],"synonyms":["espada (sword)","daga (dagger)"],"antonyms":[]}],"etymology":{"value":"From Spanish estoque, from estocar (to thrust), of Germanic origin.","priority":"★★☆"},"pronunciation":{"ipa":"/esˈtoke/","syllables":"es-to-que"},"inflection":{"noun_plural":"estoques"},"usage_notes":{"explanation":"The word 'estoque' is primarily associated with the Spanish tradition of bullfighting. It refers specifically to the sword used by the matador to deliver the final, fatal blow to the bull. Outside of this context, the word is rarely used.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"El torero usó la espada.","correct":"El torero usó el estoque.","note":"While 'espada' means sword, 'estoque' refers specifically to the bullfighting sword."}],"priority":"★★☆"},"related_words":{"derivatives":["estocada (a thrust with the estoque)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'estoque' is a specialized term primarily used in the context of bullfighting. Understanding its meaning requires familiarity with this cultural tradition. It is not commonly used in everyday conversation or writing outside of this specific domain."},"example_sentences":[{"sentence":"El matador recibió el estoque del mozo de espadas.","translation":"The matador received the estoque from the sword-handler.","type":"noun","meaning_category":"bullfighting sword"},{"sentence":"La hoja del estoque debe ser afilada para asegurar una muerte rápida.","translation":"The blade of the estoque must be sharp to ensure a quick death.","type":"noun","meaning_category":"bullfighting sword"}]}