{"word":"manually-created","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"手作業で作成された、手動で生成された","english_definition":"Created or produced by hand, rather than by automated means or machinery.","examples":[{"sentence":"This report is manually-created, so it may contain some errors.","translation":"このレポートは手作業で作成されているため、いくつかのエラーが含まれている可能性があります。"},{"sentence":"The database entries were manually-created and verified.","translation":"データベースのエントリは手作業で作成され、検証されました。"},{"sentence":"A manually-created backup is recommended before making major system changes.","translation":"大規模なシステム変更を行う前に、手作業で作成されたバックアップを作成することをお勧めします。"}],"collocations":["manually-created report","manually-created backup","manually-created database","manually-created content","manually-created process","manually-created list"],"synonyms":["handcrafted","hand-built","hand-made","non-automated","human-generated"],"antonyms":["automatically-generated","machine-made","computer-generated","automated"]}],"etymology":{"value":"The word is formed by combining \"manually\" (meaning 'by hand') and \"created\" (meaning 'brought into existence').","priority":"N/A"},"pronunciation":{"ipa":"/ˌmænjuəli kriˈeɪtɪd/","syllables":"man-u-al-ly cre-a-ted"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"\"Manually-created\" emphasizes that something was made or produced by human effort, without the assistance of machines or automated systems. It often implies a higher degree of attention to detail or a lack of scalability compared to automated processes.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The manually created.","correct":"✓ The document was manually created.","note":"\"Manually-created\" is an adjective and requires a noun to modify or a verb to link it to a subject."},{"incorrect":"✗ Manually created is better than automatic.","correct":"✓ Manually-created content is often better than automatically-generated content.","note":"When comparing, specify what is manually-created versus automatically-generated."}],"priority":"N/A"},"related_words":{"derivatives":["manually","create","creation"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"B2","text":"The term \"manually-created\" is relatively straightforward, indicating that something was produced by hand rather than by automated means. It is commonly used in technical or professional contexts to distinguish between human-generated and machine-generated content or processes. Understanding this term requires a general familiarity with the concept of automation."},"example_sentences":[{"sentence":"The artist spent weeks creating the manually-created mosaic.","translation":"アーティストは何週間もかけて手作業でモザイクを作成しました。","type":"adjective","meaning_category":"handcrafted"},{"sentence":"The company relies on manually-created spreadsheets for financial analysis.","translation":"その会社は、財務分析のために手作業で作成されたスプレッドシートに依存しています。","type":"adjective","meaning_category":"non-automated"},{"sentence":"Manually-created maps often offer a level of detail not found in digital versions.","translation":"手作業で作成された地図は、デジタル版にはないレベルの詳細を提供することがよくあります。","type":"adjective","meaning_category":"human-generated"}]}