{"word":"chorioiditis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"脈絡膜炎","english_definition":"Inflammation of the choroid, the vascular layer of the eye.","examples":[{"sentence":"Choroiditis can lead to vision loss if left untreated.","translation":"脈絡膜炎は、治療せずに放置すると視力低下につながる可能性があります。"},{"sentence":"The doctor diagnosed the patient with choroiditis after examining their eye.","translation":"医師は患者の目を診察した後、脈絡膜炎と診断しました。"}],"collocations":["acute choroiditis","chronic choroiditis","multifocal choroiditis","posterior choroiditis"],"synonyms":["uveitis (related, as choroiditis is often a form of uveitis)"],"antonyms":[]}],"etymology":{"value":"From 'choroid' (脈絡膜) + '-itis' (inflammation, 炎症).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkɔːrɔɪˈdaɪtɪs/","syllables":"cho-roi-di-tis"},"inflection":{"noun_plural":"chorioiditides (rarely used)"},"usage_notes":{"explanation":"Choroiditis is typically diagnosed by an ophthalmologist through a comprehensive eye exam. It is often associated with other inflammatory conditions of the eye, such as uveitis.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Choroiditis is a bacterial infection.","correct":"✓ Choroiditis is an inflammatory condition.","note":"Choroiditis is primarily an inflammatory condition, although infections can sometimes be a cause."}],"priority":"★★☆"},"related_words":{"derivatives":["choroid (脈絡膜)","retinochoroiditis (網脈絡膜炎, inflammation of both the retina and choroid)","uveitis (ぶどう膜炎, inflammation of the uvea, which includes the choroid)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Choroiditis' is a medical term referring to the inflammation of the choroid, a layer in the eye. It's a specialized term primarily encountered in medical or ophthalmological contexts. Understanding requires familiarity with basic anatomy and medical terminology related to inflammation."},"example_sentences":[{"sentence":"The patient presented with symptoms indicative of choroiditis, including blurred vision and eye pain.","translation":"患者は、視力のかすみや眼痛など、脈絡膜炎を示唆する症状を呈して来院しました。","type":"medical context","meaning_category":"symptoms"},{"sentence":"Treatment for choroiditis typically involves corticosteroids to reduce inflammation.","translation":"脈絡膜炎の治療は通常、炎症を軽減するためにコルチコステロイドを使用します。","type":"medical context","meaning_category":"treatment"}]}