{"word":"vespid","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"スズメバチ科のハチ","english_definition":"A wasp of the family Vespidae, which includes hornets, yellowjackets, and paper wasps.","examples":[{"sentence":"The vespid stung me when I got too close to its nest.","translation":"巣に近づきすぎたとき、スズメバチ科のハチに刺された。"},{"sentence":"Vespid wasps are known for their painful stings.","translation":"スズメバチ科のハチは、痛みを伴う刺し傷で知られています。"}],"collocations":["vespid wasp","vespid nest","vespid sting"],"synonyms":["wasp","hornet","yellowjacket","paper wasp"],"antonyms":[]},{"part_of_speech":"adjective","definition":"スズメバチ科の、スズメバチのような","english_definition":"Relating to or resembling wasps of the family Vespidae.","examples":[{"sentence":"The vespid nest was carefully constructed from chewed wood pulp.","translation":"スズメバチ科のハチの巣は、噛み砕かれた木材パルプから慎重に作られていた。"},{"sentence":"Vespid behavior is often aggressive, especially when defending their nests.","translation":"スズメバチ科のハチの行動は、特に巣を守るときに攻撃的であることが多い。"}],"collocations":["vespid nest","vespid behavior","vespid colony"],"synonyms":["waspish","hornet-like"],"antonyms":[]}],"etymology":{"value":"From the New Latin Vespidae, the family name, derived from Latin vespa (“wasp”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvɛspɪd/","syllables":"ves-pid"},"inflection":{"noun_plural":"vespids"},"usage_notes":{"explanation":"'Vespid' is a relatively technical term used in entomology (the study of insects) to refer specifically to wasps belonging to the family Vespidae. While 'wasp' is a more general term, 'vespid' is more precise. It's not a word commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a vespid in my garden, it was so cute!","correct":"✓ I saw a wasp in my garden.","note":"'Vespid' is not typically used in casual conversation. 'Wasp' is more common."}],"priority":"★☆☆"},"related_words":{"derivatives":["Vespidae (family name)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Technical term, not in CEFR vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Vespid' is a scientific term primarily used in the context of entomology or related fields. It refers specifically to wasps belonging to the family Vespidae, which includes hornets, yellowjackets, and paper wasps. Due to its technical nature, it's not commonly encountered in general English usage. Understanding its meaning requires a familiarity with scientific classification and entomological terminology."},"example_sentences":[{"sentence":"The entomologist studied the vespid specimens under a microscope.","translation":"昆虫学者は顕微鏡でスズメバチ科のハチの標本を研究した。","type":"noun","meaning_category":"スズメバチ科のハチ"},{"sentence":"Vespid wasps exhibit complex social behaviors within their colonies.","translation":"スズメバチ科のハチは、コロニー内で複雑な社会行動を示す。","type":"adjective","meaning_category":"スズメバチ科の"}]}