{"word":"automobile-less","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"自動車を持たない、自動車のない","english_definition":"Without an automobile; not possessing or requiring an automobile.","examples":[{"sentence":"The city is trying to become more automobile-less by improving public transportation.","translation":"その都市は公共交通機関を改善することで、より自動車のない都市になろうとしている。"},{"sentence":"Living in a walkable neighborhood makes it easier to be automobile-less.","translation":"歩きやすい近所に住むことは、自動車を持たない生活をより容易にする。"}],"collocations":["automobile-less lifestyle","automobile-less city","automobile-less transportation"],"synonyms":["car-free","vehicle-free"],"antonyms":["automobile-dependent","car-dependent"],"related_words":["pedestrian","cyclist","public transportation","sustainable transportation"]}],"etymology":{"value":"Formed by combining \"automobile\" with the suffix \"-less,\" indicating the absence of automobiles.","priority":"N/A"},"pronunciation":{"ipa":"/ˌɔːtəməˈbiːl ləs/","syllables":"au-to-mo-bile-less"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term \"automobile-less\" describes a state or condition where automobiles are not present or not needed. It often refers to urban planning or lifestyle choices that prioritize alternatives to car ownership and usage, such as walking, cycling, and public transportation.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The automobile-less are encouraged to use public transport.","correct":"✓ Automobile-less residents are encouraged to use public transport.","note":"\"Automobile-less\" functions as an adjective, so it needs to modify a noun (e.g., residents, areas, lifestyles). It cannot stand alone as a noun."}],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. The term is relatively modern and specific.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term \"automobile-less\" is a compound adjective that means \"without an automobile.\" It is used to describe situations, lifestyles, or areas where cars are absent or unnecessary. This term is often used in discussions about urban planning, sustainable living, and transportation alternatives. Understanding the term requires a good vocabulary and an understanding of related concepts like car-free living and public transportation.","priority":"N/A"},"example_sentences":[{"sentence":"Many European cities are promoting automobile-less zones in their city centers.","translation":"多くのヨーロッパの都市が、市の中心部に自動車のない区域を推進している。","type":"adjective","meaning_category":"自動車のない"},{"sentence":"An automobile-less lifestyle can be more sustainable and environmentally friendly.","translation":"自動車のない生活は、より持続可能で環境に優しいものになり得る。","type":"adjective","meaning_category":"自動車を持たない"}]}