{"word":"long-kept","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"長年守られてきた、長年秘密にされてきた","english_definition":"kept secret or maintained for a long time.","examples":[{"sentence":"a long-kept secret","translation":"長年守られてきた秘密"},{"sentence":"a long-kept tradition","translation":"長年受け継がれてきた伝統"},{"sentence":"The long-kept promise was finally fulfilled.","translation":"長年守られてきた約束がついに果たされた。"}],"collocations":["long-kept secret","long-kept tradition","long-kept promise"],"synonyms":["age-old","time-honored","well-guarded","long-standing"],"antonyms":["newly revealed","recently disclosed","short-lived"]}],"etymology":{"value":"\"long\" + \"kept\". \"Long\" refers to a great duration of time. \"Kept\" is the past participle of \"keep\", meaning to maintain possession of, or to preserve. Thus, \"long-kept\" describes something that has been maintained or preserved for a long time.","priority":"★★★"},"pronunciation":{"ipa":"/ˈlɔŋˌkɛpt/","syllables":"long-kept"},"inflection":{"notes":"Adjective, no inflection"},"usage_notes":{"explanation":"\"Long-kept\" is typically used to describe secrets, traditions, promises, or other things that have been maintained or preserved over a significant period. It often implies a sense of importance or value attached to the thing being kept. It's a relatively formal term and not as commonly used in everyday conversation as simpler alternatives like \"old\" or \"secret\".","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ a long kept secret","correct":"✓ a long-kept secret","note":"The hyphen is important to show that 'long' and 'kept' are working together to modify 'secret' as a single adjective. Without the hyphen, it might be interpreted as a secret that is kept for a long time, but not necessarily continuously."}],"priority":"★★☆"},"related_words":{"derivatives":["long","keep","kept"],"phrasal_verbs":[],"related_adjectives":["long-standing","well-preserved","time-honored"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The adjective \"long-kept\" is a relatively sophisticated term, indicating something that has been maintained or concealed for an extended period. It's often used in formal writing or speech to add emphasis to the duration and significance of the thing being described. Understanding this word requires a good grasp of compound adjectives and their function in modifying nouns. It's not commonly encountered in everyday language, making it more suitable for advanced learners. "},"example_sentences":[{"sentence":"The treasure map revealed a long-kept secret about the island's history.","translation":"その宝の地図は、その島の歴史に関する長年秘密にされてきたことを明らかにした。","type":"adjective","meaning_category":"長年秘密にされてきた"},{"sentence":"The family celebrated a long-kept tradition during the holidays.","translation":"その家族は休暇中に長年守られてきた伝統を祝った。","type":"adjective","meaning_category":"長年守られてきた"},{"sentence":"The long-kept promise between the two friends was finally fulfilled after many years.","translation":"その二人の友人の間の長年守られてきた約束は、何年も経ってついに果たされた。","type":"adjective","meaning_category":"長年守られてきた"}]}