{"word":"Unidleness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state of not being idle; diligence; activity.","english_definition":"The quality or state of being diligent or active; the opposite of idleness.","examples":[{"sentence":"Her unidleness in completing the project ahead of schedule was commendable.","translation":"彼女が予定より早くプロジェクトを完了させた勤勉さは称賛に値する。"},{"sentence":"Unidleness is a virtue that leads to success.","translation":"勤勉さは成功につながる美徳である。"}],"collocations":["promote unidleness","reward unidleness","encourage unidleness"],"synonyms":["diligence","activity","industriousness","assiduity","zeal","application"],"antonyms":["idleness","laziness","sloth","inactivity"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to 'idleness' (the state of being idle).","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈaɪdəlnəs/","syllables":"un-i-dle-ness"},"inflection":{"noun_plural":"unidlenesses (rarely used)"},"usage_notes":{"explanation":"'Unidleness' is a somewhat uncommon and formal word. It is used to emphasize the active and diligent nature of someone or something, particularly in contrast to a state of inactivity or laziness. While grammatically correct, words like 'diligence', 'industriousness', or 'activity' are more frequently used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed unidleness by sleeping all day.","correct":"✓ He showed idleness by sleeping all day.","note":"'Unidleness' means the opposite of idleness, so it cannot be used to describe someone who is sleeping all day."},{"incorrect":"✗ The unidleness of the machine was impressive.","correct":"✓ The efficiency of the machine was impressive. / ✓ The machine's continuous operation was impressive.","note":"For machines, 'efficiency' or 'continuous operation' are more appropriate terms than 'unidleness', which is typically used for people."}],"priority":"★★☆"},"related_words":{"derivatives":["unidle (adjective, rare): not idle"],"related_terms":["diligence","industriousness","activity","assiduity","zeal","application"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (very rare, mostly in formal or academic contexts)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unidleness' is a relatively rare and formal word that means the opposite of idleness, referring to a state of being active, diligent, and industrious. It is formed by adding the prefix 'un-' to 'idleness.' Due to its rarity, it is more common to use synonyms such as 'diligence', 'industriousness', or 'activity' in most contexts. This word is more likely to be encountered in formal writing or academic discussions where precise and sometimes less common vocabulary is preferred. When using 'unidleness', ensure the context clearly benefits from its specific emphasis on the absence of idleness, as opposed to simply stating the presence of activity.","example_sentences":[]},"example_sentences":[{"sentence":"The company's success was attributed to the unidleness of its employees.","translation":"会社の成功は従業員の勤勉さによるものとされた。","type":"noun","meaning_category":"diligence"},{"sentence":"His unidleness at work earned him a promotion.","translation":"彼の仕事での勤勉さが昇進につながった。","type":"noun","meaning_category":"activity"}]}