{"word":"Pneumatophobia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"空気、風、または霊的な存在に対する恐怖症","english_definition":"The fear of air, wind, or spiritual beings.","examples":[{"sentence":"His pneumatophobia made it difficult for him to be outside on windy days.","translation":"彼の空気恐怖症のために、風の強い日に外にいるのが困難になった。"},{"sentence":"Pneumatophobia can be a debilitating condition for those who suffer from it.","translation":"空気恐怖症は、それに苦しむ人々にとって衰弱させる状態になる可能性がある。"}],"collocations":["fear of air","fear of wind","fear of spirits"],"synonyms":["anemophobia (fear of wind)","aerophobia (fear of drafts, air swallowing, or airborne noxious substances)"],"antonyms":[]}],"etymology":{"value":"The word \"pneumatophobia\" comes from the Greek words \"pneumato\" (πνεῦμα), meaning \"air, wind, breath, spirit,\" and \"phobos\" (φόβος), meaning \"fear.\"","priority":"★★★"},"pronunciation":{"ipa":"/ˌnuːmætəˈfoʊbiə/","syllables":"nu-ma-to-pho-bi-a"},"inflection":{"noun_plural":"pneumatophobias"},"usage_notes":{"explanation":"Pneumatophobia is a specific phobia related to the fear of air, wind, or spiritual entities. It is important to distinguish it from other related phobias such as anemophobia (fear of wind) or aerophobia (fear of drafts, air swallowing, or airborne noxious substances). The term is relatively rare, but it is used in psychology to describe this particular fear.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has pneumatophobia from heights.","correct":"✓ He has acrophobia (fear of heights).","note":"Pneumatophobia is related to air, wind, or spirits, not heights. Acrophobia is the fear of heights."}],"priority":"★★★"},"related_words":{"derivatives":["pneumato- (prefix related to air, breath, or spirit)","phobia (suffix meaning fear)"],"phrasal_verbs":[],"related_phobias":["anemophobia (fear of wind)","aerophobia (fear of drafts, air swallowing, or airborne noxious substances)","lilapsophobia (fear of tornadoes and hurricanes)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Pneumatophobia is a complex term referring to the fear of air, wind, or spiritual beings. Understanding this word requires knowledge of Greek roots and the concept of phobias. It is not a commonly used word and is typically found in psychological or medical contexts."},"example_sentences":[{"sentence":"The therapist helped her understand the root of her pneumatophobia.","translation":"セラピストは彼女が空気恐怖症の根源を理解するのを助けた。","type":"general","meaning_category":"fear of air, wind, or spirits"}]}