{"word":"subpagoda","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A smaller pagoda associated with a larger, more important pagoda.","english_definition":"A smaller pagoda that is part of a larger temple complex, often serving a secondary or supporting function to the main pagoda.","examples":[{"sentence":"The main pagoda was surrounded by several subpagodas, each with its own unique design.","translation":"主要な塔の周りにはいくつかの小さな塔があり、それぞれが独自の設計でした。"},{"sentence":"Pilgrims often visit the subpagodas to offer prayers and make donations.","translation":"巡礼者は、祈りを捧げ、寄付をするために、しばしば小さな塔を訪れます。"}],"collocations":["main pagoda and subpagodas","group of subpagodas","ancient subpagoda"],"synonyms":["minor pagoda","subsidiary pagoda","satellite pagoda"],"antonyms":[]}],"etymology":{"value":"The word \"subpagoda\" is formed by combining the prefix \"sub-\" (meaning under, below, or secondary) with the word \"pagoda\" (a tiered tower with multiple eaves, common in Asian countries).","priority":"N/A"},"pronunciation":{"ipa":"/sʌb.pəˈɡoʊ.də/","syllables":"sub-pa-go-da"},"inflection":{"noun_plural":"subpagodas"},"usage_notes":{"explanation":"The term \"subpagoda\" is relatively uncommon and mostly used in architectural or historical contexts when describing temple complexes with multiple pagodas. It emphasizes the hierarchical relationship between the main pagoda and the smaller, associated pagodas.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The subpagoda is the main attraction of the temple.","correct":"✓ The main pagoda is the main attraction of the temple.","note":"Subpagodas are typically secondary structures, not the main attraction."}],"priority":"N/A"},"related_words":{"derivatives":["pagoda","stupa","temple","complex"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low Frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The word 'subpagoda' is a specialized term used in the context of Asian architecture, specifically referring to smaller pagodas within a larger temple complex. Understanding this term requires familiarity with architectural terminology and Asian religious structures."},"example_sentences":[{"sentence":"The guide pointed out the intricate carvings on the subpagoda's eaves.","translation":"ガイドは、小さな塔の軒の複雑な彫刻を指摘しました。","type":"noun","meaning_category":"architecture"},{"sentence":"The subpagodas were built to honor lesser deities and ancestors.","translation":"小さな塔は、下位の神々や祖先を祀るために建てられました。","type":"noun","meaning_category":"religious architecture"}]}