{"word":"sporadicity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"散発性、不規則性、まれに起こること","english_definition":"The state or quality of being sporadic; occurring at irregular intervals or only in a few places; not widespread.","examples":[{"sentence":"The sporadicity of the events made it difficult to predict the outcome.","translation":"イベントの散発性により、結果を予測することが困難になりました。"},{"sentence":"The sporadicity of rainfall in the desert makes agriculture challenging.","translation":"砂漠での降雨の散発性により、農業は困難になっています。"},{"sentence":"The disease is characterized by its sporadicity, with cases appearing randomly across the country.","translation":"この病気は、国内で無作為に症例が発生する散発性が特徴です。"}],"collocations":["sporadicity of events","sporadicity of rainfall","sporadicity of cases","high sporadicity","low sporadicity"],"synonyms":["infrequency","irregularity","rarity","occasionality","intermittence"],"antonyms":["regularity","frequency","consistency","ubiquity","commonness"]}],"etymology":{"value":"Derived from the adjective 'sporadic', which comes from the Greek word 'sporadikos' meaning 'scattered, dispersed'. The suffix '-ity' is added to form the noun, indicating a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌspɒrəˈdɪsɪti/","syllables":"spo-ra-dic-i-ty"},"inflection":{"noun_plural":"sporadicities (rarely used)"},"usage_notes":{"explanation":"'Sporadicity' refers to the characteristic of something occurring irregularly, infrequently, or in isolated instances. It is often used in scientific, medical, or statistical contexts to describe patterns that lack predictability or uniformity. While 'sporadicity' is a valid word, it is less commonly used than its adjective form, 'sporadic'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sporadic was high.","correct":"✓ The sporadicity was high.","note":"'Sporadic' is an adjective, while 'sporadicity' is a noun. Use the correct form based on the grammatical context."},{"incorrect":"✗ The sporadicity event.","correct":"✓ The sporadic event.","note":"'Sporadicity' is a noun, so it cannot directly modify another noun. Use the adjective 'sporadic' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["sporadic (adjective)","sporadically (adverb)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Sporadicity' is a formal and relatively uncommon noun that describes the quality of being sporadic, meaning something occurs irregularly or infrequently. It is typically used in academic, scientific, or technical contexts. Because of its low frequency and formal nature, it is considered a C2 level word. It is more common to use the adjective 'sporadic' to describe something that occurs irregularly."},"example_sentences":[{"sentence":"The research focused on the sporadicity of the disease outbreaks in rural areas.","translation":"その研究は、農村地域における病気の発生の散発性に焦点を当てていた。","type":"noun","meaning_category":"irregular occurrence"},{"sentence":"Due to the sporadicity of funding, the project faced numerous delays.","translation":"資金提供の散発性のため、プロジェクトは何度も遅延に直面した。","type":"noun","meaning_category":"infrequency"},{"sentence":"The sporadicity of sightings made it difficult to confirm the existence of the rare species.","translation":"目撃情報の散発性により、その希少種の存在を確認することが困難になった。","type":"noun","meaning_category":"rarity"}]}