{"word":"particularistic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"特殊主義的な、個別主義的な、普遍的でない","english_definition":"Believing that some people or things are special and more important than others, or relating to a particular person, group, or thing rather than to general principles.","examples":[{"sentence":"A particularistic approach to ethics emphasizes the importance of context and individual circumstances.","translation":"倫理への特殊主義的なアプローチは、文脈と個々の状況の重要性を強調する。"},{"sentence":"The company's hiring practices were criticized for being particularistic, favoring certain groups over others.","translation":"その会社の採用慣行は、特定のグループを他のグループよりも優遇する特殊主義的であるとして批判された。"},{"sentence":"His particularistic views on history focused on specific events and individuals, rather than broad trends.","translation":"彼の歴史に関する個別主義的な見解は、広範な傾向よりも特定の出来事や個人に焦点を当てていた。"}],"collocations":["particularistic approach","particularistic values","particularistic criteria","particularistic policies","particularistic perspective"],"synonyms":["individualistic","specific","exclusive","localized","idiosyncratic"],"antonyms":["universalistic","general","inclusive","comprehensive","holistic"]},{"part_of_speech":"adjective","definition":"(社会学)特定の集団や関係性に基づいて判断や行動をする","english_definition":"(Sociology) Characterized by judgments and actions based on specific groups or relationships rather than universal standards.","examples":[{"sentence":"In a particularistic society, loyalty to family and friends often takes precedence over broader social obligations.","translation":"特殊主義的な社会では、家族や友人への忠誠心が、より広範な社会的義務よりも優先されることが多い。"},{"sentence":"The anthropologist studied the particularistic norms of the remote tribe.","translation":"人類学者は、その遠隔地の部族の特殊主義的な規範を研究した。"}],"collocations":["particularistic society","particularistic norms","particularistic culture","particularistic relationships"],"synonyms":["ascriptive","relational","contextual"],"antonyms":["universalistic","achievement-oriented","impartial","objective"]}],"etymology":{"value":"The word 'particularistic' is derived from 'particular', which comes from the Latin 'particula', meaning 'a small part'. The suffix '-istic' indicates a characteristic or belief system.","priority":"★★☆"},"pronunciation":{"ipa":"/pərˌtɪkjʊləˈrɪstɪk/","syllables":"par-tic-u-lar-is-tic"},"inflection":{"notes":"This word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Particularistic' is often used in contrast to 'universalistic'. A universalistic approach emphasizes general principles and rules that apply to everyone, while a particularistic approach focuses on the specific context, individuals, and relationships involved. It is often used in discussions of ethics, sociology, and political science. In sociological contexts, it describes societies where relationships and group affiliations influence decision-making more than universal standards.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The particularistic company treated all employees the same.","correct":"The universalistic company treated all employees the same.","note":"'Particularistic' implies treating people differently based on specific criteria, while 'universalistic' means treating everyone the same."},{"incorrect":"He had a very generalistic view, almost particularistic.","correct":"He had a very general view, not particularistic at all.","note":"'Generalistic' and 'particularistic' are opposites. A general view is broad, while a particularistic view is focused on specifics."}],"priority":"★★☆"},"related_words":{"derivatives":["particularism (noun)","particularist (noun)"],"related_terms":["universalistic","individualism","relativism","contextualism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Particularistic' is a relatively advanced term, often used in academic or specialized contexts. It describes a focus on specific details, individuals, or relationships rather than general principles or universal standards. Understanding this word requires a grasp of abstract concepts in fields like sociology, ethics, and political science. It is often contrasted with 'universalistic', which emphasizes broad, applicable rules.","priority":"★★☆"},"example_sentences":[{"sentence":"The judge's decision was criticized for being too particularistic, focusing on the defendant's personal circumstances rather than the law.","translation":"裁判官の判決は、法律よりも被告の個人的な事情に焦点を当てすぎており、特殊主義的であると批判された。","type":"adjective","meaning_category":"ethics/law"},{"sentence":"The anthropologist noted the particularistic nature of the tribe's social structure, which was based on kinship and lineage.","translation":"人類学者は、その部族の社会構造の特殊主義的な性質に注目した。それは血縁関係と血統に基づいていた。","type":"adjective","meaning_category":"sociology"},{"sentence":"The company's particularistic approach to marketing involved tailoring campaigns to specific customer segments.","translation":"その会社のマーケティングへの特殊主義的なアプローチは、特定の顧客セグメントに合わせたキャンペーンを展開することを含んでいた。","type":"adjective","meaning_category":"business"},{"sentence":"The historian argued that the causes of the war were not universal, but rather particularistic to the specific historical context.","translation":"歴史家は、戦争の原因は普遍的なものではなく、特定の歴史的背景に特殊主義的であると主張した。","type":"adjective","meaning_category":"history"}]}