{"word":"Julianist","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A follower of Julian of Eclanum, who opposed Augustine's doctrine of original sin.","english_definition":"A follower of Julian of Eclanum, a bishop who opposed Augustine's views on original sin, predestination, and grace in the early 5th century.","examples":[{"sentence":"The Julianists held that humans are born morally neutral and possess free will to choose good or evil.","translation":"ユリアヌス主義者は、人間は道徳的に中立な状態で生まれ、善悪を選択する自由意志を持つと主張した。"}],"collocations":["Julianist theology","Julianist controversy"],"synonyms":["N/A"],"antonyms":["Augustinian"]},{"part_of_speech":"adjective","definition":"Relating to Julian of Eclanum or his theological views.","english_definition":"Relating to Julian of Eclanum or the theological positions associated with him, particularly his opposition to Augustine's doctrines.","examples":[{"sentence":"Julianist arguments emphasized the goodness of creation and the inherent capacity of humans to do good.","translation":"ユリアヌス主義の議論は、創造の善良さと、人間が善を行う生来の能力を強調した。"}],"collocations":["Julianist doctrine","Julianist perspective"],"synonyms":["N/A"],"antonyms":["Augustinian"]}],"etymology":{"value":"Derived from the name of Julian of Eclanum (c. 386 – c. 455), an Italian bishop and theologian.","priority":"★★☆"},"pronunciation":{"ipa":"ˈdʒuːliənɪst","syllables":"Ju-li-an-ist"},"inflection":{"noun_plural":"Julianists"},"usage_notes":{"explanation":"The term \"Julianist\" refers specifically to the followers of Julian of Eclanum and their theological beliefs, primarily concerning original sin, grace, and free will. They opposed Augustine's more pessimistic view of human nature after the Fall, arguing for the inherent goodness of creation and the capacity of humans to choose good. The term is primarily used in historical and theological contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a Julianist, believing in predestination.","correct":"✓ He was an Augustinian, believing in predestination.","note":"Julianists opposed the doctrine of predestination, while Augustinians supported it."}],"priority":"★★☆"},"related_words":{"derivatives":["Julianism"],"related_terms":["Pelagianism (related but distinct theological view)","Augustinianism (the opposing theological view)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - primarily used in academic or theological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"Julianist\" is a specialized term used in the context of early Christian theology, specifically referring to followers of Julian of Eclanum. Understanding this term requires familiarity with the historical debates surrounding original sin, free will, and grace in the 5th century. It is not a term commonly encountered outside of academic or theological discussions. Understanding the opposing viewpoint of Augustinianism is crucial for comprehending the Julianist position."},"example_sentences":[{"sentence":"The debate between Augustinians and Julianists shaped much of the theological discourse in the 5th century.","translation":"アウグスティヌス主義者とユリアヌス主義者の間の論争は、5世紀の神学的議論の多くを形作った。","type":"historical context","meaning_category":"theological follower"},{"sentence":"Julianist theology emphasized the role of free will in salvation.","translation":"ユリアヌス主義神学は、救済における自由意志の役割を強調した。","type":"theological context","meaning_category":"theological belief"}]}