{"word":"phenylmethane","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"フェニルメタン (別名: トルエン)","english_definition":"A colorless, flammable liquid aromatic hydrocarbon with the chemical formula C6H5CH3. It is a common solvent and a precursor in the production of many chemicals. Also known as toluene.","examples":[{"sentence":"Phenylmethane is used as a solvent in paints and coatings.","translation":"フェニルメタンは塗料やコーティング剤の溶媒として使用されます。"},{"sentence":"Toluene, also known as phenylmethane, is an important industrial chemical.","translation":"トルエン、別名フェニルメタンは、重要な工業用化学物質です。"}],"collocations":["solvent","industrial chemical","precursor","aromatic hydrocarbon"],"synonyms":["toluene","methylbenzene"],"antonyms":[]}],"etymology":{"value":"The name 'phenylmethane' is a systematic name derived from the structure of the molecule, which can be seen as a methane molecule (CH4) with one hydrogen atom replaced by a phenyl group (C6H5).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɛnɪlˈmɛθeɪn/","syllables":"phen-yl-methane"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"'Phenylmethane' is a systematic chemical name for toluene. While chemically accurate, the name 'toluene' is far more commonly used in both scientific and industrial contexts. Therefore, 'phenylmethane' is rarely encountered outside of very specific chemical nomenclature discussions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need phenylmethane for my car.","correct":"✓ I need gasoline for my car.","note":"Phenylmethane (toluene) is not used directly as a fuel for cars. Gasoline is a mixture of hydrocarbons, including toluene, but it's not the primary component."}],"priority":"★★☆"},"related_words":{"derivatives":["phenyl (chemical group)","methane (parent alkane)"],"phrasal_verbs":[],"related_compounds":["benzene","xylene","ethylbenzene"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (technical vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Phenylmethane' is a formal chemical name for toluene, a common solvent and industrial chemical. It is primarily used in technical and scientific contexts. Because the common name 'toluene' is much more prevalent, understanding 'phenylmethane' is only necessary for advanced chemistry or related fields."},"example_sentences":[{"sentence":"The reaction was carried out in phenylmethane as a solvent.","translation":"その反応は溶媒としてフェニルメタン中で行われた。","type":"noun","meaning_category":"chemical solvent"},{"sentence":"The spectrum of phenylmethane was analyzed to confirm its purity.","translation":"その純度を確認するためにフェニルメタンのスペクトルが分析された。","type":"noun","meaning_category":"chemical compound"}]}