{"word":"Methemoglobinemia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"メトヘモグロビン血症","english_definition":"A condition characterized by elevated levels of methemoglobin in the blood. Methemoglobin is a form of hemoglobin that cannot effectively carry oxygen to the body's tissues.","examples":[{"sentence":"Methemoglobinemia can be caused by certain medications or exposure to certain chemicals.","translation":"メトヘモグロビン血症は、特定の薬物や特定の化学物質への曝露によって引き起こされる可能性があります。"},{"sentence":"Symptoms of methemoglobinemia include cyanosis, shortness of breath, and fatigue.","translation":"メトヘモグロビン血症の症状には、チアノーゼ、息切れ、疲労などがあります。"}],"collocations":["acquired methemoglobinemia","congenital methemoglobinemia","treat methemoglobinemia","cause methemoglobinemia"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'methemoglobin' (a form of hemoglobin) + '-emia' (a condition of the blood).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɛθhiːməˈɡloʊbɪˈniːmiə/","syllables":"meth-hem-o-glo-bi-ne-mi-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Methemoglobinemia is a blood disorder where an abnormal amount of methemoglobin is produced. Methemoglobin cannot release oxygen effectively to tissues, leading to hypoxia. The condition can be acquired (due to exposure to certain substances) or congenital (due to genetic defects).","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["methemoglobin","hemoglobin","cyanosis","hypoxia"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Methemoglobinemia' is a complex medical term referring to a condition with elevated methemoglobin levels in the blood, impairing oxygen delivery. It requires a strong understanding of medical terminology and physiology to fully grasp.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient presented with severe cyanosis, indicative of possible methemoglobinemia.","translation":"患者は重度のチアノーゼを呈しており、メトヘモグロビン血症の可能性を示唆していました。","type":"medical","meaning_category":"symptom"},{"sentence":"Methylene blue is often used to treat cases of acquired methemoglobinemia.","translation":"メチレンブルーは、後天性メトヘモグロビン血症の治療によく使用されます。","type":"treatment","meaning_category":"treatment"},{"sentence":"Genetic testing can help diagnose congenital forms of methemoglobinemia.","translation":"遺伝子検査は、先天性メトヘモグロビン血症の診断に役立ちます。","type":"diagnosis","meaning_category":"diagnosis"}]}