{"word":"Epitoxoid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A modified toxin that retains its ability to stimulate antibody production but has reduced toxicity.","english_definition":"A modified toxin that has lost its toxicity but retains its antigenic properties, used to stimulate antibody production.","examples":[{"sentence":"Epitoxoids are used in some vaccines to provide immunity against toxins.","translation":"エピトキソイドは、毒素に対する免疫を提供するために、一部のワクチンで使用されています。"}],"collocations":["use of epitoxoid","epitoxoid vaccine","preparation of epitoxoid"],"synonyms":["toxoid","detoxified toxin"],"antonyms":[]}],"etymology":{"value":"From 'epi-' (upon, over) + 'toxoid' (a toxin that has been modified).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛpɪˈtɒksɔɪd/","syllables":"ep-i-tox-oid"},"inflection":{"noun_plural":"epitoxoids"},"usage_notes":{"explanation":"Epitoxoids are primarily used in the context of immunology and vaccine development. They represent a safer alternative to using unmodified toxins to induce an immune response.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The epitoxoid was highly toxic.","correct":"✓ The epitoxoid was designed to have reduced toxicity.","note":"Epitoxoids are modified to reduce toxicity, so describing them as highly toxic is incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":["epitoxoidation"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Epitoxoid' is a highly specialized term used in immunology and vaccine research. It refers to a modified toxin that retains its ability to stimulate antibody production but has reduced toxicity. This term is unlikely to be encountered outside of scientific or medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The epitoxoid vaccine showed promising results in preclinical trials.","translation":"エピトキソイドワクチンは、前臨床試験で有望な結果を示しました。","type":"noun","meaning_category":"immunology"},{"sentence":"Researchers are exploring new methods for epitoxoid production.","translation":"研究者たちは、エピトキソイドの新しい製造方法を模索しています。","type":"noun","meaning_category":"immunology"}]}