{"word":"anaphoria","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(言語学)前方照応、前出指示","english_definition":"(linguistics) the use of a word or phrase to refer back to a word or phrase which was used earlier in a text or conversation.","examples":[{"sentence":"'John arrived late, but he didn't explain why.' 'He' is an example of anaphoria, referring back to 'John'.","translation":"「ジョンは遅れて到着したが、彼は理由を説明しなかった。」「彼」は前方照応の例であり、「ジョン」を指し示している。"},{"sentence":"Anaphoria helps to avoid unnecessary repetition in writing.","translation":"前方照応は、文章中の不必要な繰り返しを避けるのに役立つ。"}],"collocations":["anaphoric reference","anaphoric expression","resolve anaphoria"],"synonyms":["reference","cross-reference","antecedent","pronominalization"],"antonyms":["cataphora (後方照応)"]},{"part_of_speech":"noun","definition":"(修辞学)反復法、反復","english_definition":"(rhetoric) the repetition of a word or phrase at the beginning of successive clauses or sentences.","examples":[{"sentence":"'Every day, every night, in every way, I am getting better and better' is an example of anaphoria.","translation":"「毎日、毎晩、あらゆる面で、私はどんどん良くなっている」は反復法の例である。"},{"sentence":"Martin Luther King Jr. used anaphoria effectively in his 'I Have a Dream' speech.","translation":"マーティン・ルーサー・キング・ジュニアは、彼の「私には夢がある」という演説で、反復法を効果的に使用した。"}],"collocations":["rhetorical anaphoria","use anaphoria","create anaphoria"],"synonyms":["repetition","epistrophe (対義語: 語尾反復)","epanaphora"],"antonyms":["epistrophe (語尾反復)"]}],"etymology":{"value":"Late Latin, from Greek 'anaphora' (ἀναφορά), meaning 'a carrying back, reference,' from 'ana-'(ἀνά) 'up, back' + 'pherein' (φέρειν) 'to carry.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænəˈfɔːriə/","syllables":"a-na-pho-ri-a"},"inflection":{"notes":"Plural: anaphorias or anaphora (Greek plural)."},"usage_notes":{"explanation":"'Anaphoria' has two main meanings:\n\n1.  In linguistics, it refers to the use of a word or phrase (typically a pronoun) to refer back to something already mentioned. This helps make writing and speech more concise and less repetitive.\n2.  In rhetoric, it is a literary device involving the repetition of a word or phrase at the beginning of successive clauses or sentences for emphasis and artistic effect.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The opposite of anaphoria is metaphor.","correct":"✓ The opposite of anaphoria is cataphora (in linguistics) or epistrophe (in rhetoric).","note":"Metaphor is a figure of speech involving comparison, not a type of referencing like anaphoria. The opposite of anaphoria (forward referencing) is cataphora (backward referencing) in linguistics, and epistrophe (repetition at the end) in rhetoric."},{"incorrect":"✗ Anaphoria is only used in poetry.","correct":"✓ Anaphoria is used in various forms of writing and speech, including prose, speeches, and poetry.","note":"While anaphoria is a rhetorical device often found in poetry, it is also used in other forms of communication to create emphasis and rhythm."}],"priority":"★★☆"},"related_words":{"derivatives":["anaphoric (adjective)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anaphoria' is a term used in both linguistics and rhetoric. In linguistics, it describes how a word or phrase refers back to something mentioned earlier, like how 'he' refers back to 'John' in a sentence. In rhetoric, it's a technique where you repeat a word or phrase at the beginning of several sentences or clauses to create emphasis, like in famous speeches. Understanding anaphoria helps you analyze how language is used to create connections and impact in texts and speeches."},"example_sentences":[{"sentence":"In the sentence, 'The dog barked, and it ran away,' 'it' is an example of **anaphoria**.","translation":"「犬が吠え、そしてそれは逃げた」という文では、「それ」は前方照応の例である。","type":"linguistics","meaning_category":"前方照応"},{"sentence":"Abraham Lincoln's '...government of the people, by the people, for the people...' is a famous example of **anaphoria**.","translation":"エイブラハム・リンカーンの「…人民の、人民による、人民のための政治…」は、反復法の有名な例である。","type":"rhetoric","meaning_category":"反復法"},{"sentence":"The writer used **anaphoria** to emphasize the importance of each point.","translation":"作家は、各ポイントの重要性を強調するために反復法を使用した。","type":"rhetoric","meaning_category":"反復法"},{"sentence":"Resolving **anaphoria** is a key task in natural language processing.","translation":"前方照応の解決は、自然言語処理における重要なタスクである。","type":"linguistics","meaning_category":"前方照応"}]}