{"word":"relic-vending","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"The act or practice of selling relics, especially religious relics.","english_definition":"The selling of relics, particularly those of religious significance.","examples":[{"sentence":"The church condemned the relic-vending that was occurring at the shrine.","translation":"教会はその聖堂で起こっていた聖遺物販売を非難した。"},{"sentence":"He made a fortune through relic-vending, exploiting the faith of pilgrims.","translation":"彼は巡礼者の信仰を利用して、聖遺物販売で財を成した。"}],"collocations":["illegal relic-vending","fraudulent relic-vending","historical relic-vending"],"synonyms":["relic peddling","relic mongering"],"antonyms":["relic preservation","relic conservation"]}],"etymology":{"value":"Derived from 'relic' (an object surviving from an earlier time, especially one of historical or sentimental interest) and 'vending' (the act of selling).","priority":"N/A"},"pronunciation":{"ipa":"ˈrɛlɪkˌvɛndɪŋ","syllables":"re-lic-vend-ing"},"inflection":{"noun_plural":"relic-vendings"},"usage_notes":{"explanation":"'Relic-vending' typically refers to the sale of objects claimed to have religious or historical significance, often with implications of fraud or exploitation. It is frequently used in contexts discussing the history of religious practices or critiques of commercialization within religious institutions.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The museum was involved in relic-vending.","correct":"✓ The museum was involved in relic sales.","note":"'Relic-vending' often implies a negative connotation of exploitation or fraud, so 'relic sales' is a more neutral term for legitimate transactions. "},{"incorrect":"✗ Relic-vending is a good way to preserve history.","correct":"✓ Relic preservation is a good way to preserve history.","note":"'Relic-vending' and 'relic preservation' are nearly antonyms. Selling relics doesn't preserve them."}],"priority":"N/A"},"related_words":{"derivatives":["relic","vending","reliquary"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Relic-vending' is a specialized term referring to the sale of relics, often in a religious context. The word combines 'relic,' an object of historical or religious significance, with 'vending,' the act of selling. Understanding this term requires familiarity with both the concept of relics and the commercial activities associated with them. It is often used in discussions about the commercialization of religion or the authenticity of historical artifacts."},"example_sentences":[{"sentence":"The practice of relic-vending was widespread during the Middle Ages.","translation":"中世には聖遺物販売の慣習が広まっていた。","type":"noun","meaning_category":"selling of relics"},{"sentence":"Critics accused the church of engaging in unethical relic-vending.","translation":"批評家たちは教会が非倫理的な聖遺物販売に関与していると非難した。","type":"noun","meaning_category":"selling of relics"}]}